doc/CAPI.org
#+TITLE: MRHT接口C函数文档

#+AUTHOR: nieshizhong

#+OPTIONS: ^:nil



* device.h

