doc/CAPI.org
** int mrgFindGateWay(int  bus, char *output, int len, int method);

   查找网关。

   bus :总线类型. ＝0，网络接口；＝1，USBTMC接口

   output：查找到的设备描述符，多个设备之间以逗号分隔

   len : output的最大容量（字节个数）

   method:当网关设备使用网络连接时，在查找网关设备时有两种查找方式：

   method = 0,使用VISA查找方式；

   method = 1,使用UDP方式查找

   返回值：查找到的设备个数



