doc/CAPI.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-09 五 12:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MRHT接口C函数文档</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="nieshizhong" />
</head>
<body>
<div id="content">
<h1 class="title">MRHT接口C函数文档</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf4e7c03">1. device.h</a>
<ul>
<li><a href="#org33339b4">1.1. int mrgFindGateWay(int  bus, char *output, int len, int method);</a></li>
<li><a href="#orga53f435">1.2. int mrgOpenGateWay(char *desc, int timeout_ms);</a></li>
<li><a href="#orge8fab9a">1.3. int mrgCloseGateWay(ViSession  vi);</a></li>
<li><a href="#orge005fe8">1.4. int mrgGateWaySendCmd(ViSession  vi, char *cmd, int len);</a></li>
<li><a href="#orgccd5efb">1.5. int mrgGateWayRead(ViSession  vi, char * output, int wantlen);</a></li>
<li><a href="#orgbbe6415">1.6. int mrgGateWayQuery(ViSession  vi, char *cmd, char *output, int wantlen);</a></li>
<li><a href="#orgdf94bca">1.7. int mrgGateWayIDNQuery(ViSession  vi, char *idn);</a></li>
<li><a href="#orgd3849a7">1.8. int mrgFindDevice(ViSession vi, int timeout_ms);</a></li>
<li><a href="#org7046559">1.9. int mrgGetDeviceName(ViSession vi, int *names);</a></li>
<li><a href="#orgbfad3f9">1.10. int mrgGetDeviceType(ViSession vi, int name, char *type);</a></li>
<li><a href="#orgce0f35a">1.11. int mrgGetDeviceChannelCount(ViSession vi, int name);</a></li>
<li><a href="#orge60b894">1.12. int mrgGetDeviceInfo(ViSession vi, int name, char *info);</a></li>
<li><a href="#org98d661c">1.13. int mrgGetDeviceSoftVersion(ViSession vi, int name, char *version);</a></li>
<li><a href="#org41191ae">1.14. int mrgGetDeviceFirmWareHard(ViSession vi, int name, char *buf);</a></li>
<li><a href="#orge21b58c">1.15. int mrgGetDeviceFirmWareBoot(ViSession vi, int name, char *buf);</a></li>
<li><a href="#org7679c86">1.16. int mrgGetDeviceFirmWareFpga(ViSession vi, int name, char *buf);</a></li>
<li><a href="#org4d29f9d">1.17. int mrgWriteDeviceSerial(ViSession  vi, int name, char *serial);</a></li>
<li><a href="#orga505d5a">1.18. int mrgGetDeviceSerialNumber(ViSession vi, int name, char *serial);</a></li>
<li><a href="#org30e9abb">1.19. int mrgIdentify(ViSession vi, int state);</a></li>
<li><a href="#orga5e22cd">1.20. int mrgModeSwitch(ViSession vi, int mode);</a></li>
<li><a href="#org6373109">1.21. int mrgGetXinState(ViSession vi, int *state);</a></li>
<li><a href="#orgbbc92c9">1.22. int mrgSetYoutState(ViSession vi, int yout, int state);</a></li>
</ul>
</li>
<li><a href="#org473d162">2. megarobot.h</a>
<ul>
<li><a href="#org67888bf">2.1. MRX_TYPE(enum)</a></li>
<li><a href="#org4e75276">2.2. int mrgBuildRobot(ViSession vi, char *robotType, char *chlist, int *robotname);</a></li>
<li><a href="#org5aab961">2.3. int mrgBuildRobotNamed(ViSession vi, char *robotType, char *devList, int robotid, int *robotname);</a></li>
<li><a href="#orgcaaf511">2.4. int mrgDeleteRobot(ViSession vi, int name);</a></li>
<li><a href="#org3fc2610">2.5. int mrgSetRobotLinks(ViSession vi, int name, float *links, int link_count);</a></li>
<li><a href="#org80e4865">2.6. int mrgGetRobotLinks(ViSession vi, int name, float *links, int *link_count);</a></li>
<li><a href="#org3c9cf9e">2.7. int mrgGetRobotType(ViSession vi, int name);</a></li>
<li><a href="#org4f6afab">2.8. int mrgExportRobotConfig(ViSession vi);</a></li>
<li><a href="#orgd4efec3">2.9. int mrgExportRobotConfig_default(ViSession vi);</a></li>
<li><a href="#org6e6dca4">2.10. int mrgRestoreRobotConfig(ViSession vi);</a></li>
<li><a href="#org0be1b30">2.11. int mrgGetRobotConfigState(ViSession vi);</a></li>
<li><a href="#orgfefd65f">2.12. int mrgSetRobotMachineSerialNum(ViSession vi, int name, char *sn);</a></li>
<li><a href="#orgdce4b22">2.13. int mrgGetRobotMachineSerialNum(ViSession vi, int name, char*serial);</a></li>
<li><a href="#orgbbdd1f4">2.14. int mrgSetRobotSubType(ViSession vi, int name, int subtype);</a></li>
<li><a href="#orgf056117">2.15. int mrgGetRobotSubType(ViSession vi, int name);</a></li>
<li><a href="#org782f0d4">2.16. int mrgSetRobotCoordinateSystem(ViSession vi, int name, int coord);</a></li>
<li><a href="#org27474be">2.17. int mrgGetRobotCoordinateSystem(ViSession vi, int name);</a></li>
<li><a href="#org20c615c">2.18. int mrgGetRobotCount(ViSession vi);</a></li>
<li><a href="#orgca1447a">2.19. int mrgGetRobotName(ViSession vi, int *robotnames);</a></li>
<li><a href="#orgf82d2d8">2.20. int mrgGetRobotDevice(ViSession vi, int robotname, int *device);</a></li>
<li><a href="#orgc452562">2.21. int mrgSetRobotProjectZero(ViSession vi, int name, float x, float y, float z);</a></li>
<li><a href="#org2c98a8c">2.22. int mrgGetRobotProjectZero(ViSession vi, int name, float *x, float *y, float *z);</a></li>
<li><a href="#org095f3e3">2.23. int mrgSetRobotAxisZero(ViSession vi, int name, float x, float y, float z);</a></li>
<li><a href="#org3181a13">2.24. int mrgGetRobotAxisZero(ViSession vi, int name, float *x, float *y, float *z);</a></li>
<li><a href="#org5174b50">2.25. int mrgSetRobotSoftWareLimit(ViSession vi, int name, int type, float x, float y, float z);</a></li>
<li><a href="#org5c66ec8">2.26. int mrgGetRobotSoftWareLimit(ViSession vi, int name, int type, float *x, float *y, float *z);</a></li>
<li><a href="#orgf5f05e0">2.27. int mrgSetRobotWavetable(ViSession vi, int name, int wavetable);</a></li>
<li><a href="#org464c6bc">2.28. int mrgRobotWavetableQuery(ViSession vi, int name);</a></li>
<li><a href="#orgeffe3d4">2.29. int mrgRobotRun(ViSession vi, int name, int wavetable);</a></li>
<li><a href="#orgcbf08ae">2.30. int mrgRobotStop(ViSession vi, int name, int wavetable);</a></li>
<li><a href="#orge8ff97c">2.31. int mrgGetRobotStates(ViSession vi, int name, int wavetable, char *state);</a></li>
<li><a href="#org68c6b10">2.32. int mrgRobotWaitReady(ViSession vi, int name, int wavetable, int timeout_ms);</a></li>
<li><a href="#org5dbbd7c">2.33. int mrgRobotWaitEnd(ViSession vi, int name, int wavetable, int timeout_ms);</a></li>
<li><a href="#orge07d67a">2.34. int mrgRobotMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</a></li>
<li><a href="#orge227596">2.35. int mrgRobotMoveOn(ViSession vi, int name, int wavetable, float x, float y, float z, float speed);</a></li>
<li><a href="#org7470fa8">2.36. int mrgRobotAxisMoveOn(ViSession vi, int name, int wavetable, int ax, float speed);</a></li>
<li><a href="#org90eb1c8">2.37. int mrgRobotAxisMoveJog(ViSession vi, int name, int wavetable, int ax, float cr_time, float cr_speed, float speed);</a></li>
<li><a href="#org41c04c9">2.38. int mrgRobotRelMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</a></li>
<li><a href="#org7846a2f">2.39. int mrgRobotMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</a></li>
<li><a href="#org56b1ef8">2.40. int mrgRobotRelMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</a></li>
<li><a href="#orgbc26d1f">2.41. int mrgSetRobotInterPolateMode(ViSession vi, int name, int mode);</a></li>
<li><a href="#orgc4810be">2.42. int mrgGetRobotInterPolateMode(ViSession vi, int name, int* mode);</a></li>
<li><a href="#org98016f1">2.43. int mrgSetRobotInterPolateStep(ViSession vi, int name, float step);</a></li>
<li><a href="#org0b2f33b">2.44. int mrgGetRobotInterPolateStep(ViSession vi, int name, float* step);</a></li>
<li><a href="#orgf031a4a">2.45. int mrgSetRobotHomeWavetable(ViSession vi, int name, int wavetable);</a></li>
<li><a href="#org070f576">2.46. int mrgGetRobotHomeWavetable(ViSession vi, int name);</a></li>
<li><a href="#org6ee1528">2.47. int mrgRobotGoHome(ViSession vi, int name, int timeout_ms);</a></li>
<li><a href="#org60e3004">2.48. int mrgRobotGoHomeWithParam(ViSession vi, int name, float param, int timeout_ms);</a></li>
<li><a href="#org5b4060d">2.49. int mrgRobotGoHomeStop(ViSession vi, int name);</a></li>
<li><a href="#org472891d">2.50. int mrgRobotWaitHomeEnd(ViSession vi, int name, int timeout_ms);</a></li>
<li><a href="#orgb89bfc8">2.51. int mrgGetRobotHomeAngle(ViSession vi, int name, float *angles);</a></li>
<li><a href="#orgedb427e">2.52. int mrgGetRobotHomePosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</a></li>
<li><a href="#org69c0adb">2.53. int mrgSetRobotHomeMode(ViSession vi, int name, int mode);</a></li>
<li><a href="#org910271b">2.54. int mrgGetRobotHomeMode(ViSession vi, int name);</a></li>
<li><a href="#org98742b7">2.55. int mrgGetRobotHomeRequire(ViSession vi, int name);</a></li>
<li><a href="#orgb83941d">2.56. int mrgRobotPointClear(ViSession vi, int name);</a></li>
<li><a href="#orgd1c0451">2.57. int mrgRobotPointLoad(ViSession vi, int name, float x, float y, float z, float end, float time,int mod,float step);</a></li>
<li><a href="#org2c2a803">2.58. int mrgRobotPointResolve(ViSession vi, int name, int wavetable, int timeout_ms);</a></li>
<li><a href="#orge3c33c4">2.59. int mrgRobotPvtClear(ViSession vi, int name);</a></li>
<li><a href="#org4e6dfeb">2.60. int mrgRobotPvtLoad(ViSession vi, int name, float p, float v, float t, int axle);</a></li>
<li><a href="#org2838a32">2.61. int mrgRobotPvtResolve(ViSession vi, int name, int wavetable, int timeout_ms);</a></li>
<li><a href="#org384ee2c">2.62. int mrgRobotMotionFileImport(ViSession vi, int name,char* filename);</a></li>
<li><a href="#orga8a37fb">2.63. int mrgRobotMotionFileImportLocal(ViSession vi, int name, char* filename);</a></li>
<li><a href="#orga8b3146">2.64. int mrgRobotMotionFileImportExternal(ViSession vi, int name, char* filename);</a></li>
<li><a href="#org08f383f">2.65. int mrgRobotFileResolve(ViSession vi, int name, int section, int line, int wavetable, int timeout_ms);</a></li>
<li><a href="#orge306379">2.66. int mrgRobotMotionFileExport(ViSession vi, int name, int location, char* filename);</a></li>
<li><a href="#orgba10a23">2.67. int mrgRobotToolSet(ViSession vi, int robotname, int type, char* dev);</a></li>
<li><a href="#org9bde271">2.68. int mrgRobotWaitToolExeEnd(ViSession vi, int name, int timeout_ms);</a></li>
<li><a href="#org151b84a">2.69. int mrgRobotToolExe(ViSession vi, int name, float position, float time, int timeout_ms);</a></li>
<li><a href="#org13575b4">2.70. int mrgRobotToolStop(ViSession vi, int name);</a></li>
<li><a href="#org607e3a6">2.71. int mrgRobotToolStopGoHome(ViSession vi, int name);</a></li>
<li><a href="#org9ab509b">2.72. int mrgRobotToolGoHome(ViSession vi, int name, int timeout_ms);</a></li>
<li><a href="#org00eed3d">2.73. int mrgGetRobotToolPosition(ViSession vi, int name, float *position);</a></li>
<li><a href="#org89570ad">2.74. int mrgRobotGetToolType(ViSession vi, int robotname, int * type);</a></li>
<li><a href="#orgf90f566">2.75. int mrgRobotToolExeMode(ViSession vi, int name, int mode);</a></li>
<li><a href="#orgd6160c2">2.76. int mrgRobotToolExeMode_Query(ViSession vi, int name, int* mode);</a></li>
<li><a href="#org199b0f9">2.77. int mrgGetRobotCurrentAngle(ViSession vi, int name, float *angles);</a></li>
<li><a href="#org1f4b6a7">2.78. int mrgGetRobotCurrentPosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</a></li>
<li><a href="#org21a9485">2.79. int mrgRobotJointHome(ViSession vi, int name, int axi, float speed, int timeout_ms);</a></li>
<li><a href="#org079f1a2">2.80. int mrgRobotJointMove(ViSession vi, int name, int axi, float position, float time, int timeout_ms);</a></li>
<li><a href="#org6505fe3">2.81. int mrgRobotJointMoveOn(ViSession vi, int name, int axi, float speed);</a></li>
<li><a href="#org8ab301b">2.82. int mrgGetRobotJointAngle(ViSession vi, int name, int joint, float *angle);</a></li>
<li><a href="#org2ef76c7">2.83. int mrgGetRobotCurrentMileage(ViSession vi, int name, float <b>x, float *y, float</b> z);</a></li>
<li><a href="#org69a5690">2.84. int mrgGetRobotTargetPosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</a></li>
<li><a href="#org0c0d2d5">2.85. int mrgGetRobotCurrentRecord(ViSession vi, int name, int *record);</a></li>
<li><a href="#orgf80a569">2.86. int mrgGetRobotWristPose(ViSession vi, int name, float *angle);</a></li>
<li><a href="#orga90d4d3">2.87. int mrgSetRobotWristPose(ViSession vi, int name, float angle,float time,int timeout_ms);</a></li>
<li><a href="#org3561529">2.88. int mrgSetRobotFold(ViSession vi, int name, float axi0, float axi1, float axi2, float axi3, int timeout);</a></li>
<li><a href="#org80f3e2b">2.89. int mrgGetRobotFoldState(ViSession vi, int name);</a></li>
</ul>
</li>
<li><a href="#org02aa095">3. mrqdevice.h</a>
<ul>
<li><a href="#orgd86667b">3.1. enum RUN_STATE</a></li>
<li><a href="#orgab55eda">3.2. enum MT_STATE</a></li>
<li><a href="#org4b41285">3.3. enum MT_SWITCH</a></li>
<li><a href="#org610d471">3.4. int mrgMRQIdentify(ViSession vi, int name, int state);</a></li>
<li><a href="#orgea7383b">3.5. int mrgGetMRQDioState(ViSession vi, int name, unsigned short *state);</a></li>
<li><a href="#org92e30b0">3.6. int mrgGetMRQGroup(ViSession vi, char *devList, unsigned int *groupID, int grouptype);</a></li>
<li><a href="#org837b05c">3.7. int mrgMRQMotionStateReport(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org2ebf802">3.8. int mrgMRQMotionStateReport_Query(ViSession vi, int name, int ch,int *state);</a></li>
<li><a href="#org135b21f">3.9. int mrgMRQMotionRun(ViSession vi, int name, int ch, int wavetable);</a></li>
<li><a href="#orgdb8e683">3.10. int mrgMRQMotionRunState_Query(ViSession vi, int name, int ch, int wavetable, int*robotstate);</a></li>
<li><a href="#org90620bc">3.11. int mrgMRQMotionWaitReady(ViSession vi, int name, int ch, int wavetable, int timeout_ms);</a></li>
<li><a href="#org66b2c1c">3.12. int mrgMRQMotionWaitEnd(ViSession vi, int name, int ch, int wavetable, int timeout_ms);</a></li>
<li><a href="#orgb1299c5">3.13. int mrgMRQMotionStop(ViSession vi, int name, int ch, int wavetable);</a></li>
<li><a href="#orga5f2227">3.14. int mrgMRQMotionTrigSource(ViSession vi, int name, int ch, int source);</a></li>
<li><a href="#org18616d7">3.15. int mrgMRQMotionTrigSource_Query(ViSession vi, int name, int ch, int *source);</a></li>
<li><a href="#org291a926">3.16. int mrgMRQMotionOffsetState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org4de632f">3.17. int mrgMRQMotionOffsetState_Query(ViSession vi, int name, int ch, int *state);</a></li>
<li><a href="#orgb063086">3.18. int mrgMRQMotionOffsetValue_Query(ViSession vi, int name, int ch, float *distance);</a></li>
<li><a href="#orgf67a198">3.19. int mrgMRQMotionABCount_Query(ViSession vi, int name, int ch);</a></li>
<li><a href="#orgcacc9be">3.20. int mrgMRQMotionABCountClear(ViSession vi, int name, int ch);</a></li>
<li><a href="#org901ea81">3.21. int mrgMRQMotionReverse(ViSession vi, int name, int state);</a></li>
<li><a href="#orga9d6c46">3.22. int mrgMRQMotionReverse_Query(ViSession vi, int name,int *reverse);</a></li>
<li><a href="#org3a13a33">3.23. int mrgMRQAdjust(ViSession vi, int name, int ch, int wavetable,float position, float time, int timeout_ms);</a></li>
<li><a href="#org8469161">3.24. int mrgMRQClockSync(ViSession vi, char *name_list, float time);</a></li>
<li><a href="#orgdece2f8">3.25. int mrgMRQMotorStepAngle(ViSession vi, int name, int ch, int stepangle);</a></li>
<li><a href="#org1f84418">3.26. int mrgMRQMotorStepAngle_Query(ViSession vi, int name, int ch, int *stepangle);</a></li>
<li><a href="#org8d91bc7">3.27. int mrgMRQMotorMotionType(ViSession vi, int name, int ch, int type);</a></li>
<li><a href="#org559fb06">3.28. int mrgMRQMotorMotionType_Query(ViSession vi, int name, int ch, int *type);</a></li>
<li><a href="#orge782136">3.29. int mrgMRQMotorPositionUnit(ViSession vi, int name, int ch, int unit);</a></li>
<li><a href="#org7434661">3.30. int mrgMRQMotorPositionUnit_Query(ViSession vi, int name, int ch, int *unit);</a></li>
<li><a href="#org7c5e3da">3.31. int mrgMRQMotorGearRatio(ViSession vi, int name, int ch, int a, int b);</a></li>
<li><a href="#orgc32d1e8">3.32. int mrgMRQMotorGearRatio_Query(ViSession vi, int name, int ch, int *a, int *b);</a></li>
<li><a href="#org19562f5">3.33. int mrgMRQMotorLead(ViSession vi, int name, int ch, float millimeter);</a></li>
<li><a href="#org70efd1e">3.34. int mrgMRQMotorLead_Query(ViSession vi, int name, int ch, float *millimeter);</a></li>
<li><a href="#org8561ee6">3.35. int mrgMRQMotorSize(ViSession vi, int name, int ch, int size);</a></li>
<li><a href="#orgffde476">3.36. int mrgMRQMotorSize_Query(ViSession vi, int name, int ch, int *size);</a></li>
<li><a href="#org1b9a812">3.37. int mrgMRQMotorVoltate(ViSession vi, int name, int ch, int volt);</a></li>
<li><a href="#org663436c">3.38. int mrgMRQMotorVoltage_Query(ViSession vi, int name, int ch, int *volt);</a></li>
<li><a href="#orgd5ac5ba">3.39. int mrgMRQMotorCurrent(ViSession vi, int name, int ch, float current);</a></li>
<li><a href="#orgf3666c0">3.40. int mrgMRQMotorCurrent_Query(ViSession vi, int name, int ch, float *current);</a></li>
<li><a href="#orge3e4210">3.41. int mrgMRQMotorBackLash(ViSession vi, int name, int ch, float lash);</a></li>
<li><a href="#org51f2091">3.42. int mrgMRQMotorBackLash_Query(ViSession vi, int name, int ch, float *lash);</a></li>
<li><a href="#orgd3882e6">3.43. int mrgMRQPVTConfig(ViSession vi, int name, int ch, int wavetable, int state);</a></li>
<li><a href="#org191e7ef">3.44. int mrgMRQPVTValue(ViSession vi, int name, int ch, int wavetable, float p, float v, float t);</a></li>
<li><a href="#org473f4e9">3.45. int mrgMRQPVTLoad(ViSession vi, int name, int ch, int wavetable, float * p, float * v, float *t, int step, int line);</a></li>
<li><a href="#org97a495c">3.46. int mrgMRQPVTRun(ViSession vi, int name, int ch, int wavetable, int timeout_ms);</a></li>
<li><a href="#org786c2d5">3.47. int mrgMRQPVTState(ViSession vi, int name, int ch, int wavetable, int state);</a></li>
<li><a href="#orgf2c57f0">3.48. int mrgMRQPVTState_Query(ViSession vi, int name, int ch, int wavetable, int *state1);</a></li>
<li><a href="#orgbf31ded">3.49. int mrgMRQPVTStateWait(ViSession vi, int name, int ch, int wavetable, int state, int timeout_ms);</a></li>
<li><a href="#orgbd57e3b">3.50. int mrgMRQPVTStateWaitEnd(ViSession vi, int name, int ch, int wavetable,int timeout_ms);</a></li>
<li><a href="#orgf9d37cd">3.51. int mrgMRQPVTTimeScale(ViSession vi, int name, int ch, int wavetable, int speedup, int speedcut);</a></li>
<li><a href="#org231ae39">3.52. int mrgMRQPVTTimeScale_Query(ViSession vi, int name, int ch, int wavetable, int* speedup, int* speedcut);</a></li>
<li><a href="#orgf0243ed">3.53. int mrgMRQPVTCycle(ViSession vi, int name, int ch, int wavetable, unsigned int cycle);</a></li>
<li><a href="#orgfb917ab">3.54. int mrgMRQPVTCycle_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *cycle);</a></li>
<li><a href="#orga72ac10">3.55. int mrgMRQPVTFifoBufferTime(ViSession vi, int name, int ch, int wavetable, unsigned int time);</a></li>
<li><a href="#org2596358">3.56. int mrgMRQPVTFifoBufferTime_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *time);</a></li>
<li><a href="#orgdd48a50">3.57. int mrgMRQPVTModeConfig_Query(ViSession vi, int name, int ch, int wavetable, int *exe, int *plan, int *motion);</a></li>
<li><a href="#org51f63b2">3.58. int mrgMRQPVTModeConfig(ViSession vi, int name, int ch, int wavetable, int exe, int plan, int motion);</a></li>
<li><a href="#org9fbd6dd">3.59. int mrgMRQPVTModeExe(ViSession vi, int name, int ch, int wavetable, int mode);</a></li>
<li><a href="#org1c5b6c6">3.60. int mrgMRQPVTModeExe_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</a></li>
<li><a href="#org7781b20">3.61. int mrgMRQPVTModePlan(ViSession vi, int name, int ch, int wavetable, int mode);</a></li>
<li><a href="#orgecc5108">3.62. int mrgMRQPVTModePlan_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</a></li>
<li><a href="#org728539a">3.63. int mrgMRQPVTModeMotion(ViSession vi, int name, int ch, int wavetable, int pattern);</a></li>
<li><a href="#org9fb907c">3.64. int mrgMRQPVTModeMotion_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);</a></li>
<li><a href="#org932ab2d">3.65. int mrgMRQPVTModifyDuty(ViSession vi, int name, int ch, int wavetable, int duty);</a></li>
<li><a href="#org2e4b6de">3.66. int mrgMRQPVTModifyDuty_Query(ViSession vi, int name, int ch, int wavetable, int *duty);</a></li>
<li><a href="#org9aef87c">3.67. int mrgMRQPVTEndState(ViSession vi, int name, int ch, int wavetable, int pattern);</a></li>
<li><a href="#org4b169b0">3.68. int mrgMRQPVTEndState_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);</a></li>
<li><a href="#org0186f0f">3.69. int mrgMRQPVTStopMode(ViSession vi, int name, int ch, int wavetable, int type);</a></li>
<li><a href="#org0e48917">3.70. int mrgMRQPVTStopMode_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</a></li>
<li><a href="#orgaff2581">3.71. int mrgMRQPVTStopTime(ViSession vi, int name, int ch, int wavetable, float time);</a></li>
<li><a href="#org99f7529">3.72. int mrgMRQPVTStopTime_Query(ViSession vi, int name, int ch, int wavetable, float *time);</a></li>
<li><a href="#org7281c3c">3.73. int mrgMRQPVTStopDistance(ViSession vi, int name, int ch, int wavetable, float distance);</a></li>
<li><a href="#org9cdb24d">3.74. int mrgMRQPVTStopDistance_Query(ViSession vi, int name, int ch, int  wavetable, float *distance);</a></li>
<li><a href="#org5ee50a2">3.75. int mrgMRQPVTWavetableAddress(ViSession vi, int name, int ch, int wavetable, unsigned int address);</a></li>
<li><a href="#org64bb7c4">3.76. int mrgMRQPVTWavetableAddress_Query(ViSession vi, int name,int ch, int  wavetable, unsigned int *address);</a></li>
<li><a href="#org7b68004">3.77. int mrgMRQPVTWavetableSize(ViSession vi, int name, int ch, int wavetable, unsigned int size);</a></li>
<li><a href="#org167283a">3.78. int mrgMRQPVTWavetableSize_Query(ViSession vi, int name,int ch, int  wavetable, unsigned int *size);</a></li>
<li><a href="#org3256ded">3.79. int mrgMRQLostStepLineConfig_Query(ViSession vi, int name, int ch, int wavetable, int *state,float *threshold, int *resp);</a></li>
<li><a href="#org8130ac4">3.80. int mrgMRQLostStepLineConfig(ViSession vi, int name, int ch, int wavetable, int state, float threshold, int resp);</a></li>
<li><a href="#orgc5935ff">3.81. int mrgMRQLostStepState(ViSession vi, int name, int ch, int wavetable, int state);</a></li>
<li><a href="#orgc5d5979">3.82. int mrgMRQLostStepState_Query(ViSession vi, int name, int ch, int wavetable, int *state);</a></li>
<li><a href="#orga150a37">3.83. int mrgMRQLostStepThreshold(ViSession vi, int name, int ch, int wavetable, float value);</a></li>
<li><a href="#org2bb6709">3.84. int mrgMRQLostStepThreshold_Query(ViSession vi, int name, int ch, int wavetable, float *value);</a></li>
<li><a href="#org0af6901">3.85. int mrgMRQLostStepResponse(ViSession vi, int name, int ch, int wavetable, int resp );</a></li>
<li><a href="#org4346071">3.86. int mrgMRQLostStepResponse_Query(ViSession vi, int name, int ch, int wavetable, int *resp);</a></li>
<li><a href="#orgd6fb679">3.87. int mrgMRQReportConfig_Query(ViSession vi, int name, int ch, int funs, int *state, float *period);</a></li>
<li><a href="#org8868c52">3.88. int mrgMRQReportConfig(ViSession vi, int name, int ch, int funs, int state, float period);</a></li>
<li><a href="#org4a7eb11">3.89. int mrgMRQReportState(ViSession vi, int name, int ch, int funs, int state);</a></li>
<li><a href="#org0c3ccdb">3.90. int mrgMRQReportState_Query(ViSession vi, int name, int ch, int funs, int *state);</a></li>
<li><a href="#orgccc0ea3">3.91. int mrgMRQReportPeriod(ViSession vi, int name, int ch, int funs, int period);</a></li>
<li><a href="#org690a7d5">3.92. int mrgMRQReportPeriod_Query(ViSession vi, int name, int ch, int funs, int *period);</a></li>
<li><a href="#org298f5ee">3.93. int mrgMRQReportData_Query(ViSession vi, int name, int ch, int index, unsigned int *data);</a></li>
<li><a href="#org48bf03f">3.94. int mrgMRQReportQueue_Query(ViSession vi, int name, int ch, int func, unsigned int *data);</a></li>
<li><a href="#orgf244434">3.95. int mrgMRQTriggerMode(ViSession vi, int name, int ch, int mode);</a></li>
<li><a href="#org2e52517">3.96. int mrgMRQTriggerMode_Query(ViSession vi, int name, int ch, int *mode);</a></li>
<li><a href="#orga929829">3.97. int mrgMRQTriggerLevelConfig_Query(ViSession vi, int name, int ch, int trig, int *state, int *type, float *period, int *response);</a></li>
<li><a href="#orgc1c3a31">3.98. int mrgMRQTriggerLevelConfig(ViSession vi, int name, int ch, int trig, int state, int type, float period, int response);</a></li>
<li><a href="#org319742f">3.99. int mrgMRQTriggerLevelState(ViSession vi, int name, int ch, int trig, int state);</a></li>
<li><a href="#orge9ce70e">3.100. int mrgMRQTriggerLevelState_Query(ViSession vi, int name, int ch, int trig, int *state);</a></li>
<li><a href="#org02d9535">3.101. int mrgMRQTriggerLevelType(ViSession vi, int name, int ch, int trig, int type);</a></li>
<li><a href="#orge67c6ab">3.102. int mrgMRQTriggerLevelType_Query(ViSession vi, int name, int ch, int trig, int *type);</a></li>
<li><a href="#orgc830859">3.103. int mrgMRQTriggerLevelResponse(ViSession vi, int name, int ch, int trig, int resp);</a></li>
<li><a href="#orgeb685c8">3.104. int mrgMRQTriggerLevelResponse_Query(ViSession vi, int name, int ch, int trig,int *resp);</a></li>
<li><a href="#org0a7a078">3.105. int mrgMRQTriggerLevelPeriod(ViSession vi, int name, int ch, int trig, float period);</a></li>
<li><a href="#orgb93bbcb">3.106. int mrgMRQTriggerLevelPeriod_Query(ViSession vi, int name, int ch, int trig, float *period);</a></li>
<li><a href="#org97343eb">3.107. int mrgMRQDriverConfig_Query(ViSession vi, int name, int ch, int *state, int *microstep, float*current);</a></li>
<li><a href="#orge836d81">3.108. int mrgMRQDriverConfig(ViSession vi, int name, int ch, int state, int microstep, float current);</a></li>
<li><a href="#orgcbe5c8c">3.109. int mrgMRQDriverType_Query(ViSession vi, int name, int ch, int *type);</a></li>
<li><a href="#org563c198">3.110. int mrgMRQDriverCurrent(ViSession vi, int name, int ch, float current);</a></li>
<li><a href="#org28057e1">3.111. int mrgMRQDriverCurrent_Query(ViSession vi, int name, int ch, float *current);</a></li>
<li><a href="#orga70d121">3.112. int mrgMRQDriverIdleCurrent(ViSession vi, int name, int ch, float current);</a></li>
<li><a href="#orged3c14b">3.113. int mrgMRQDriverIdleCurrent_Query(ViSession vi, int name, int ch, float *current);</a></li>
<li><a href="#orgdd03742">3.114. int mrgMRQDriverMicroStep(ViSession vi, int name, int ch, int microstep);</a></li>
<li><a href="#org4728456">3.115. int mrgMRQDriverMicroStep_Query(ViSession vi, int name, int ch, int *microstep);</a></li>
<li><a href="#org59d907b">3.116. int mrgMRQDriverState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org21c00ce">3.117. int mrgMRQDriverState_Query(ViSession vi, int name, int ch, int *state);</a></li>
<li><a href="#org850048c">3.118. int mrgMRQDriverRegisterValue(ViSession vi, int name, int ch, int regIndex, unsigned int value);</a></li>
<li><a href="#org1ca917d">3.119. int mrgMRQDriverRegisterValue_Query(ViSession vi, int name, int ch, int regIndex, unsigned int *value);</a></li>
<li><a href="#org9ab7adc">3.120. int mrgMRQDriverTuningState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org465d65d">3.121. int mrgMRQDriverTuningState_Query(ViSession vi, int name, int ch, int *state);</a></li>
<li><a href="#org655f72c">3.122. int mrgMRQDriverTuningMinCurrent(ViSession vi, int name, int ch, int ratio);</a></li>
<li><a href="#org2c4a3ad">3.123. int mrgMRQDriverTuningMinCurrent_Query(ViSession vi, int name, int ch, int *ratio);</a></li>
<li><a href="#orgc4ba7a0">3.124. int mrgMRQDriverTuningCurrentRegulate(ViSession vi, int name, int ch, int speedUp, int speedDown);</a></li>
<li><a href="#orge762e32">3.125. int mrgMRQDriverTuningCurrentRegulate_Query(ViSession vi, int name, int ch, int *speedUp, int *speedDown);</a></li>
<li><a href="#org887ae72">3.126. int mrgMRQEncoderConfig_Query(ViSession vi, int name, int ch,int *state, int *type, int *lineNum, int *chanNum);</a></li>
<li><a href="#org4a440ed">3.127. int mrgMRQEncoderConfig(ViSession vi, int name, int ch,int state, int type, int linenum, int channelnum);</a></li>
<li><a href="#org12418a8">3.128. int mrgMRQEncoderLineNum(ViSession vi, int name, int ch, int num);</a></li>
<li><a href="#org9e23660">3.129. int mrgMRQEncoderLineNum_Query(ViSession vi, int name, int ch, int *num);</a></li>
<li><a href="#org1eadaf0">3.130. int mrgMRQEncoderChannelNum(ViSession vi, int name, int ch, int channelnum);</a></li>
<li><a href="#orge683821">3.131. int mrgMRQEncoderChannelNum_Query(ViSession vi, int name, int ch, int *channelnum);</a></li>
<li><a href="#org1316721">3.132. int mrgMRQEncoderType(ViSession vi, int name, int ch, int type);</a></li>
<li><a href="#orge1fdcaa">3.133. int mrgMRQEncoderType_Query(ViSession vi, int name, int ch, int *type);</a></li>
<li><a href="#org3e3f2de">3.134. int mrgMRQEncoderMultiple(ViSession vi, int name, int ch, int multiple);</a></li>
<li><a href="#orgfed22c0">3.135. int mrgMRQEncoderMultiple_Query(ViSession vi, int name, int ch, int *multiple);</a></li>
<li><a href="#org0c28a28">3.136. int mrgMRQEncoderState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#orgca0b242">3.137. int mrgMRQEncoderState_Query(ViSession vi, int name, int ch, int*state);</a></li>
<li><a href="#org9124d62">3.138. int mrgMRQEncoderFeedback(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#orgdbdc1a0">3.139. int mrgMRQEncoderFeedback_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#org5969133">3.140. int mrgMRQEncoderDirection(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#org5df7419">3.141. int mrgMRQEncoderDirection_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#orgd83e024">3.142. int mrgMRQAbsEncoderAlarmState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org56487fd">3.143. int mrgMRQAbsEncoderAlarmState_Query(ViSession vi, int name, int ch, int *state);</a></li>
<li><a href="#org2501a75">3.144. int mrgMRQAbsEncoderAlarmUpLimit(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#org4095e2e">3.145. int mrgMRQAbsEncoderAlarmUpLimit_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#org1ffeedd">3.146. int mrgMRQAbsEncoderAlarmDownLimit(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#org86376fb">3.147. int mrgMRQAbsEncoderAlarmDownLimit_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#orgfdd973a">3.148. int mrgMRQAbsEncoderAlarmResponse(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#orgeb8a5a6">3.149. int mrgMRQAbsEncoderAlarmResponse_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#orgd91e8d4">3.150. int mrgMRQAbsEncoderZeroValue(ViSession vi, int name, int ch, int value);</a></li>
<li><a href="#org6315904">3.151. int mrgMRQAbsEncoderZeroValue_Query(ViSession vi, int name, int ch, int *value);</a></li>
<li><a href="#org710f62a">3.152. int mrgMRQUartConfig(ViSession vi, int num, int name, int baud,char parity, int wordlen, int stopbit);</a></li>
<li><a href="#org76023e1">3.153. int mrgMRQUartConfig_Query(ViSession vi, int num, int name, int *baud,char *parity,int *wordlen,int *stopbit);</a></li>
<li><a href="#org3546e64">3.154. int mrgMRQUartFlowctrl(ViSession vi, int num, int name, int mode);</a></li>
<li><a href="#orged2b15a">3.155. int mrgMRQUartFlowctrl_Query(ViSession vi, int num, int name, int *mode);</a></li>
<li><a href="#org879b974">3.156. int mrgMRQUartSensorState(ViSession vi, int num, int num1, int name, int state);</a></li>
<li><a href="#org3aa1270">3.157. int mrgMRQUartSensorState_Query(ViSession vi, int num, int num1, int name, int *state);</a></li>
<li><a href="#org1381f40">3.158. int mrgMRQUartSensorConfAll(ViSession vi, int num, int num1, int name, int sof, int framelen, int num2, int period);</a></li>
<li><a href="#org24fd314">3.159. int mrgMRQUartSensorConfAll_Query(ViSession vi, int num,int num1, int name, int <b>sof, int</b> framelen, int* framenum, int* period);</a></li>
<li><a href="#org27126de">3.160. int mrgMRQUartSensorConfSof(ViSession vi, int num, int num1, int name, int sof);</a></li>
<li><a href="#orgbe78d78">3.161. int mrgMRQUartSensorConfSof_Query(ViSession vi, int num, int num1, int name, int *sof);</a></li>
<li><a href="#org090d7c3">3.162. int mrgMRQUartSensorConfFrameLen(ViSession vi, int num, int num1, int name, int len);</a></li>
<li><a href="#org4bf82f0">3.163. int mrgMRQUartSensorConfFrameLen_Query(ViSession vi, int num, int num1, int name, int *len);</a></li>
<li><a href="#orgf093cd4">3.164. int mrgMRQUartSensorConfRecvNum(ViSession vi, int num, int num1, int name, int num2);</a></li>
<li><a href="#org6caf36a">3.165. int mrgMRQUartSensorConfRecvNum_Query(ViSession vi, int num, int num1, int name, int *num2);</a></li>
<li><a href="#org1992635">3.166. int mrgMRQUartSensorConfPeriod(ViSession vi, int num, int num1, int name, int period);</a></li>
<li><a href="#orgcd80afd">3.167. int mrgMRQUartSensorConfPeriod_Query(ViSession vi, int num, int num1, int name, int *period);</a></li>
<li><a href="#orgf88f370">3.168. int mrgMRQUartSensorData_Query(ViSession vi, int num, int num1, int name, char *buf);</a></li>
<li><a href="#orgc8a6fc2">3.169. int mrgMRQDistanceAlarmState_Query(ViSession vi, int name, int ch, int *state);</a></li>
<li><a href="#orgf938688">3.170. int mrgMRQDistanceAlarmState(ViSession vi, int name, int ch, int state);</a></li>
<li><a href="#org3dd0e2b">3.171. int mrgMRQDistanceAlarm(ViSession vi, int name, int num, int ch, float distance);</a></li>
<li><a href="#org92e76cf">3.172. int mrgMRQDistanceAlarm_Query(ViSession vi, int num, int name, int ch, float *distance);</a></li>
<li><a href="#org2c38c34">3.173. int mrgMRQNewDriverType_Query(ViSession vi, int name, int ch, int *type);</a></li>
<li><a href="#orgd24bbb2">3.174. int mrgMRQNewDriverCurrent(ViSession vi, int name, float current);</a></li>
<li><a href="#orgba3eb69">3.175. int mrgMRQNewDriverCurrent_Query(ViSession vi, int name, float *current);</a></li>
<li><a href="#org77d2433">3.176. int mrgMRQNewDriverMicrosteps(ViSession vi, int name, int microstep);</a></li>
<li><a href="#org2d91f52">3.177. int mrgMRQNewDriverMicrosteps_Query(ViSession vi, int name, int *microstep);</a></li>
<li><a href="#org38eef92">3.178. int mrgMRQNewDriverState_Query(ViSession vi, int name, int ch, int*state);</a></li>
<li><a href="#orge294b64">3.179. int mrgMRQNewDriverState(ViSession vi, int name, int ch, int state);</a></li>
</ul>
</li>
<li><a href="#orgcaea91e">4. system.h</a>
<ul>
<li><a href="#orge0d7ec6">4.1. int mrgSysGetProjectSoftVersion(ViSession vi, char *version);</a></li>
<li><a href="#orgb96c2b3">4.2. int mrgSysGetSoftVersion(ViSession vi, char * version);</a></li>
<li><a href="#org8480300">4.3. int mrgSysGetBackBoardSoftVersion(ViSession vi,char * version);</a></li>
<li><a href="#org88d6eb3">4.4. int mrgSysGetBackBoardHardVersion(ViSession vi, char * version);</a></li>
<li><a href="#orge775669">4.5. int mrgSysStartCan(ViSession vi);</a></li>
<li><a href="#org4f6cccc">4.6. int mrgSysResetCan(ViSession vi);</a></li>
<li><a href="#orgcb89dad">4.7. int mrgSysConfCan(ViSession vi, int baud);</a></li>
<li><a href="#orgd13648c">4.8. int mrgSysConfCan_Query(ViSession vi, int* baud);</a></li>
<li><a href="#org3867b1d">4.9. int mrgSysModeSwitch(ViSession vi, int mode);</a></li>
<li><a href="#orge63ed53">4.10. int mrgGetSysMode(ViSession vi);</a></li>
<li><a href="#orgc9b96e2">4.11. int mrgSysInstructionMode(ViSession vi, int mode);</a></li>
<li><a href="#orged82aa3">4.12. int mrgSysInstructionMode_Query(ViSession vi, int* mode);</a></li>
<li><a href="#org0f97228">4.13. int mrgSysSetNetworkIPMode(ViSession vi,int mode);</a></li>
<li><a href="#orgec91a92">4.14. int mrgSysGetNetworkIPMode(ViSession vi, int* mode);</a></li>
<li><a href="#org17acc48">4.15. int mrgSysWifiScan(ViSession vi, char *result, int len);</a></li>
<li><a href="#orgf461789">4.16. int mrgSysWifiConfig(ViSession vi, char *name, char *passwd);</a></li>
<li><a href="#org41f327b">4.17. int mrgSysWifiUpDown(ViSession vi, int state);</a></li>
<li><a href="#orgaf9e83a">4.18. int mrgSysWifiCheckState(ViSession vi, int timeout_ms);</a></li>
<li><a href="#org6d1ee47">4.19. int mrgSysGetWifiConnected(ViSession vi, char *name);</a></li>
<li><a href="#org839730c">4.20. int mrgSysSetHeartPeriod(ViSession vi, int value);</a></li>
<li><a href="#org4272bb4">4.21. int mrgSysGetHeartPeriod(ViSession vi, int *value);</a></li>
<li><a href="#orgf0e3535">4.22. int mrgSysSetPowerOn(ViSession vi, int value);</a></li>
<li><a href="#orga763620">4.23. int mrgSysGetPowerOn(ViSession vi, int *value);</a></li>
<li><a href="#org993f09f">4.24. int mrgSysSetInterface(ViSession vi, int face);</a></li>
<li><a href="#org8fc553e">4.25. int mrgSysGetInterface(ViSession vi, int *face);</a></li>
<li><a href="#org68c0ef3">4.26. int mrgSysSetEmergencyStop(ViSession vi, int state);</a></li>
<li><a href="#orgfe0dafd">4.27. int mrgSysGetEmergencyStopState(ViSession vi, int *state);</a></li>
<li><a href="#org0cfd104">4.28. int mrgSysUpdateFileSearch(ViSession vi, char *fileList);</a></li>
<li><a href="#org6d1eb41">4.29. int mrgSysUpdateFileStart(ViSession vi, char *filename);</a></li>
<li><a href="#org55a57b8">4.30. int mrgSysUpdateFirmwareStatusQuery(ViSession vi);</a></li>
<li><a href="#orga3b24b7">4.31. int mrgScriptSearch(ViSession vi, int isUdisk, char *fileList);</a></li>
<li><a href="#org6c00c88">4.32. int mrgScriptConfig(ViSession vi, char *filename, int isBoot);</a></li>
<li><a href="#orga4d240c">4.33. int mrgScriptConfigQuery(ViSession vi, char *filename);</a></li>
<li><a href="#orgeb5436a">4.34. int mrgScriptRun(ViSession vi);</a></li>
<li><a href="#orgb1c5145">4.35. int mrgScriptStop(ViSession vi);</a></li>
<li><a href="#org19f7763">4.36. int mrgScriptGetCurrentStates(ViSession vi);</a></li>
<li><a href="#orgb1ea98f">4.37. int mrgSystemRunCmd(ViSession vi, char *cmd, int isBackground);</a></li>
</ul>
</li>
<li><a href="#org0d82612">5. errorcode.h</a>
<ul>
<li><a href="#orga8e7b0a">5.1. int mrgErrorCodeConfigUpload(ViSession vi, int code, int *type, int *response, int *diagnose, int *enable);</a></li>
<li><a href="#org9680d7e">5.2. int mrgErrorCodeConfigDownload(ViSession vi, int code, int type, int response, int diagnose, int enable);</a></li>
<li><a href="#orgfea9fb4">5.3. int mrgErrorLogUpload(ViSession vi, int format, char* errorLog, int len);</a></li>
<li><a href="#orgb9408bf">5.4. int mrgErrorLogClear(ViSession vi);</a></li>
</ul>
</li>
<li><a href="#org364655a">6. storage.h</a>
<ul>
<li><a href="#org4a45b05">6.1. int mrgStorageMotionFileQuery(ViSession vi, int type, char *fileList, int len);</a></li>
<li><a href="#org1984c0d">6.2. int mrgStorageMotionFileDelete(ViSession vi, char *fileName);</a></li>
<li><a href="#orgbe409da">6.3. int mrgStorageMotionFileContextRead(ViSession vi, char *filename, char *context, int wantlen);</a></li>
<li><a href="#org1569bec">6.4. int mrgStorageMotionFileSaveContext(ViSession vi, char *context, int len, char *saveFileName);</a></li>
<li><a href="#org2fea9a8">6.5. int mrgStorageWriteFile(ViSession vi, int isUdisk, char *path, char *saveFileName, unsigned char *data, int dataLen);</a></li>
<li><a href="#org6847944">6.6. int mrgStorageReadFile(ViSession vi, int isUdisk, char <b>path, char</b> filename, unsigned char* context);</a></li>
</ul>
</li>
<li><a href="#orge6c8d4c">7. project.h</a>
<ul>
<li><a href="#org21b0940">7.1. int mrgSetProjectMode(ViSession vi, int state);</a></li>
<li><a href="#org09b02f6">7.2. int mrgProjectGetXinState(ViSession vi, int index, unsigned int *state)</a></li>
<li><a href="#orgf4c2bc7">7.3. int mrgProjectSetYout(ViSession vi, int index, int state);</a></li>
<li><a href="#orga206c72">7.4. int mrgProjectSetSerialNum(ViSession vi, char *serial);</a></li>
<li><a href="#orged304eb">7.5. int mrgProjectGetSerialNum(ViSession vi, char *serial);</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="outline-container-orgf4e7c03" class="outline-2">
<h2 id="orgf4e7c03"><span class="section-number-2">1</span> device.h</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org33339b4" class="outline-3">
<h3 id="org33339b4"><span class="section-number-3">1.1</span> int mrgFindGateWay(int  bus, char *output, int len, int method);</h3>
<div class="outline-text-3" id="text-1-1">
<p>
查找网关。
</p>

<p>
bus :总线类型. ＝0，网络接口；＝1，USBTMC接口
</p>

<p>
output：查找到的设备描述符，多个设备之间以逗号分隔
</p>

<p>
len : output的最大容量（字节个数）
</p>

<p>
method:当网关设备使用网络连接时，在查找网关设备时有两种查找方式：
</p>

<p>
method = 0,使用VISA查找方式；
</p>

<p>
method = 1,使用UDP方式查找
</p>

<p>
返回值：查找到的设备个数
</p>
</div>
</div>
