doc/CAPI.html



<div id="outline-container-orga53f435" class="outline-3">
<h3 id="orga53f435"><span class="section-number-3">1.2</span> int mrgOpenGateWay(char *desc, int timeout_ms);</h3>
<div class="outline-text-3" id="text-1-2">
<p>
打开网关设备。
</p>

<p>
desc :findGateWay()返回的设备描述符
</p>

<p>
timeout：设备通讯时的最大超时时间
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge8fab9a" class="outline-3">
<h3 id="orge8fab9a"><span class="section-number-3">1.3</span> int mrgCloseGateWay(ViSession  vi);</h3>
<div class="outline-text-3" id="text-1-3">
<p>
关闭网关设备。
</p>

<p>
desc :findGateWay()返回的设备描述符
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge005fe8" class="outline-3">
<h3 id="orge005fe8"><span class="section-number-3">1.4</span> int mrgGateWaySendCmd(ViSession  vi, char *cmd, int len);</h3>
<div class="outline-text-3" id="text-1-4">
<p>
向网关直接发送设置命令。
</p>

<p>
vi :设备句柄
</p>

<p>
cmd：要发送的设置命令
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgccd5efb" class="outline-3">
<h3 id="orgccd5efb"><span class="section-number-3">1.5</span> int mrgGateWayRead(ViSession  vi, char * output, int wantlen);</h3>
<div class="outline-text-3" id="text-1-5">
<p>
向网关发送读取命令。
</p>

<p>
vi :设备句柄
</p>

<p>
output:查询命令的返回
</p>

<p>
wantlen:期望查询命令返回的长度，即output的长度
</p>

<p>
返回值：实际返回的数据长度
</p>
</div>
</div>



<div id="outline-container-orgbbe6415" class="outline-3">
<h3 id="orgbbe6415"><span class="section-number-3">1.6</span> int mrgGateWayQuery(ViSession  vi, char *cmd, char *output, int wantlen);</h3>
<div class="outline-text-3" id="text-1-6">
<p>
向网关直接发送查询命令。
</p>

<p>
vi :设备句柄
</p>

<p>
cmd：要发送的设置命令
</p>

<p>
len:命令长度
</p>

<p>
output:查询命令的返回
</p>

<p>
wantlen:期望查询命令返回的长度，即output的长度
</p>

<p>
返回值：实际返回的数据长度
</p>
</div>
</div>



<div id="outline-container-orgdf94bca" class="outline-3">
<h3 id="orgdf94bca"><span class="section-number-3">1.7</span> int mrgGateWayIDNQuery(ViSession  vi, char *idn);</h3>
<div class="outline-text-3" id="text-1-7">
<p>
查询网关设备的*IDN。
</p>

<p>
idn :返回的设备描述符
</p>

<p>
len：idn缓存长度
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgd3849a7" class="outline-3">
<h3 id="orgd3849a7"><span class="section-number-3">1.8</span> int mrgFindDevice(ViSession vi, int timeout_ms);</h3>
<div class="outline-text-3" id="text-1-8">
<p>
查找连接在网关上的设备。
</p>

<p>
vi :visa设备句柄
</p>

<p>
timeout为最长查找时间，单位：ms.
</p>

<p>
返回值：查找到的设备个数
</p>
</div>
</div>



<div id="outline-container-org7046559" class="outline-3">
<h3 id="org7046559"><span class="section-number-3">1.9</span> int mrgGetDeviceName(ViSession vi, int *names);</h3>
<div class="outline-text-3" id="text-1-9">
<p>
获取所有与网关相连的设备名称
</p>

<p>
vi :visa设备句柄
</p>

<p>
names：返回名称的存放处
</p>

<p>
names_len：存储区的长度
</p>

<p>
返回值：设备名称个数
</p>
</div>
</div>



<div id="outline-container-orgbfad3f9" class="outline-3">
<h3 id="orgbfad3f9"><span class="section-number-3">1.10</span> int mrgGetDeviceType(ViSession vi, int name, char *type);</h3>
<div class="outline-text-3" id="text-1-10">
<p>
获取指定设备的类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
type：返回设备类型的存储区
</p>

<p>
type可能的取值： “MRQM2304”，“MRQM2305”，“MRQM2310”，“MRQC23D”，“MRQC23S”，
</p>

<p>
type_len：存储区的长度，长度最少8个字节
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgce0f35a" class="outline-3">
<h3 id="orgce0f35a"><span class="section-number-3">1.11</span> int mrgGetDeviceChannelCount(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-1-11">
<p>
查询指定设备的通道个数,name为仪器名
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人的名字
</p>

<p>
返回值：大于零，表示通道个数，小于或等于零表示失败
</p>
</div>
</div>



<div id="outline-container-orge60b894" class="outline-3">
<h3 id="orge60b894"><span class="section-number-3">1.12</span> int mrgGetDeviceInfo(ViSession vi, int name, char *info);</h3>
<div class="outline-text-3" id="text-1-12">
<p>
获取指定设备的信息，包括（序列号：硬件版本号：软件版本号：boot版本号：逻辑版本号）
</p>

<p>
vi :visa设备句柄
</p>

<p>
info：返回信息的存储区
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org98d661c" class="outline-3">
<h3 id="org98d661c"><span class="section-number-3">1.13</span> int mrgGetDeviceSoftVersion(ViSession vi, int name, char *version);</h3>
<div class="outline-text-3" id="text-1-13">
<p>
获取指定设备的软件版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
version：返回设备版本号的存储区
</p>

<p>
len：存储区的长度
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org41191ae" class="outline-3">
<h3 id="org41191ae"><span class="section-number-3">1.14</span> int mrgGetDeviceFirmWareHard(ViSession vi, int name, char *buf);</h3>
<div class="outline-text-3" id="text-1-14">
<p>
查询设备硬件版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人的名字
</p>

<p>
buf:设备硬件版本号,长度最少12个字节
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge21b58c" class="outline-3">
<h3 id="orge21b58c"><span class="section-number-3">1.15</span> int mrgGetDeviceFirmWareBoot(ViSession vi, int name, char *buf);</h3>
<div class="outline-text-3" id="text-1-15">
<p>
查询设备BOOT版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人的名字
</p>

<p>
buf:设备BOOT版本号
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org7679c86" class="outline-3">
<h3 id="org7679c86"><span class="section-number-3">1.16</span> int mrgGetDeviceFirmWareFpga(ViSession vi, int name, char *buf);</h3>
<div class="outline-text-3" id="text-1-16">
<p>
查询设备逻辑版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人的名字
</p>

<p>
buf:设备逻辑版本号
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4d29f9d" class="outline-3">
<h3 id="org4d29f9d"><span class="section-number-3">1.17</span> int mrgWriteDeviceSerial(ViSession  vi, int name, char *serial);</h3>
<div class="outline-text-3" id="text-1-17">
<p>
写入设备的序列号
</p>

<p>
idn :返回的设备描述符
</p>

<p>
len：idn缓存长度
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数为工程接口函数，不对外开放
</p>
</div>
</div>



<div id="outline-container-orga505d5a" class="outline-3">
<h3 id="orga505d5a"><span class="section-number-3">1.18</span> int mrgGetDeviceSerialNumber(ViSession vi, int name, char *serial);</h3>
<div class="outline-text-3" id="text-1-18">
<p>
获取指定设备的序列号
</p>

<p>
vi :visa设备句柄
</p>

<p>
serial：返回设备序列号的存储区
</p>

<p>
len：存储区的长度，长度最少18个字节
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org30e9abb" class="outline-3">
<h3 id="org30e9abb"><span class="section-number-3">1.19</span> int mrgIdentify(ViSession vi, int state);</h3>
<div class="outline-text-3" id="text-1-19">
<p>
识别网关设备（ON时，LED1常亮；OFF时LED闪烁）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：机器人
</p>

<p>
state：识别状态
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga5e22cd" class="outline-3">
<h3 id="orga5e22cd"><span class="section-number-3">1.20</span> int mrgModeSwitch(ViSession vi, int mode);</h3>
<div class="outline-text-3" id="text-1-20">
<p>
切换 MRH - T 的模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode : MRH - T 的模式，取值范围： [0,1]
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org6373109" class="outline-3">
<h3 id="org6373109"><span class="section-number-3">1.21</span> int mrgGetXinState(ViSession vi, int *state);</h3>
<div class="outline-text-3" id="text-1-21">
<p>
读取MRHT的IO状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
state : xin的状态,低四位
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgbbc92c9" class="outline-3">
<h3 id="orgbbc92c9"><span class="section-number-3">1.22</span> int mrgSetYoutState(ViSession vi, int yout, int state);</h3>
<div class="outline-text-3" id="text-1-22">
<p>
设置MRHT的IO输出状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
yout : 0表示Y1,1表示Y2
</p>

<p>
state : YOUT的状态,0表示低电平,1表示高电平
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
</div>





<div id="outline-container-org473d162" class="outline-2">
<h2 id="org473d162"><span class="section-number-2">2</span> megarobot.h</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org67888bf" class="outline-3">
<h3 id="org67888bf"><span class="section-number-3">2.1</span> MRX_TYPE(enum)</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_T4</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_AS</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_H2</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_DELTA</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_RAW</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_OTHER</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MRX_TYPE_UNKOWN</td>
<td class="org-right">6</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>
</div>
</div>



<div id="outline-container-org4e75276" class="outline-3">
<h3 id="org4e75276"><span class="section-number-3">2.2</span> int mrgBuildRobot(ViSession vi, char *robotType, char *chlist, int *robotname);</h3>
<div class="outline-text-3" id="text-2-2">
<p>
构建一个机器人
</p>

<p>
vi :visa设备句柄
</p>

<p>
robotType：要构建的机器人类型（MRX-T4,MRX-H2,MRX-DELTA）
</p>

<p>
chlist：设备列表 “0@512,1@512,”
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org5aab961" class="outline-3">
<h3 id="org5aab961"><span class="section-number-3">2.3</span> int mrgBuildRobotNamed(ViSession vi, char *robotType, char *devList, int robotid, int *robotname);</h3>
<div class="outline-text-3" id="text-2-3">
<p>
构建一个机器人,机器人的名子由用户指定
</p>

<p>
vi :visa设备句柄
</p>

<p>
robotType：要构建的机器人类型（MRX-T4,MRX-H2,MRX-DELTA）
</p>

<p>
devList：设备列表 “0@512,1@512,”
</p>

<p>
robotid: 用户设定的机器人名子
</p>

<p>
robotname :返回的机器人名子
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgcaaf511" class="outline-3">
<h3 id="orgcaaf511"><span class="section-number-3">2.4</span> int mrgDeleteRobot(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-4">
<p>
删除当前机器人
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
返回值：0表示执行成功，－1表示执行失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>
