doc/CAPI.org
** int mrgSetRobotLinks(ViSession vi, int name, float *links, int link_count);

   设置当前机器人的构形的连秆长度  单位:mm

   vi :visa设备句柄

   name:机器人名称

   返回值：小于零表示出错

   说明：对T4来说: links[0] 基座高度;links[1] 大臂长度 ;links[2] 小臂长度

   对H2来说: links[0] 宽;links[1] 高 ;links[2] 滑块宽度;links[3] 滑块高度,links[4] 模具类型;links[5] 齿数;



** int mrgGetRobotLinks(ViSession vi, int name, float *links, int *link_count);

   获取当前机器人的构形的连秆长度  单位:mm

   vi :visa设备句柄

   name:机器人名称

   link_count: 获取到的连秆长度

   返回值：0成功,否则失败

   说明：



** int mrgGetRobotType(ViSession vi, int name);

   查询当前机器人的构形

   vi :visa设备句柄

   name:机器人名称

   返回值：小于零表示出错。 0：MRX-T4;1:MRX-AS;2:MRX-H2,3:MRX-DELTA;4:MRX-RAW

   说明：此函数目前只对H2有效



** int mrgExportRobotConfig(ViSession vi);

   保存当前系统中所有机器人构形

   vi :visa设备句柄

   返回值：0表示执行成功，－1表示失败

   说明：



** int mrgExportRobotConfig_default(ViSession vi);

   保存当前系统中所有机器人构形为默认配置文件

   vi :visa设备句柄

   返回值：0表示执行成功，－1表示失败

   说明：工程命令，不对外开放



** int mrgRestoreRobotConfig(ViSession vi);

   恢复上次保存的配置

   vi :visa设备句柄

   返回值：0表示执行成功，－1表示失败

   说明：



** int mrgGetRobotConfigState(ViSession vi);

   查询导入或导出配置文件的状态

   vi :visa设备句柄

   返回值：0表示执行完成；1表示正在执行；－1表示执行过程中出错

   说明：



** int mrgSetRobotMachineSerialNum(ViSession vi, int name, char *sn);

   设置当前机器人所使用的机械结构的序列号

   vi :visa设备句柄

   name:机器人名称

   serial:机械结构序列号

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotMachineSerialNum(ViSession vi, int name, char*serial);

   查询当前机器人所使用的机械结构的序列号

   vi :visa设备句柄

   name:机器人名称

   serial:机械结构序列号

   返回值：0表示执行正确，否则表示执行失败

   说明：此函数目前只对H2有效



** int mrgSetRobotSubType(ViSession vi, int name, int subtype);

   设置当前机器人构形下的子类型

   vi :visa设备句柄

   name:机器人名称

   subtype:子类型。 对于H2来说，0表示小H2，1表示中H2（802x494）；2表示大H2（891x769）

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotSubType(ViSession vi, int name);

   查询当前机器人构形下的子类型

   vi :visa设备句柄

   name:机器人名称

   返回值：子类型。 对于H2来说，0表示小H2，1表示中H2（802x494）；2表示大H2（891x769）

   说明：此函数目前只对H2有效



** int mrgSetRobotCoordinateSystem(ViSession vi, int name, int coord);

   设置当前机器人的坐标系

   vi :visa设备句柄

   name:机器人名称

   coord:坐标系索引（详情参考对应的命令系统）

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotCoordinateSystem(ViSession vi, int name);

   查询当前机器人的坐标系

   vi :visa设备句柄

   name:机器人名称

   返回值：坐标系索引，（详情参考对应的命令系统）

   说明：此函数目前只对H2有效



** int mrgGetRobotCount(ViSession vi);

   查询CAN网络中机器人的个数

   vi :visa设备句柄

   返回值：返回机器人个数



** int mrgGetRobotName(ViSession vi, int *robotnames);

   查询CAN网络中所有机器人的名子

   vi :visa设备句柄

   robotnames：输出参数，机器人名称集

   返回值：返回机器人个数



** int mrgGetRobotDevice(ViSession vi, int robotname, int *device);

   查询当前机器人的所使用的设备

   robotname: 机器人名称

   vi :visa设备句柄

   device：设备名称列表

   返回值：返回所使用的设备个数



** int mrgSetRobotProjectZero(ViSession vi, int name, float x, float y, float z);

   设置当前机器人的项目零点

   vi :visa设备句柄

   name:机器人名称

   x,y，z:项目零点值（x,y,z）

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotProjectZero(ViSession vi, int name, float *x, float *y, float *z);

   查询当前机器人的项目零点

   vi :visa设备句柄

   name:机器人名称

   x,y,z: 输出参数，项目零点值

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgSetRobotAxisZero(ViSession vi, int name, float x, float y, float z);

   设置当前机器人的校准零点

   vi :visa设备句柄

   name:机器人名称

   x,y，z:校准零点值（x,y,z）

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotAxisZero(ViSession vi, int name, float *x, float *y, float *z);

   查询当前机器人的校准零点

   vi :visa设备句柄

   name:机器人名称

   x,y,z: 输出参数，校准零点值

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgSetRobotSoftWareLimit(ViSession vi, int name, int type, float x, float y, float z);

   设置当前机器人的软件限位

   vi :visa设备句柄

   name:机器人名称

   type: 正向限位还是负向限位。 0：表示正向限位；1表示负向限位

   x,y，z:限位值（x,y,z）

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgGetRobotSoftWareLimit(ViSession vi, int name, int type, float *x, float *y, float *z);

   查询当前机器人的校准零点

   vi :visa设备句柄

   name:机器人名称

   type: 正向限位还是负向限位。 0：表示正向限位；1表示负向限位

   x,y,z: 输出参数，校准零点值

   返回值：0表示执行成功，－1表示失败

   说明：此函数目前只对H2有效



** int mrgSetRobotWavetable(ViSession vi, int name, int wavetable);

   设置指定机器人的波表

   vi :visa设备句柄

   name: 机器人名称

   wavetable:波表索引值，取值范围0~9

   返回值：0表示设置成功，否则表示设置失败



** int mrgRobotWavetableQuery(ViSession vi, int name);

   查询指定机器人的波表

   vi :visa设备句柄

   name: 机器人名称

   wavetable:波表索引值，取值范围0~9

   返回值：大于0表示波表索引，小于零表示查询失败



** int mrgRobotRun(ViSession vi, int name, int wavetable);

   启动机器人的运行

   vi :visa设备句柄

   name: 机器人名称

   wavetable:波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   返回值：0表示启动成功，否则表示启动失败



** int mrgRobotStop(ViSession vi, int name, int wavetable);

   停止机器人的运行

   vi :visa设备句柄

   name: 机器人名称

   wavetable:波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   返回值：0表示停止成功，否则表示停止失败



** int mrgGetRobotStates(ViSession vi, int name, int wavetable, char *state);

   查询机器人运行状态

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   返回值：0表示等待成功，－1：表示出错



** int mrgRobotWaitReady(ViSession vi, int name, int wavetable, int timeout_ms);

   等待机器人的特定波表的ready状态（等待模块设备解算完成）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   timeout_ms：等待超时时间

   返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时



