doc/CAPI.html



<div id="outline-container-org3fc2610" class="outline-3">
<h3 id="org3fc2610"><span class="section-number-3">2.5</span> int mrgSetRobotLinks(ViSession vi, int name, float *links, int link_count);</h3>
<div class="outline-text-3" id="text-2-5">
<p>
设置当前机器人的构形的连秆长度  单位:mm
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
返回值：小于零表示出错
</p>

<p>
说明：对T4来说: links[0] 基座高度;links[1] 大臂长度 ;links[2] 小臂长度
</p>

<p>
对H2来说: links[0] 宽;links[1] 高 ;links[2] 滑块宽度;links[3] 滑块高度,links[4] 模具类型;links[5] 齿数;
</p>
</div>
</div>



<div id="outline-container-org80e4865" class="outline-3">
<h3 id="org80e4865"><span class="section-number-3">2.6</span> int mrgGetRobotLinks(ViSession vi, int name, float *links, int *link_count);</h3>
<div class="outline-text-3" id="text-2-6">
<p>
获取当前机器人的构形的连秆长度  单位:mm
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
link_count: 获取到的连秆长度
</p>

<p>
返回值：0成功,否则失败
</p>

<p>
说明：
</p>
</div>
</div>



<div id="outline-container-org3c9cf9e" class="outline-3">
<h3 id="org3c9cf9e"><span class="section-number-3">2.7</span> int mrgGetRobotType(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-7">
<p>
查询当前机器人的构形
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
返回值：小于零表示出错。 0：MRX-T4;1:MRX-AS;2:MRX-H2,3:MRX-DELTA;4:MRX-RAW
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org4f6afab" class="outline-3">
<h3 id="org4f6afab"><span class="section-number-3">2.8</span> int mrgExportRobotConfig(ViSession vi);</h3>
<div class="outline-text-3" id="text-2-8">
<p>
保存当前系统中所有机器人构形
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：
</p>
</div>
</div>



<div id="outline-container-orgd4efec3" class="outline-3">
<h3 id="orgd4efec3"><span class="section-number-3">2.9</span> int mrgExportRobotConfig_default(ViSession vi);</h3>
<div class="outline-text-3" id="text-2-9">
<p>
保存当前系统中所有机器人构形为默认配置文件
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：工程命令，不对外开放
</p>
</div>
</div>



<div id="outline-container-org6e6dca4" class="outline-3">
<h3 id="org6e6dca4"><span class="section-number-3">2.10</span> int mrgRestoreRobotConfig(ViSession vi);</h3>
<div class="outline-text-3" id="text-2-10">
<p>
恢复上次保存的配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：
</p>
</div>
</div>



<div id="outline-container-org0be1b30" class="outline-3">
<h3 id="org0be1b30"><span class="section-number-3">2.11</span> int mrgGetRobotConfigState(ViSession vi);</h3>
<div class="outline-text-3" id="text-2-11">
<p>
查询导入或导出配置文件的状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行完成；1表示正在执行；－1表示执行过程中出错
</p>

<p>
说明：
</p>
</div>
</div>



<div id="outline-container-orgfefd65f" class="outline-3">
<h3 id="orgfefd65f"><span class="section-number-3">2.12</span> int mrgSetRobotMachineSerialNum(ViSession vi, int name, char *sn);</h3>
<div class="outline-text-3" id="text-2-12">
<p>
设置当前机器人所使用的机械结构的序列号
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
serial:机械结构序列号
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-orgdce4b22" class="outline-3">
<h3 id="orgdce4b22"><span class="section-number-3">2.13</span> int mrgGetRobotMachineSerialNum(ViSession vi, int name, char*serial);</h3>
<div class="outline-text-3" id="text-2-13">
<p>
查询当前机器人所使用的机械结构的序列号
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
serial:机械结构序列号
</p>

<p>
返回值：0表示执行正确，否则表示执行失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-orgbbdd1f4" class="outline-3">
<h3 id="orgbbdd1f4"><span class="section-number-3">2.14</span> int mrgSetRobotSubType(ViSession vi, int name, int subtype);</h3>
<div class="outline-text-3" id="text-2-14">
<p>
设置当前机器人构形下的子类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
subtype:子类型。 对于H2来说，0表示小H2，1表示中H2（802x494）；2表示大H2（891x769）
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-orgf056117" class="outline-3">
<h3 id="orgf056117"><span class="section-number-3">2.15</span> int mrgGetRobotSubType(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-15">
<p>
查询当前机器人构形下的子类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
返回值：子类型。 对于H2来说，0表示小H2，1表示中H2（802x494）；2表示大H2（891x769）
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org782f0d4" class="outline-3">
<h3 id="org782f0d4"><span class="section-number-3">2.16</span> int mrgSetRobotCoordinateSystem(ViSession vi, int name, int coord);</h3>
<div class="outline-text-3" id="text-2-16">
<p>
设置当前机器人的坐标系
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
coord:坐标系索引（详情参考对应的命令系统）
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org27474be" class="outline-3">
<h3 id="org27474be"><span class="section-number-3">2.17</span> int mrgGetRobotCoordinateSystem(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-17">
<p>
查询当前机器人的坐标系
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
返回值：坐标系索引，（详情参考对应的命令系统）
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org20c615c" class="outline-3">
<h3 id="org20c615c"><span class="section-number-3">2.18</span> int mrgGetRobotCount(ViSession vi);</h3>
<div class="outline-text-3" id="text-2-18">
<p>
查询CAN网络中机器人的个数
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：返回机器人个数
</p>
</div>
</div>



<div id="outline-container-orgca1447a" class="outline-3">
<h3 id="orgca1447a"><span class="section-number-3">2.19</span> int mrgGetRobotName(ViSession vi, int *robotnames);</h3>
<div class="outline-text-3" id="text-2-19">
<p>
查询CAN网络中所有机器人的名子
</p>

<p>
vi :visa设备句柄
</p>

<p>
robotnames：输出参数，机器人名称集
</p>

<p>
返回值：返回机器人个数
</p>
</div>
</div>



<div id="outline-container-orgf82d2d8" class="outline-3">
<h3 id="orgf82d2d8"><span class="section-number-3">2.20</span> int mrgGetRobotDevice(ViSession vi, int robotname, int *device);</h3>
<div class="outline-text-3" id="text-2-20">
<p>
查询当前机器人的所使用的设备
</p>

<p>
robotname: 机器人名称
</p>

<p>
vi :visa设备句柄
</p>

<p>
device：设备名称列表
</p>

<p>
返回值：返回所使用的设备个数
</p>
</div>
</div>



<div id="outline-container-orgc452562" class="outline-3">
<h3 id="orgc452562"><span class="section-number-3">2.21</span> int mrgSetRobotProjectZero(ViSession vi, int name, float x, float y, float z);</h3>
<div class="outline-text-3" id="text-2-21">
<p>
设置当前机器人的项目零点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
x,y，z:项目零点值（x,y,z）
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org2c98a8c" class="outline-3">
<h3 id="org2c98a8c"><span class="section-number-3">2.22</span> int mrgGetRobotProjectZero(ViSession vi, int name, float *x, float *y, float *z);</h3>
<div class="outline-text-3" id="text-2-22">
<p>
查询当前机器人的项目零点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
x,y,z: 输出参数，项目零点值
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org095f3e3" class="outline-3">
<h3 id="org095f3e3"><span class="section-number-3">2.23</span> int mrgSetRobotAxisZero(ViSession vi, int name, float x, float y, float z);</h3>
<div class="outline-text-3" id="text-2-23">
<p>
设置当前机器人的校准零点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
x,y，z:校准零点值（x,y,z）
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org3181a13" class="outline-3">
<h3 id="org3181a13"><span class="section-number-3">2.24</span> int mrgGetRobotAxisZero(ViSession vi, int name, float *x, float *y, float *z);</h3>
<div class="outline-text-3" id="text-2-24">
<p>
查询当前机器人的校准零点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
x,y,z: 输出参数，校准零点值
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org5174b50" class="outline-3">
<h3 id="org5174b50"><span class="section-number-3">2.25</span> int mrgSetRobotSoftWareLimit(ViSession vi, int name, int type, float x, float y, float z);</h3>
<div class="outline-text-3" id="text-2-25">
<p>
设置当前机器人的软件限位
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
type: 正向限位还是负向限位。 0：表示正向限位；1表示负向限位
</p>

<p>
x,y，z:限位值（x,y,z）
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org5c66ec8" class="outline-3">
<h3 id="org5c66ec8"><span class="section-number-3">2.26</span> int mrgGetRobotSoftWareLimit(ViSession vi, int name, int type, float *x, float *y, float *z);</h3>
<div class="outline-text-3" id="text-2-26">
<p>
查询当前机器人的校准零点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:机器人名称
</p>

<p>
type: 正向限位还是负向限位。 0：表示正向限位；1表示负向限位
</p>

<p>
x,y,z: 输出参数，校准零点值
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>

<p>
说明：此函数目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-orgf5f05e0" class="outline-3">
<h3 id="orgf5f05e0"><span class="section-number-3">2.27</span> int mrgSetRobotWavetable(ViSession vi, int name, int wavetable);</h3>
<div class="outline-text-3" id="text-2-27">
<p>
设置指定机器人的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:波表索引值，取值范围0~9
</p>

<p>
返回值：0表示设置成功，否则表示设置失败
</p>
</div>
</div>



<div id="outline-container-org464c6bc" class="outline-3">
<h3 id="org464c6bc"><span class="section-number-3">2.28</span> int mrgRobotWavetableQuery(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-28">
<p>
查询指定机器人的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:波表索引值，取值范围0~9
</p>

<p>
返回值：大于0表示波表索引，小于零表示查询失败
</p>
</div>
</div>



<div id="outline-container-orgeffe3d4" class="outline-3">
<h3 id="orgeffe3d4"><span class="section-number-3">2.29</span> int mrgRobotRun(ViSession vi, int name, int wavetable);</h3>
<div class="outline-text-3" id="text-2-29">
<p>
启动机器人的运行
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
返回值：0表示启动成功，否则表示启动失败
</p>
</div>
</div>



<div id="outline-container-orgcbf08ae" class="outline-3">
<h3 id="orgcbf08ae"><span class="section-number-3">2.30</span> int mrgRobotStop(ViSession vi, int name, int wavetable);</h3>
<div class="outline-text-3" id="text-2-30">
<p>
停止机器人的运行
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
返回值：0表示停止成功，否则表示停止失败
</p>
</div>
</div>



<div id="outline-container-orge8ff97c" class="outline-3">
<h3 id="orge8ff97c"><span class="section-number-3">2.31</span> int mrgGetRobotStates(ViSession vi, int name, int wavetable, char *state);</h3>
<div class="outline-text-3" id="text-2-31">
<p>
查询机器人运行状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
返回值：0表示等待成功，－1：表示出错
</p>
</div>
</div>
