doc/CAPI.org
** int mrgRobotWaitEnd(ViSession vi, int name, int wavetable, int timeout_ms);

   等待机器人的特定波表的ready状态（等待模块设备解算完成）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   timeout_ms：等待超时时间

   返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时;-4:参数出错



** int mrgRobotMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);

   机器人从当前位置移动到指定位置（随机移动）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   x,y,z: 位置坐标

   time : 移动到目标位置期望使用的时间

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   说明：绝对位置移动,末端保持不动



** int mrgRobotMoveOn(ViSession vi, int name, int wavetable, float x, float y, float z, float speed);

   机器人末端沿指定的方向持续运动

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   x,y,z: 方向向量

   speed : 移动的速度。单位： 度/秒。

   返回值：0表示执行成功，否则表示过程中出错

   说明：非阻塞函数



** int mrgRobotAxisMoveOn(ViSession vi, int name, int wavetable, int ax, float speed);

   机器人末端沿指定的坐标轴持续运动

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   ax: 坐标轴，0表示X轴;1表示Y轴 ; 2表示Z轴

   speed : 移动的速度。单位： 度/秒。speed的符号决定方向，speed大于零 ，表示正方向。

   返回值：0表示执行成功，否则表示过程中出错

   说明：非阻塞函数，此命令只对H2有效



** int mrgRobotAxisMoveJog(ViSession vi, int name, int wavetable, int ax, float cr_time, float cr_speed, float speed);

   机器人末端沿指定的坐标轴持续运动(阶跃运行）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   ax: 坐标轴，0表示X轴;1表示Y轴 ; 2表示Z轴

   cr_time：爬升时间

   cr_speed：爬升的速度

   speed : 移动的保持速度。单位： 度/秒。speed的符号决定方向，speed大于零 ，表示正方向。

   返回值：0表示执行成功，否则表示过程中出错

   说明：非阻塞函数,此命令只对H2有效



** int mrgRobotRelMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);

   机器人从当前位置移动给定的距离（随机移动）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   x,y,z: 位置坐标

   time : 移动到目标位置期望使用的时间

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   说明：相对位置移动,末端保持不动



** int mrgRobotMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);

   机器人从当前位置移动到指定位置（直线移动）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   x,y,z: 位置坐标

   time : 移动到目标位置期望使用的时间

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   说明：绝对位置移动,末端保持不动



** int mrgRobotRelMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);

   机器人从当前位置移动给定的距离（直线移动）

   vi :visa设备句柄

   name: 机器人名称

   wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）

   x,y,z: 位置坐标

   time : 移动到目标位置期望使用的时间

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   说明：相对位置移动,末端保持不动



** int mrgSetRobotInterPolateMode(ViSession vi, int name, int mode);

   设置机器人当前插值模式

   vi :visa设备句柄

   name: 机器人名称

   mode: 插值模式

   返回值：0表示执行成功，－1：表示出错，



** int mrgGetRobotInterPolateMode(ViSession vi, int name, int* mode);

   查询机器人当前插值模式

   vi :visa设备句柄

   name: 机器人名称

   mode: 插值模式

   返回值：0表示执行成功，－1：表示出错，



** int mrgSetRobotInterPolateStep(ViSession vi, int name, float step);

   设置机器人当前插值步长

   vi :visa设备句柄

   name: 机器人名称

   step: 插值步长

   返回值：0表示执行成功，－1：表示出错，



** int mrgGetRobotInterPolateStep(ViSession vi, int name, float* step);

   查询机器人当前插值步长

   vi :visa设备句柄

   name: 机器人名称

   step: 插值步长

   返回值：0表示执行成功，－1：表示出错，



** int mrgSetRobotHomeWavetable(ViSession vi, int name, int wavetable);

   设置机器人回零位时使用的波表

   vi :visa设备句柄

   name: 机器人名称

   wavetable:波表索引

   返回值：0表示执行成功，－1：表示出错



** int mrgGetRobotHomeWavetable(ViSession vi, int name);

   查询机器人回零位时使用的波表

   vi :visa设备句柄

   name: 机器人名称

   wavetable:返回的波表索引

   返回值：大于等于0表示查询到的波表索引，小于零：表示出错



** int mrgRobotGoHome(ViSession vi, int name, int timeout_ms);

   机器人回零位操作

   vi :visa设备句柄

   name: 机器人名称

   timeout_ms:表示等待超时时间

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时

   说明：末端保持不动



** int mrgRobotGoHomeWithParam(ViSession vi, int name, float param, int timeout_ms);

   机器人回零位操作

   vi :visa设备句柄

   name: 机器人名称

   param: 参数，对于T4来说，指的是时间，即在多秒时间内回到零位。对于H2来说，指的是回零位的速度，度/秒

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时

   说明：末端保持不动



** int mrgRobotGoHomeStop(ViSession vi, int name);

   停止机器人回零位操作

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，-1:表示失败



** int mrgRobotWaitHomeEnd(ViSession vi, int name, int timeout_ms);

   等待机器人回零位结束状态（等待运行完成）

   vi :visa设备句柄

   name: 机器人名称

   timeout_ms：等待超时时间，为零表示无限等待

   返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时



** int mrgGetRobotHomeAngle(ViSession vi, int name, float *angles);

   获取机器人在原点时的各关节的角度

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，否则表示失败

   说明：angles是不安全的，请在外部确保angles的空间足够



** int mrgGetRobotHomePosition(ViSession vi, int name, float *x, float *y, float* z);

   获取机器人在零位时，末端的坐标点值

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功， －1：表示执行失败



** int mrgSetRobotHomeMode(ViSession vi, int name, int mode);

   设置机器人的回零方式

   vi :visa设备句柄

   name: 机器人名称

   mode: 回零方式。 0： 先x后y ； 1：先y后x

   返回值：0表示执行成功，－1：表示出错，

   说明：此命令目前只对H2有效



