doc/CAPI.html



<div id="outline-container-org68c6b10" class="outline-3">
<h3 id="org68c6b10"><span class="section-number-3">2.32</span> int mrgRobotWaitReady(ViSession vi, int name, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-32">
<p>
等待机器人的特定波表的ready状态（等待模块设备解算完成）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
timeout_ms：等待超时时间
</p>

<p>
返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-org5dbbd7c" class="outline-3">
<h3 id="org5dbbd7c"><span class="section-number-3">2.33</span> int mrgRobotWaitEnd(ViSession vi, int name, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-33">
<p>
等待机器人的特定波表的ready状态（等待模块设备解算完成）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
timeout_ms：等待超时时间
</p>

<p>
返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时;-4:参数出错
</p>
</div>
</div>



<div id="outline-container-orge07d67a" class="outline-3">
<h3 id="orge07d67a"><span class="section-number-3">2.34</span> int mrgRobotMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-34">
<p>
机器人从当前位置移动到指定位置（随机移动）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
x,y,z: 位置坐标
</p>

<p>
time : 移动到目标位置期望使用的时间
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>

<p>
说明：绝对位置移动,末端保持不动
</p>
</div>
</div>



<div id="outline-container-orge227596" class="outline-3">
<h3 id="orge227596"><span class="section-number-3">2.35</span> int mrgRobotMoveOn(ViSession vi, int name, int wavetable, float x, float y, float z, float speed);</h3>
<div class="outline-text-3" id="text-2-35">
<p>
机器人末端沿指定的方向持续运动
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
x,y,z: 方向向量
</p>

<p>
speed : 移动的速度。单位： 度/秒。
</p>

<p>
返回值：0表示执行成功，否则表示过程中出错
</p>

<p>
说明：非阻塞函数
</p>
</div>
</div>



<div id="outline-container-org7470fa8" class="outline-3">
<h3 id="org7470fa8"><span class="section-number-3">2.36</span> int mrgRobotAxisMoveOn(ViSession vi, int name, int wavetable, int ax, float speed);</h3>
<div class="outline-text-3" id="text-2-36">
<p>
机器人末端沿指定的坐标轴持续运动
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
ax: 坐标轴，0表示X轴;1表示Y轴 ; 2表示Z轴
</p>

<p>
speed : 移动的速度。单位： 度/秒。speed的符号决定方向，speed大于零 ，表示正方向。
</p>

<p>
返回值：0表示执行成功，否则表示过程中出错
</p>

<p>
说明：非阻塞函数，此命令只对H2有效
</p>
</div>
</div>



<div id="outline-container-org90eb1c8" class="outline-3">
<h3 id="org90eb1c8"><span class="section-number-3">2.37</span> int mrgRobotAxisMoveJog(ViSession vi, int name, int wavetable, int ax, float cr_time, float cr_speed, float speed);</h3>
<div class="outline-text-3" id="text-2-37">
<p>
机器人末端沿指定的坐标轴持续运动(阶跃运行）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
ax: 坐标轴，0表示X轴;1表示Y轴 ; 2表示Z轴
</p>

<p>
cr_time：爬升时间
</p>

<p>
cr_speed：爬升的速度
</p>

<p>
speed : 移动的保持速度。单位： 度/秒。speed的符号决定方向，speed大于零 ，表示正方向。
</p>

<p>
返回值：0表示执行成功，否则表示过程中出错
</p>

<p>
说明：非阻塞函数,此命令只对H2有效
</p>
</div>
</div>



<div id="outline-container-org41c04c9" class="outline-3">
<h3 id="org41c04c9"><span class="section-number-3">2.38</span> int mrgRobotRelMove(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-38">
<p>
机器人从当前位置移动给定的距离（随机移动）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
x,y,z: 位置坐标
</p>

<p>
time : 移动到目标位置期望使用的时间
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>

<p>
说明：相对位置移动,末端保持不动
</p>
</div>
</div>



<div id="outline-container-org7846a2f" class="outline-3">
<h3 id="org7846a2f"><span class="section-number-3">2.39</span> int mrgRobotMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-39">
<p>
机器人从当前位置移动到指定位置（直线移动）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
x,y,z: 位置坐标
</p>

<p>
time : 移动到目标位置期望使用的时间
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>

<p>
说明：绝对位置移动,末端保持不动
</p>
</div>
</div>



<div id="outline-container-org56b1ef8" class="outline-3">
<h3 id="org56b1ef8"><span class="section-number-3">2.40</span> int mrgRobotRelMoveL(ViSession vi, int name, int wavetable, float x, float y, float z, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-40">
<p>
机器人从当前位置移动给定的距离（直线移动）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable ：波表索引，－1表示使用默认索引（调用mrgSetRobotWavetable设置的波表索引）
</p>

<p>
x,y,z: 位置坐标
</p>

<p>
time : 移动到目标位置期望使用的时间
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>

<p>
说明：相对位置移动,末端保持不动
</p>
</div>
</div>



<div id="outline-container-orgbc26d1f" class="outline-3">
<h3 id="orgbc26d1f"><span class="section-number-3">2.41</span> int mrgSetRobotInterPolateMode(ViSession vi, int name, int mode);</h3>
<div class="outline-text-3" id="text-2-41">
<p>
设置机器人当前插值模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
mode: 插值模式
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>
</div>
</div>



<div id="outline-container-orgc4810be" class="outline-3">
<h3 id="orgc4810be"><span class="section-number-3">2.42</span> int mrgGetRobotInterPolateMode(ViSession vi, int name, int* mode);</h3>
<div class="outline-text-3" id="text-2-42">
<p>
查询机器人当前插值模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
mode: 插值模式
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>
</div>
</div>



<div id="outline-container-org98016f1" class="outline-3">
<h3 id="org98016f1"><span class="section-number-3">2.43</span> int mrgSetRobotInterPolateStep(ViSession vi, int name, float step);</h3>
<div class="outline-text-3" id="text-2-43">
<p>
设置机器人当前插值步长
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
step: 插值步长
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>
</div>
</div>



<div id="outline-container-org0b2f33b" class="outline-3">
<h3 id="org0b2f33b"><span class="section-number-3">2.44</span> int mrgGetRobotInterPolateStep(ViSession vi, int name, float* step);</h3>
<div class="outline-text-3" id="text-2-44">
<p>
查询机器人当前插值步长
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
step: 插值步长
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>
</div>
</div>



<div id="outline-container-orgf031a4a" class="outline-3">
<h3 id="orgf031a4a"><span class="section-number-3">2.45</span> int mrgSetRobotHomeWavetable(ViSession vi, int name, int wavetable);</h3>
<div class="outline-text-3" id="text-2-45">
<p>
设置机器人回零位时使用的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:波表索引
</p>

<p>
返回值：0表示执行成功，－1：表示出错
</p>
</div>
</div>



<div id="outline-container-org070f576" class="outline-3">
<h3 id="org070f576"><span class="section-number-3">2.46</span> int mrgGetRobotHomeWavetable(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-46">
<p>
查询机器人回零位时使用的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable:返回的波表索引
</p>

<p>
返回值：大于等于0表示查询到的波表索引，小于零：表示出错
</p>
</div>
</div>



<div id="outline-container-org6ee1528" class="outline-3">
<h3 id="org6ee1528"><span class="section-number-3">2.47</span> int mrgRobotGoHome(ViSession vi, int name, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-47">
<p>
机器人回零位操作
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
timeout_ms:表示等待超时时间
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时
</p>

<p>
说明：末端保持不动
</p>
</div>
</div>



<div id="outline-container-org60e3004" class="outline-3">
<h3 id="org60e3004"><span class="section-number-3">2.48</span> int mrgRobotGoHomeWithParam(ViSession vi, int name, float param, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-48">
<p>
机器人回零位操作
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
param: 参数，对于T4来说，指的是时间，即在多秒时间内回到零位。对于H2来说，指的是回零位的速度，度/秒
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时
</p>

<p>
说明：末端保持不动
</p>
</div>
</div>



<div id="outline-container-org5b4060d" class="outline-3">
<h3 id="org5b4060d"><span class="section-number-3">2.49</span> int mrgRobotGoHomeStop(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-49">
<p>
停止机器人回零位操作
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，-1:表示失败
</p>
</div>
</div>



<div id="outline-container-org472891d" class="outline-3">
<h3 id="org472891d"><span class="section-number-3">2.50</span> int mrgRobotWaitHomeEnd(ViSession vi, int name, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-50">
<p>
等待机器人回零位结束状态（等待运行完成）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
timeout_ms：等待超时时间，为零表示无限等待
</p>

<p>
返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-orgb89bfc8" class="outline-3">
<h3 id="orgb89bfc8"><span class="section-number-3">2.51</span> int mrgGetRobotHomeAngle(ViSession vi, int name, float *angles);</h3>
<div class="outline-text-3" id="text-2-51">
<p>
获取机器人在原点时的各关节的角度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明：angles是不安全的，请在外部确保angles的空间足够
</p>
</div>
</div>



<div id="outline-container-orgedb427e" class="outline-3">
<h3 id="orgedb427e"><span class="section-number-3">2.52</span> int mrgGetRobotHomePosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</h3>
<div class="outline-text-3" id="text-2-52">
<p>
获取机器人在零位时，末端的坐标点值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org69c0adb" class="outline-3">
<h3 id="org69c0adb"><span class="section-number-3">2.53</span> int mrgSetRobotHomeMode(ViSession vi, int name, int mode);</h3>
<div class="outline-text-3" id="text-2-53">
<p>
设置机器人的回零方式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
mode: 回零方式。 0： 先x后y ； 1：先y后x
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>

<p>
说明：此命令目前只对H2有效
</p>
</div>
</div>
