doc/CAPI.org
** int mrgGetRobotHomeMode(ViSession vi, int name);

   查询机器人的回零方式

   vi :visa设备句柄

   name: 机器人名称

   返回值：大于等于0表示回零方式，否则表示出错，

   说明：此命令目前只对H2有效



** int mrgGetRobotHomeRequire(ViSession vi, int name);

   查询机器人的是否需要回零

   vi :visa设备句柄

   name: 机器人名称

   返回值：1表示需要回零 ，0表示不需要回零，小于零表示出错，

   说明：MRHT在构建机器人后,第一件事就是回零.如果不回零,禁止对机器人的操作



** int mrgRobotPointClear(ViSession vi, int name);

   给指定的机器人加载坐标点

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，否则表示失败

   说明：在调 用mrgRobotPointLoad（）函数前，请使用此函数清空上次的坐标点



** int mrgRobotPointLoad(ViSession vi, int name, float x, float y, float z, float end, float time,int mod,float step);

   给指定的机器人加载坐标点

   vi :visa设备句柄

   name: 机器人名称

   x,y,z: 坐标点信息

   end: 末端执行器电机转动的角度值

   time: 时间，表示当前点在主时间轴上的位置

   mod :是否插值

   返回值：0表示执行成功，否则表示失败

   说明：此函数只是将上位机的坐标点信息下载到MRG中，MRG并未开始解算.

   另，  在调用此函数开始下发坐标点前，务必使用mrgRobotPointClear()函数，通知机器人清空其缓存中的坐标点。



** int mrgRobotPointResolve(ViSession vi, int name, int wavetable, int timeout_ms);

   通知机器人开始解算其缓存中的坐标点，并下发给模块设备，直到模块设备解算完成

   vi :visa设备句柄

   name: 机器人名称

   wavetable: 解算到指定的波表。 如果为－1，表示解算到当前机器人默认的波表中

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时



** int mrgRobotPvtClear(ViSession vi, int name);

   通知机器人清空PVT缓存

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，否则表示失败

   说明：在调 用mrgRobotPvtLoad（）函数前，请使用此函数清空上次的PVT



** int mrgRobotPvtLoad(ViSession vi, int name, float p, float v, float t, int axle);

   给指定的机器人加载坐标点

   vi :visa设备句柄

   name: 机器人名称

   p,v,t: pvt信息

   axle: 轴索引

   返回值：0表示执行成功，否则表示失败

   说明：此函数只是将上位机的坐标点信息下载到MRG中，MRG并未开始解算.

   另，  在调用此函数开始下发坐标点前，务必使用mrgRobotPvtClear()函数，通知机器人清空其缓存中的坐标点。



** int mrgRobotPvtResolve(ViSession vi, int name, int wavetable, int timeout_ms);

   通知机器人开始下发其缓存中的PVT到模块设备，直到模块设备解算完成

   vi :visa设备句柄

   name: 机器人名称

   wavetable: 解算到指定的波表。 如果为－1，表示解算到当前机器人默认的波表中

   timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时



** int mrgRobotMotionFileImport(ViSession vi, int name,char* filename);

   从存储器中，导入运动文件到机器人缓存中

   vi :visa设备句柄

   name: 机器人名称

   filename: 点坐标文件名

   返回值：0表示执行成功，否则表示失败



** int mrgRobotMotionFileImportLocal(ViSession vi, int name, char* filename);

   从本地存储器中，导入运动文件到机器人缓存中

   vi :visa设备句柄

   name: 机器人名称

   filename: 点坐标文件名

   返回值：0表示执行成功，否则表示失败

   说明 :



** int mrgRobotMotionFileImportExternal(ViSession vi, int name, char* filename);

   从外部存储器中，导入运动文件到机器人缓存中

   vi :visa设备句柄

   name: 机器人名称

   filename: 点坐标文件名

   返回值：0表示执行成功，否则表示失败

   说明 :



** int mrgRobotFileResolve(ViSession vi, int name, int section, int line, int wavetable, int timeout_ms);

   解算当前运动文件内容到模块中

   vi :visa设备句柄

   name: 机器人名称

   section:文件中的哪个段，这是个必须的参数. 从零开始计数.

   line：一个段中的哪一行（只针对MFC的文件），line从1开始计数。对于非MFC的文件，不关心line值。line的值为零时,表示本次要解析整个段的数据.

   wavetable : 波表索引。如果不想明确指定波表，可设置 为-1.

   timeout_ms:等等解算完成的超时时间。若timeout_ms＝－1，表示不等待解算完成。timeout_ms ＝ 0，表示无限等待。

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时



** int mrgRobotMotionFileExport(ViSession vi, int name, int location, char* filename);

   将系统中的运动数据，导出成文件

   vi :visa设备句柄

   name: 机器人名称

   location:0表示导出到本地存储（本地文件系统）；1表示导出到外部存储（U盘之类）

   filename：表示导出的文件名

   返回值：0表示执行正确，否则表示失败。



** int mrgRobotToolSet(ViSession vi, int robotname, int type, char* dev);

   设置末端执行器类型及相应的设备

   vi :visa设备句柄

   name: 机器人名称

   type: 末端执行器类型 0->爪子

   dev : 末端执行器对应的通道设备 (1@513), 哪个设备的哪个轴

   返回值：0表示执行成功，－1：表示出错



** int mrgRobotWaitToolExeEnd(ViSession vi, int name, int timeout_ms);

   等待末端执行器执行完成

   vi :visa设备句柄

   name: 机器人名称

   timeout_ms : 末端执行器执行的超时时间，0表示无限等待

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时



** int mrgRobotToolExe(ViSession vi, int name, float position, float time, int timeout_ms);

   执行末端执行器

   vi :visa设备句柄

   name: 机器人名称

   position: 末端执行器电机转动的角度

   time : 末端执行器电机转动的角度所用时间

   timeout_ms : 末端执行器执行的超时时间, 0表示无限等待; -1表示不等待

   返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时



** int mrgRobotToolStop(ViSession vi, int name);

   停止末端执行器

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，否则表示失败



** int mrgRobotToolStopGoHome(ViSession vi, int name);

   中止末端执行器回初始位

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功，否则表示失败



** int mrgRobotToolGoHome(ViSession vi, int name, int timeout_ms);

   末端执行器回初始位

   vi :visa设备句柄

   name: 机器人名称

   timeout_ms: 等待的超时时间, 0表示无限等待; -1表示不等待

   返回值：0表示执行成功，否则表示失败



** int mrgGetRobotToolPosition(ViSession vi, int name, float *position);

   获取机器人末端执行器的位置

   vi :visa设备句柄

   name: 机器人名称

   position:末端执行器的位置(相对于机械零点),单位:角度.

   返回值：0表示执行正确, 否则执行失败



** int mrgRobotGetToolType(ViSession vi, int robotname, int * type);

   查询末端执行器类型

   vi :visa设备句柄

   name: 机器人名称

   type: 末端执行器类型 0->爪子

   dev : 末端执行器对应的通道设备 (1@513), 哪个设备的哪个轴

   返回值：0表示执行成功，－1：表示出错



** int mrgRobotToolExeMode(ViSession vi, int name, int mode); 

   末端执行器执行模式

   vi :visa设备句柄

   name: 机器人名称

   mode: 末端执行器执行模式. 0:正常模式; 1:先张开,再闭合到目标位置

   返回值：0表示执行成功，－1：表示出错，





 

 

 /*

** int mrgRobotToolExeMode_Query(ViSession vi, int name, int* mode);

   查询末端执行器执行模式

   vi :visa设备句柄

   name: 机器人名称

   mode: 末端执行器执行模式. 0:正常模式; 1:先张开,再闭合到目标位置

   返回值：0表示执行成功，－1：表示出错



** int mrgGetRobotCurrentAngle(ViSession vi, int name, float *angles);

   获取机器人当前各关节的角度值

   vi :visa设备句柄

   name: 机器人名称

   返回值：大于零 表示返回角度值的个数，小于等于零表示出错

   注： angles是不安全的，外部一定要保证angles的空间足够



