doc/CAPI.html



<div id="outline-container-org910271b" class="outline-3">
<h3 id="org910271b"><span class="section-number-3">2.54</span> int mrgGetRobotHomeMode(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-54">
<p>
查询机器人的回零方式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：大于等于0表示回零方式，否则表示出错，
</p>

<p>
说明：此命令目前只对H2有效
</p>
</div>
</div>



<div id="outline-container-org98742b7" class="outline-3">
<h3 id="org98742b7"><span class="section-number-3">2.55</span> int mrgGetRobotHomeRequire(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-55">
<p>
查询机器人的是否需要回零
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：1表示需要回零 ，0表示不需要回零，小于零表示出错，
</p>

<p>
说明：MRHT在构建机器人后,第一件事就是回零.如果不回零,禁止对机器人的操作
</p>
</div>
</div>



<div id="outline-container-orgb83941d" class="outline-3">
<h3 id="orgb83941d"><span class="section-number-3">2.56</span> int mrgRobotPointClear(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-56">
<p>
给指定的机器人加载坐标点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明：在调 用mrgRobotPointLoad（）函数前，请使用此函数清空上次的坐标点
</p>
</div>
</div>



<div id="outline-container-orgd1c0451" class="outline-3">
<h3 id="orgd1c0451"><span class="section-number-3">2.57</span> int mrgRobotPointLoad(ViSession vi, int name, float x, float y, float z, float end, float time,int mod,float step);</h3>
<div class="outline-text-3" id="text-2-57">
<p>
给指定的机器人加载坐标点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
x,y,z: 坐标点信息
</p>

<p>
end: 末端执行器电机转动的角度值
</p>

<p>
time: 时间，表示当前点在主时间轴上的位置
</p>

<p>
mod :是否插值
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明：此函数只是将上位机的坐标点信息下载到MRG中，MRG并未开始解算.
</p>

<p>
另，  在调用此函数开始下发坐标点前，务必使用mrgRobotPointClear()函数，通知机器人清空其缓存中的坐标点。
</p>
</div>
</div>



<div id="outline-container-org2c2a803" class="outline-3">
<h3 id="org2c2a803"><span class="section-number-3">2.58</span> int mrgRobotPointResolve(ViSession vi, int name, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-58">
<p>
通知机器人开始解算其缓存中的坐标点，并下发给模块设备，直到模块设备解算完成
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable: 解算到指定的波表。 如果为－1，表示解算到当前机器人默认的波表中
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-orge3c33c4" class="outline-3">
<h3 id="orge3c33c4"><span class="section-number-3">2.59</span> int mrgRobotPvtClear(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-59">
<p>
通知机器人清空PVT缓存
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明：在调 用mrgRobotPvtLoad（）函数前，请使用此函数清空上次的PVT
</p>
</div>
</div>



<div id="outline-container-org4e6dfeb" class="outline-3">
<h3 id="org4e6dfeb"><span class="section-number-3">2.60</span> int mrgRobotPvtLoad(ViSession vi, int name, float p, float v, float t, int axle);</h3>
<div class="outline-text-3" id="text-2-60">
<p>
给指定的机器人加载坐标点
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
p,v,t: pvt信息
</p>

<p>
axle: 轴索引
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明：此函数只是将上位机的坐标点信息下载到MRG中，MRG并未开始解算.
</p>

<p>
另，  在调用此函数开始下发坐标点前，务必使用mrgRobotPvtClear()函数，通知机器人清空其缓存中的坐标点。
</p>
</div>
</div>



<div id="outline-container-org2838a32" class="outline-3">
<h3 id="org2838a32"><span class="section-number-3">2.61</span> int mrgRobotPvtResolve(ViSession vi, int name, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-61">
<p>
通知机器人开始下发其缓存中的PVT到模块设备，直到模块设备解算完成
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable: 解算到指定的波表。 如果为－1，表示解算到当前机器人默认的波表中
</p>

<p>
timeout_ms:表示等待超时时间,0表示无限等待，－1表示不等待，立即返回
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-org384ee2c" class="outline-3">
<h3 id="org384ee2c"><span class="section-number-3">2.62</span> int mrgRobotMotionFileImport(ViSession vi, int name,char* filename);</h3>
<div class="outline-text-3" id="text-2-62">
<p>
从存储器中，导入运动文件到机器人缓存中
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
filename: 点坐标文件名
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>
</div>
</div>



<div id="outline-container-orga8a37fb" class="outline-3">
<h3 id="orga8a37fb"><span class="section-number-3">2.63</span> int mrgRobotMotionFileImportLocal(ViSession vi, int name, char* filename);</h3>
<div class="outline-text-3" id="text-2-63">
<p>
从本地存储器中，导入运动文件到机器人缓存中
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
filename: 点坐标文件名
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明 :
</p>
</div>
</div>



<div id="outline-container-orga8b3146" class="outline-3">
<h3 id="orga8b3146"><span class="section-number-3">2.64</span> int mrgRobotMotionFileImportExternal(ViSession vi, int name, char* filename);</h3>
<div class="outline-text-3" id="text-2-64">
<p>
从外部存储器中，导入运动文件到机器人缓存中
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
filename: 点坐标文件名
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>

<p>
说明 :
</p>
</div>
</div>



<div id="outline-container-org08f383f" class="outline-3">
<h3 id="org08f383f"><span class="section-number-3">2.65</span> int mrgRobotFileResolve(ViSession vi, int name, int section, int line, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-65">
<p>
解算当前运动文件内容到模块中
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
section:文件中的哪个段，这是个必须的参数. 从零开始计数.
</p>

<p>
line：一个段中的哪一行（只针对MFC的文件），line从1开始计数。对于非MFC的文件，不关心line值。line的值为零时,表示本次要解析整个段的数据.
</p>

<p>
wavetable : 波表索引。如果不想明确指定波表，可设置 为-1.
</p>

<p>
timeout_ms:等等解算完成的超时时间。若timeout_ms＝－1，表示不等待解算完成。timeout_ms ＝ 0，表示无限等待。
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-orge306379" class="outline-3">
<h3 id="orge306379"><span class="section-number-3">2.66</span> int mrgRobotMotionFileExport(ViSession vi, int name, int location, char* filename);</h3>
<div class="outline-text-3" id="text-2-66">
<p>
将系统中的运动数据，导出成文件
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
location:0表示导出到本地存储（本地文件系统）；1表示导出到外部存储（U盘之类）
</p>

<p>
filename：表示导出的文件名
</p>

<p>
返回值：0表示执行正确，否则表示失败。
</p>
</div>
</div>



<div id="outline-container-orgba10a23" class="outline-3">
<h3 id="orgba10a23"><span class="section-number-3">2.67</span> int mrgRobotToolSet(ViSession vi, int robotname, int type, char* dev);</h3>
<div class="outline-text-3" id="text-2-67">
<p>
设置末端执行器类型及相应的设备
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
type: 末端执行器类型 0-&gt;爪子
</p>

<p>
dev : 末端执行器对应的通道设备 (1@513), 哪个设备的哪个轴
</p>

<p>
返回值：0表示执行成功，－1：表示出错
</p>
</div>
</div>



<div id="outline-container-org9bde271" class="outline-3">
<h3 id="org9bde271"><span class="section-number-3">2.68</span> int mrgRobotWaitToolExeEnd(ViSession vi, int name, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-68">
<p>
等待末端执行器执行完成
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
timeout_ms : 末端执行器执行的超时时间，0表示无限等待
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时
</p>
</div>
</div>



<div id="outline-container-org151b84a" class="outline-3">
<h3 id="org151b84a"><span class="section-number-3">2.69</span> int mrgRobotToolExe(ViSession vi, int name, float position, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-69">
<p>
执行末端执行器
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
position: 末端执行器电机转动的角度
</p>

<p>
time : 末端执行器电机转动的角度所用时间
</p>

<p>
timeout_ms : 末端执行器执行的超时时间, 0表示无限等待; -1表示不等待
</p>

<p>
返回值：0表示执行成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示执行超时
</p>
</div>
</div>



<div id="outline-container-org13575b4" class="outline-3">
<h3 id="org13575b4"><span class="section-number-3">2.70</span> int mrgRobotToolStop(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-70">
<p>
停止末端执行器
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>
</div>
</div>



<div id="outline-container-org607e3a6" class="outline-3">
<h3 id="org607e3a6"><span class="section-number-3">2.71</span> int mrgRobotToolStopGoHome(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-71">
<p>
中止末端执行器回初始位
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>
</div>
</div>



<div id="outline-container-org9ab509b" class="outline-3">
<h3 id="org9ab509b"><span class="section-number-3">2.72</span> int mrgRobotToolGoHome(ViSession vi, int name, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-72">
<p>
末端执行器回初始位
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
timeout_ms: 等待的超时时间, 0表示无限等待; -1表示不等待
</p>

<p>
返回值：0表示执行成功，否则表示失败
</p>
</div>
</div>



<div id="outline-container-org00eed3d" class="outline-3">
<h3 id="org00eed3d"><span class="section-number-3">2.73</span> int mrgGetRobotToolPosition(ViSession vi, int name, float *position);</h3>
<div class="outline-text-3" id="text-2-73">
<p>
获取机器人末端执行器的位置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
position:末端执行器的位置(相对于机械零点),单位:角度.
</p>

<p>
返回值：0表示执行正确, 否则执行失败
</p>
</div>
</div>



<div id="outline-container-org89570ad" class="outline-3">
<h3 id="org89570ad"><span class="section-number-3">2.74</span> int mrgRobotGetToolType(ViSession vi, int robotname, int * type);</h3>
<div class="outline-text-3" id="text-2-74">
<p>
查询末端执行器类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
type: 末端执行器类型 0-&gt;爪子
</p>

<p>
dev : 末端执行器对应的通道设备 (1@513), 哪个设备的哪个轴
</p>

<p>
返回值：0表示执行成功，－1：表示出错
</p>
</div>
</div>



<div id="outline-container-orgf90f566" class="outline-3">
<h3 id="orgf90f566"><span class="section-number-3">2.75</span> int mrgRobotToolExeMode(ViSession vi, int name, int mode);</h3>
<div class="outline-text-3" id="text-2-75">
<p>
末端执行器执行模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
mode: 末端执行器执行模式. 0:正常模式; 1:先张开,再闭合到目标位置
</p>

<p>
返回值：0表示执行成功，－1：表示出错，
</p>









<p>
/*
</p>
</div>
</div>

<div id="outline-container-orgd6160c2" class="outline-3">
<h3 id="orgd6160c2"><span class="section-number-3">2.76</span> int mrgRobotToolExeMode_Query(ViSession vi, int name, int* mode);</h3>
<div class="outline-text-3" id="text-2-76">
<p>
查询末端执行器执行模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
mode: 末端执行器执行模式. 0:正常模式; 1:先张开,再闭合到目标位置
</p>

<p>
返回值：0表示执行成功，－1：表示出错
</p>
</div>
</div>



<div id="outline-container-org199b0f9" class="outline-3">
<h3 id="org199b0f9"><span class="section-number-3">2.77</span> int mrgGetRobotCurrentAngle(ViSession vi, int name, float *angles);</h3>
<div class="outline-text-3" id="text-2-77">
<p>
获取机器人当前各关节的角度值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：大于零 表示返回角度值的个数，小于等于零表示出错
</p>

<p>
注： angles是不安全的，外部一定要保证angles的空间足够
</p>
</div>
</div>
