doc/CAPI.org
** int mrgGetRobotCurrentPosition(ViSession vi, int name, float *x, float *y, float* z);

   获取机器人末端的位置坐标

   vi :visa设备句柄

   name: 机器人名称

   返回值：0表示执行成功， －1：表示执行失败



** int mrgRobotJointHome(ViSession vi, int name, int axi, float speed, int timeout_ms);

   机器人某一个轴回零

   vi :visa设备句柄

   name: 机器人名称

   axi :轴索引

   speed: 回零速度,单位:度/秒

   timeout_ms:表示等待回零结束的超时时间. 如果为-1,表示不等待. 0表示无限等待. >0 表示等待的超时时间. 单位:ms

   返回值：0表示执行成功， －1：表示执行失败



** int mrgRobotJointMove(ViSession vi, int name, int axi, float position, float time, int timeout_ms);

   控制机器人某一个轴运动

   vi :visa设备句柄

   name: 机器人名称

   axi :轴索引

   position: 轴运行的距离,单位: 度

   time : 轴运动时所需要的时间. 单位:秒

   timeout_ms:表示等待回零结束的超时时间. 如果为-1,表示不等待. 0表示无限等待. >0 表示等待的超时时间. 单位:ms

   返回值：0表示执行成功， －1：表示执行失败



** int mrgRobotJointMoveOn(ViSession vi, int name, int axi, float speed);

   控制机器人某一个轴持续运动

   vi :visa设备句柄

   name: 机器人名称

   axi :轴索引

   speed: 轴运行的速度,单位: 度/秒

   wavetable : 波表

   返回值：0表示执行成功， －1：表示执行失败

   

** int mrgGetRobotJointAngle(ViSession vi, int name, int joint, float *angle);

   获取机器人各关节的当前角度

   vi :visa设备句柄

   name: 机器人名称

   joint:指定机器人的关节索引. 0表示第一个关节(对T4来说,0指的是基座, 对H2来说,0指的是左边的关节). 如果为-1,则表示获取所有的关节

   返回值：大于零,表示返回的关节角度个数, 否则,出错

   说明: angle 是不安全的,请确保外部分配足够的空间给angle



** int mrgGetRobotCurrentMileage(ViSession vi, int name, float *x, float *y, float* z);

   机器人当前的里程数，单位 ：米

   vi :visa设备句柄

   name: 机器人名称

   x,y,z ：各坐标轴方向上的里程

   返回值：0表示执行成功， －1：表示执行失败



** int mrgGetRobotTargetPosition(ViSession vi, int name, float *x, float *y, float* z);

   获取机器人的目标位置

   vi :visa设备句柄

   name: 机器人名称

   x,y,z ：各坐标轴方向上的点

   返回值：0表示执行成功， －1：表示执行失败



** int mrgGetRobotCurrentRecord(ViSession vi, int name, int *record);

   获取机器人的当前执行的指令索引

   vi :visa设备句柄

   name: 机器人名称

   x,y,z ：各坐标轴方向上的点

   返回值：0表示执行成功， －1：表示执行失败

   此命令只对H2有效！！！！！



** int mrgGetRobotWristPose(ViSession vi, int name, float *angle);

   获取机器人腕关节的姿态角度(相对于90度的算法零位)

   vi :visa设备句柄

   name: 机器人名称

   angle: 腕关节角度(垂直向下时为零)

   返回值：零表示执行正确,-1表示执行错误



** int mrgSetRobotWristPose(ViSession vi, int name, float angle,float time,int timeout_ms);

   控制机器人腕关节的姿态角度(相对于90度的算法零位)

   vi :visa设备句柄

   name: 机器人名称

   wavetable: 波表

   angle: 腕关节角度(垂直向下时为零)

   speed: 速度

   timeout_ms: 表示等待执行的超时时间. 如果为-1,表示不等待. 0表示无限等待. >0 表示等待的超时时间. 单位:ms

   返回值：零表示执行正确,-1表示执行错误



** int mrgSetRobotFold(ViSession vi, int name, float axi0, float axi1, float axi2, float axi3, int timeout);

   机器人的折叠功能(包装位)

   vi :visa设备句柄

   name: 机器人名称

   axi0 axi1,axi2,axi3：各轴相对于零点的角度值. axi0:基座; axi1:大臂;axi2:小臂;axi3:腕

   timeout:正数表示等待超时时间, -1表示不等待,0表示无限等待

   返回值：0表示执行成功， -1：表示执行失败

   此命令只对T4有效!



** int mrgGetRobotFoldState(ViSession vi, int name);

   获取机器人的折叠状态

   vi :visa设备句柄

   name: 机器人名称

   返回值：1表示执行成功， 0：还要折叠中; 小于零表示执行出错

   此命令只对T4有效！





* mrqdevice.h

** enum RUN_STATE

   |------------+-----------|

   | RS_IDLE    | "IDLE"    |

   | RS_LOADING | "LOADING" |

   | RS_READY   | "READY"   |

   | RS_RUNNING | "RUNNING" |

   | RS_STOP    | "STOP"    |

   | RS_ERROR   | "ERROR"   |

   | RS_RESERVE |           |

   |------------+-----------|



** enum MT_STATE

  |-----------------+---|

  | MTSTATE_POWERON | 0 |

  | MTSTATE_RESET   | 1 |

  | MTSTATE_CALCING | 2 |

  | MTSTATE_CALCEND | 3 |

  | MTSTATE_STANDBY | 4 |

  | MTSTATE_RUNNING | 5 |

  | MTSTATE_ERROR   | 6 |

  | MTSTATE_RESERVE | 7 |

  |-----------------+---|



** enum MT_SWITCH

   |--------------------+---|

   | MTSWITCH_RESET     | 0 |

   | MTSWITCH_STOP      | 1 |

   | MTSWITCH_RUN       | 2 |

   | MTSWITCH_PREPARE   | 3 |

   | MTSWITCH_EMERGSTOP | 4 |

   |--------------------+---|



