doc/CAPI.html



<div id="outline-container-org1f4b6a7" class="outline-3">
<h3 id="org1f4b6a7"><span class="section-number-3">2.78</span> int mrgGetRobotCurrentPosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</h3>
<div class="outline-text-3" id="text-2-78">
<p>
获取机器人末端的位置坐标
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org21a9485" class="outline-3">
<h3 id="org21a9485"><span class="section-number-3">2.79</span> int mrgRobotJointHome(ViSession vi, int name, int axi, float speed, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-79">
<p>
机器人某一个轴回零
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
axi :轴索引
</p>

<p>
speed: 回零速度,单位:度/秒
</p>

<p>
timeout_ms:表示等待回零结束的超时时间. 如果为-1,表示不等待. 0表示无限等待. &gt;0 表示等待的超时时间. 单位:ms
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org079f1a2" class="outline-3">
<h3 id="org079f1a2"><span class="section-number-3">2.80</span> int mrgRobotJointMove(ViSession vi, int name, int axi, float position, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-80">
<p>
控制机器人某一个轴运动
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
axi :轴索引
</p>

<p>
position: 轴运行的距离,单位: 度
</p>

<p>
time : 轴运动时所需要的时间. 单位:秒
</p>

<p>
timeout_ms:表示等待回零结束的超时时间. 如果为-1,表示不等待. 0表示无限等待. &gt;0 表示等待的超时时间. 单位:ms
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org6505fe3" class="outline-3">
<h3 id="org6505fe3"><span class="section-number-3">2.81</span> int mrgRobotJointMoveOn(ViSession vi, int name, int axi, float speed);</h3>
<div class="outline-text-3" id="text-2-81">
<p>
控制机器人某一个轴持续运动
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
axi :轴索引
</p>

<p>
speed: 轴运行的速度,单位: 度/秒
</p>

<p>
wavetable : 波表
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org8ab301b" class="outline-3">
<h3 id="org8ab301b"><span class="section-number-3">2.82</span> int mrgGetRobotJointAngle(ViSession vi, int name, int joint, float *angle);</h3>
<div class="outline-text-3" id="text-2-82">
<p>
获取机器人各关节的当前角度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
joint:指定机器人的关节索引. 0表示第一个关节(对T4来说,0指的是基座, 对H2来说,0指的是左边的关节). 如果为-1,则表示获取所有的关节
</p>

<p>
返回值：大于零,表示返回的关节角度个数, 否则,出错
</p>

<p>
说明: angle 是不安全的,请确保外部分配足够的空间给angle
</p>
</div>
</div>



<div id="outline-container-org2ef76c7" class="outline-3">
<h3 id="org2ef76c7"><span class="section-number-3">2.83</span> int mrgGetRobotCurrentMileage(ViSession vi, int name, float <b>x, float *y, float</b> z);</h3>
<div class="outline-text-3" id="text-2-83">
<p>
机器人当前的里程数，单位 ：米
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
x,y,z ：各坐标轴方向上的里程
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org69a5690" class="outline-3">
<h3 id="org69a5690"><span class="section-number-3">2.84</span> int mrgGetRobotTargetPosition(ViSession vi, int name, float <b>x, float *y, float</b> z);</h3>
<div class="outline-text-3" id="text-2-84">
<p>
获取机器人的目标位置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
x,y,z ：各坐标轴方向上的点
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>
</div>
</div>



<div id="outline-container-org0c0d2d5" class="outline-3">
<h3 id="org0c0d2d5"><span class="section-number-3">2.85</span> int mrgGetRobotCurrentRecord(ViSession vi, int name, int *record);</h3>
<div class="outline-text-3" id="text-2-85">
<p>
获取机器人的当前执行的指令索引
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
x,y,z ：各坐标轴方向上的点
</p>

<p>
返回值：0表示执行成功， －1：表示执行失败
</p>

<p>
此命令只对H2有效！！！！！
</p>
</div>
</div>



<div id="outline-container-orgf80a569" class="outline-3">
<h3 id="orgf80a569"><span class="section-number-3">2.86</span> int mrgGetRobotWristPose(ViSession vi, int name, float *angle);</h3>
<div class="outline-text-3" id="text-2-86">
<p>
获取机器人腕关节的姿态角度(相对于90度的算法零位)
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
angle: 腕关节角度(垂直向下时为零)
</p>

<p>
返回值：零表示执行正确,-1表示执行错误
</p>
</div>
</div>



<div id="outline-container-orga90d4d3" class="outline-3">
<h3 id="orga90d4d3"><span class="section-number-3">2.87</span> int mrgSetRobotWristPose(ViSession vi, int name, float angle,float time,int timeout_ms);</h3>
<div class="outline-text-3" id="text-2-87">
<p>
控制机器人腕关节的姿态角度(相对于90度的算法零位)
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
wavetable: 波表
</p>

<p>
angle: 腕关节角度(垂直向下时为零)
</p>

<p>
speed: 速度
</p>

<p>
timeout_ms: 表示等待执行的超时时间. 如果为-1,表示不等待. 0表示无限等待. &gt;0 表示等待的超时时间. 单位:ms
</p>

<p>
返回值：零表示执行正确,-1表示执行错误
</p>
</div>
</div>



<div id="outline-container-org3561529" class="outline-3">
<h3 id="org3561529"><span class="section-number-3">2.88</span> int mrgSetRobotFold(ViSession vi, int name, float axi0, float axi1, float axi2, float axi3, int timeout);</h3>
<div class="outline-text-3" id="text-2-88">
<p>
机器人的折叠功能(包装位)
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
axi0 axi1,axi2,axi3：各轴相对于零点的角度值. axi0:基座; axi1:大臂;axi2:小臂;axi3:腕
</p>

<p>
timeout:正数表示等待超时时间, -1表示不等待,0表示无限等待
</p>

<p>
返回值：0表示执行成功， -1：表示执行失败
</p>

<p>
此命令只对T4有效!
</p>
</div>
</div>



<div id="outline-container-org80f3e2b" class="outline-3">
<h3 id="org80f3e2b"><span class="section-number-3">2.89</span> int mrgGetRobotFoldState(ViSession vi, int name);</h3>
<div class="outline-text-3" id="text-2-89">
<p>
获取机器人的折叠状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
返回值：1表示执行成功， 0：还要折叠中; 小于零表示执行出错
</p>

<p>
此命令只对T4有效！
</p>
</div>
</div>
</div>





<div id="outline-container-org02aa095" class="outline-2">
<h2 id="org02aa095"><span class="section-number-2">3</span> mrqdevice.h</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd86667b" class="outline-3">
<h3 id="orgd86667b"><span class="section-number-3">3.1</span> enum RUN_STATE</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_IDLE</td>
<td class="org-left">"IDLE"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_LOADING</td>
<td class="org-left">"LOADING"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_READY</td>
<td class="org-left">"READY"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_RUNNING</td>
<td class="org-left">"RUNNING"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_STOP</td>
<td class="org-left">"STOP"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_ERROR</td>
<td class="org-left">"ERROR"</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">RS_RESERVE</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>
</div>
</div>



<div id="outline-container-orgab55eda" class="outline-3">
<h3 id="orgab55eda"><span class="section-number-3">3.2</span> enum MT_STATE</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_POWERON</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_RESET</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_CALCING</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_CALCEND</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_STANDBY</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_RUNNING</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_ERROR</td>
<td class="org-right">6</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSTATE_RESERVE</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>
</div>
</div>



<div id="outline-container-org4b41285" class="outline-3">
<h3 id="org4b41285"><span class="section-number-3">3.3</span> enum MT_SWITCH</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSWITCH_RESET</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSWITCH_STOP</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSWITCH_RUN</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSWITCH_PREPARE</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">MTSWITCH_EMERGSTOP</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


</table>
</div>
</div>
