doc/CAPI.org
** int mrgMRQIdentify(ViSession vi, int name, int state);

   MRQ模块识别

   vi :visa设备句柄

   name：机器人

   state：识别状态

   返回值：0表示执行成功，－1表示失败



** int mrgGetMRQDioState(ViSession vi, int name, unsigned short *state);

   查询设备模块的IO 状态

   vi :visa设备句柄

   name :设备名称

   state : DIO state

   返回值：0表示执行成功，－1表示失败



** int mrgGetMRQGroup(ViSession vi, char *devList, unsigned int *groupID, int grouptype);

   将指定的设备分在一个组中

   vi :visa设备句柄

   devList :设备名称 "512,513,514"

   groupID : 组ID,由下层返回.

   grouptype: 0:GOUPID1, 1:GROUPID2

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionStateReport(ViSession vi, int name, int ch, int state);

   设置运行状态是否自动上报给微控器

   vi :visa设备句柄

   name：机器人

   ch：通道号

   state：状态

   返回值：0表示执行成功，－1表示失败

      

** int mrgMRQMotionStateReport_Query(ViSession vi, int name, int ch,int *state);

   查询上报状态

   vi :visa设备句柄

   name：机器人

   ch：通道号

   state:  0 ACTIVE 1 QUERY；

   返回值：0表示执行成功，－1表示失败

   

** int mrgMRQMotionRun(ViSession vi, int name, int ch, int wavetable);

   运行指定的波表

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引值，取值范围0~9

   返回值：0表示执行成功，－1表示失败

   

** int mrgMRQMotionRunState_Query(ViSession vi, int name, int ch, int wavetable, int*robotstate);

   查询运行状态

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引值，取值范围0~9

   robotstate:机器人的状态 0:IDLE; 1:LOADING;2:READY;3:RUNNING;4:STOP; 5:ERROR;

   返回值：0表示执行成功，－1表示失败

   

** int mrgMRQMotionWaitReady(ViSession vi, int name, int ch, int wavetable, int timeout_ms);

   等待当前设备指定通道的特定波表的ready状态（等待模块设备解算完成）

   vi :visa设备句柄

   name: 设备名称

   ch : 通道索引

   wavetable ：波表索引。不允许为空

   timeout_ms：等待超时时间。0表示无限等待。不允许小于零

   返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   

** int mrgMRQMotionWaitEnd(ViSession vi, int name, int ch, int wavetable, int timeout_ms);

   等待当前设备指定通道的特定波表的运行结束状态

   vi :visa设备句柄

   name: 设备名称

   ch : 通道索引

   wavetable ：波表索引。不允许为空

   timeout_ms：等待超时时间。0表示无限等待。不允许小于零

   返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时

   

** int mrgMRQMotionStop(ViSession vi, int name, int ch, int wavetable);

   停止指定的波表

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引值，取值范围0~9

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionTrigSource(ViSession vi, int name, int ch, int source);

   设置启动运行的触发源

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   source:触发源

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionTrigSource_Query(ViSession vi, int name, int ch, int *source);

   查询启动运行触发源

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   source:触发源 0:SOFTWARE 1:DIGITALIO 2:CAN 3:ALL

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionOffsetState(ViSession vi, int name, int ch, int state);

   设置电机未运动时发生位移是否上报给微控器

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   state:状态

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionOffsetState_Query(ViSession vi, int name, int ch, int *state);

   查询电机未运动时发生位移是否上报给微控器状态

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   state:状态  0:OFF ; 1: ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionOffsetValue_Query(ViSession vi, int name, int ch, float *distance);

   查询电机未运动时发生的位移

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   displace:位移

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionABCount_Query(ViSession vi, int name, int ch);

   查询增量编码器的AB相的计数值

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   返回值：AB相的计数值



** int mrgMRQMotionABCountClear(ViSession vi, int name, int ch);

   清空增量编码器的AB相的计数值

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionReverse(ViSession vi, int name, int state);

   设置电机是否反向

   vi :visa设备句柄

   name: 机器人名称

   state：是否反向

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotionReverse_Query(ViSession vi, int name,int *reverse);

   查询电机反向开关状态

   vi :visa设备句柄

   name: 机器人名称

   reverse: 0表示没有反向；1表示反向；

   返回值：0表示执行成功；－1表示失败



** int mrgMRQAdjust(ViSession vi, int name, int ch, int wavetable,float position, float time, int timeout_ms);

   微调

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   position:位置

   time : 移动到目标位置期望使用的时间

   timeout_ms:等待超时时间。-1表示不等待运行结束；0表示无限等待

   返回值：0表示执行成功，－1表示失败



** int mrgMRQClockSync(ViSession vi, char *name_list, float time);

   时钟同步

   vi :visa设备句柄

   name_list:设备名列表

   time:同步的时间

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorStepAngle(ViSession vi, int name, int ch, int stepangle);

   设置电机的步距角

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   stepangle:电机的步距角,0->1.8度，1->0.9度，2->15度 3->7.5度

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorStepAngle_Query(ViSession vi, int name, int ch, int *stepangle);

   查询电机的步距角

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   stepangle:电机的步距角,0->1.8度，1->0.9度，2->15度 3->7.5度

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorMotionType(ViSession vi, int name, int ch, int type);

   设置电机的运动类型

   vi :visa设备句柄

   name: 机器人名称

   ch ：通道号

   type:运动类型 0->旋转运动  1->直线运动

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorMotionType_Query(ViSession vi, int name, int ch, int *type);

   查询电机的运动类型

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   type:运动类型  0->旋转运动  1->直线运动

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorPositionUnit(ViSession vi, int name, int ch, int unit);

   设置电机运动时的单位

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   unit:电机运动时的单位;0:ANGLE 1:RADIAN 2:MILLIMETER

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorPositionUnit_Query(ViSession vi, int name, int ch, int *unit);

   查询电机运动时的单位

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   unit:电机运动时的单位;0:ANGLE 1:RADIAN 2:MILLIMETER

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorGearRatio(ViSession vi, int name, int ch, int a, int b);

   设置电机旋转运动时的速比

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   a:分子

   b:分母

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorGearRatio_Query(ViSession vi, int name, int ch, int *a, int *b);

   查询电机旋转运动时的速比

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   a:分子

   b:分母

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorLead(ViSession vi, int name, int ch, float millimeter);

   设置电机直线运动时的导程

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   millimeter:电机直线运动时的导程

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorLead_Query(ViSession vi, int name, int ch, float *millimeter);

   查询电机直线运动时的导程

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   millimeter:电机直线运动时的导程

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorSize(ViSession vi, int name, int ch, int size);

   设置电机的尺寸

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   size:电机的尺寸

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorSize_Query(ViSession vi, int name, int ch, int *size);

   查询电机的尺寸

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   size:电机的尺寸

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorVoltate(ViSession vi, int name, int ch, int volt);

   设置电机的额定电压

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   volt:电压值

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorVoltage_Query(ViSession vi, int name, int ch, int *volt);

   查询电机的额定电压

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   volt:电压值

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorCurrent(ViSession vi, int name, int ch, float current);

   设置电机的额定电流

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   current:额定电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQMotorCurrent_Query(ViSession vi, int name, int ch, float *current);

   查询电机的额定电流

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   current:额定电流

   返回值：0表示执行成功，－1表示失败



