doc/CAPI.html



<div id="outline-container-org610d471" class="outline-3">
<h3 id="org610d471"><span class="section-number-3">3.4</span> int mrgMRQIdentify(ViSession vi, int name, int state);</h3>
<div class="outline-text-3" id="text-3-4">
<p>
MRQ模块识别
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：机器人
</p>

<p>
state：识别状态
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgea7383b" class="outline-3">
<h3 id="orgea7383b"><span class="section-number-3">3.5</span> int mrgGetMRQDioState(ViSession vi, int name, unsigned short *state);</h3>
<div class="outline-text-3" id="text-3-5">
<p>
查询设备模块的IO 状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称
</p>

<p>
state : DIO state
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org92e30b0" class="outline-3">
<h3 id="org92e30b0"><span class="section-number-3">3.6</span> int mrgGetMRQGroup(ViSession vi, char *devList, unsigned int *groupID, int grouptype);</h3>
<div class="outline-text-3" id="text-3-6">
<p>
将指定的设备分在一个组中
</p>

<p>
vi :visa设备句柄
</p>

<p>
devList :设备名称 "512,513,514"
</p>

<p>
groupID : 组ID,由下层返回.
</p>

<p>
grouptype: 0:GOUPID1, 1:GROUPID2
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org837b05c" class="outline-3">
<h3 id="org837b05c"><span class="section-number-3">3.7</span> int mrgMRQMotionStateReport(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-7">
<p>
设置运行状态是否自动上报给微控器
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：机器人
</p>

<p>
ch：通道号
</p>

<p>
state：状态
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2ebf802" class="outline-3">
<h3 id="org2ebf802"><span class="section-number-3">3.8</span> int mrgMRQMotionStateReport_Query(ViSession vi, int name, int ch,int *state);</h3>
<div class="outline-text-3" id="text-3-8">
<p>
查询上报状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：机器人
</p>

<p>
ch：通道号
</p>

<p>
state:  0 ACTIVE 1 QUERY；
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org135b21f" class="outline-3">
<h3 id="org135b21f"><span class="section-number-3">3.9</span> int mrgMRQMotionRun(ViSession vi, int name, int ch, int wavetable);</h3>
<div class="outline-text-3" id="text-3-9">
<p>
运行指定的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引值，取值范围0~9
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgdb8e683" class="outline-3">
<h3 id="orgdb8e683"><span class="section-number-3">3.10</span> int mrgMRQMotionRunState_Query(ViSession vi, int name, int ch, int wavetable, int*robotstate);</h3>
<div class="outline-text-3" id="text-3-10">
<p>
查询运行状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引值，取值范围0~9
</p>

<p>
robotstate:机器人的状态 0:IDLE; 1:LOADING;2:READY;3:RUNNING;4:STOP; 5:ERROR;
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org90620bc" class="outline-3">
<h3 id="org90620bc"><span class="section-number-3">3.11</span> int mrgMRQMotionWaitReady(ViSession vi, int name, int ch, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-3-11">
<p>
等待当前设备指定通道的特定波表的ready状态（等待模块设备解算完成）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 设备名称
</p>

<p>
ch : 通道索引
</p>

<p>
wavetable ：波表索引。不允许为空
</p>

<p>
timeout_ms：等待超时时间。0表示无限等待。不允许小于零
</p>

<p>
返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-org66b2c1c" class="outline-3">
<h3 id="org66b2c1c"><span class="section-number-3">3.12</span> int mrgMRQMotionWaitEnd(ViSession vi, int name, int ch, int wavetable, int timeout_ms);</h3>
<div class="outline-text-3" id="text-3-12">
<p>
等待当前设备指定通道的特定波表的运行结束状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 设备名称
</p>

<p>
ch : 通道索引
</p>

<p>
wavetable ：波表索引。不允许为空
</p>

<p>
timeout_ms：等待超时时间。0表示无限等待。不允许小于零
</p>

<p>
返回值：0表示等待成功，－1：表示等待过程中出错，－2：表示运行状态出错；－3：表示等待超时
</p>
</div>
</div>



<div id="outline-container-orgb1299c5" class="outline-3">
<h3 id="orgb1299c5"><span class="section-number-3">3.13</span> int mrgMRQMotionStop(ViSession vi, int name, int ch, int wavetable);</h3>
<div class="outline-text-3" id="text-3-13">
<p>
停止指定的波表
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引值，取值范围0~9
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga5f2227" class="outline-3">
<h3 id="orga5f2227"><span class="section-number-3">3.14</span> int mrgMRQMotionTrigSource(ViSession vi, int name, int ch, int source);</h3>
<div class="outline-text-3" id="text-3-14">
<p>
设置启动运行的触发源
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
source:触发源
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org18616d7" class="outline-3">
<h3 id="org18616d7"><span class="section-number-3">3.15</span> int mrgMRQMotionTrigSource_Query(ViSession vi, int name, int ch, int *source);</h3>
<div class="outline-text-3" id="text-3-15">
<p>
查询启动运行触发源
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
source:触发源 0:SOFTWARE 1:DIGITALIO 2:CAN 3:ALL
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org291a926" class="outline-3">
<h3 id="org291a926"><span class="section-number-3">3.16</span> int mrgMRQMotionOffsetState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-16">
<p>
设置电机未运动时发生位移是否上报给微控器
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
state:状态
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4de632f" class="outline-3">
<h3 id="org4de632f"><span class="section-number-3">3.17</span> int mrgMRQMotionOffsetState_Query(ViSession vi, int name, int ch, int *state);</h3>
<div class="outline-text-3" id="text-3-17">
<p>
查询电机未运动时发生位移是否上报给微控器状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
state:状态  0:OFF ; 1: ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgb063086" class="outline-3">
<h3 id="orgb063086"><span class="section-number-3">3.18</span> int mrgMRQMotionOffsetValue_Query(ViSession vi, int name, int ch, float *distance);</h3>
<div class="outline-text-3" id="text-3-18">
<p>
查询电机未运动时发生的位移
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
displace:位移
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgf67a198" class="outline-3">
<h3 id="orgf67a198"><span class="section-number-3">3.19</span> int mrgMRQMotionABCount_Query(ViSession vi, int name, int ch);</h3>
<div class="outline-text-3" id="text-3-19">
<p>
查询增量编码器的AB相的计数值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
返回值：AB相的计数值
</p>
</div>
</div>



<div id="outline-container-orgcacc9be" class="outline-3">
<h3 id="orgcacc9be"><span class="section-number-3">3.20</span> int mrgMRQMotionABCountClear(ViSession vi, int name, int ch);</h3>
<div class="outline-text-3" id="text-3-20">
<p>
清空增量编码器的AB相的计数值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org901ea81" class="outline-3">
<h3 id="org901ea81"><span class="section-number-3">3.21</span> int mrgMRQMotionReverse(ViSession vi, int name, int state);</h3>
<div class="outline-text-3" id="text-3-21">
<p>
设置电机是否反向
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
state：是否反向
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga9d6c46" class="outline-3">
<h3 id="orga9d6c46"><span class="section-number-3">3.22</span> int mrgMRQMotionReverse_Query(ViSession vi, int name,int *reverse);</h3>
<div class="outline-text-3" id="text-3-22">
<p>
查询电机反向开关状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
reverse: 0表示没有反向；1表示反向；
</p>

<p>
返回值：0表示执行成功；－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3a13a33" class="outline-3">
<h3 id="org3a13a33"><span class="section-number-3">3.23</span> int mrgMRQAdjust(ViSession vi, int name, int ch, int wavetable,float position, float time, int timeout_ms);</h3>
<div class="outline-text-3" id="text-3-23">
<p>
微调
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
position:位置
</p>

<p>
time : 移动到目标位置期望使用的时间
</p>

<p>
timeout_ms:等待超时时间。-1表示不等待运行结束；0表示无限等待
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org8469161" class="outline-3">
<h3 id="org8469161"><span class="section-number-3">3.24</span> int mrgMRQClockSync(ViSession vi, char *name_list, float time);</h3>
<div class="outline-text-3" id="text-3-24">
<p>
时钟同步
</p>

<p>
vi :visa设备句柄
</p>

<p>
name_list:设备名列表
</p>

<p>
time:同步的时间
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
