doc/CAPI.org
** int mrgMRQPVTCycle(ViSession vi, int name, int ch, int wavetable, unsigned int cycle);

   设置循环模式下，PVT的循环次数

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   cycle:循环次数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTCycle_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *cycle);

   查询循环模式下，PVT的循环次数

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   cycle:循环次数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTFifoBufferTime(ViSession vi, int name, int ch, int wavetable, unsigned int time);

   设置FIFO模式下，PVT的缓冲时间

   vi :visa设备句柄

   name: 设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   time:缓冲时间，单位：ms

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTFifoBufferTime_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *time);

   查询FIFO模式下，PVT的缓冲时间

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   time:缓冲时间，单位：ms

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeConfig_Query(ViSession vi, int name, int ch, int wavetable, int *exe, int *plan, int *motion);

   查询模式,包括执行模式,规划模式,运动模式

   vi :visa设备句柄

   name: 设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   exe:执行模式：0: CYCLE; 1: FIFO

   plan:轨迹规划方式：0: CUBICPOLY; 1:TRAPEZOID; 2:SCURVE

   motion:运动模式： 0: PVT; 1: LVT_CORRECT ; 2: LVT_NOCORRECT

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeConfig(ViSession vi, int name, int ch, int wavetable, int exe, int plan, int motion);

   设置模式,包括执行模式,规划模式,运动模式

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   exe:执行模式：0: CYCLE; 1: FIFO

   plan:轨迹规划方式：0: CUBICPOLY; 1:TRAPEZOID; 2:SCURVE

   motion:运动模式： 0: PVT; 1: LVT_CORRECT ; 2: LVT_NOCORRECT

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeExe(ViSession vi, int name, int ch, int wavetable, int mode);

   设置执行模式,循环或者FIFO

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   mode:执行模式  0－循环模式； 1：FIFO模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeExe_Query(ViSession vi, int name, int ch, int wavetable, int *mode);

   查询执行模式,循环或者FIFO

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   mode:执行模式; 0:循环模式；1：FIFO模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModePlan(ViSession vi, int name, int ch, int wavetable, int mode);

   设置规划模式:三次插值,线性插值,梯形插值,或五次插值

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   mode:规划模式  0 - 2  CUBICPOLY|TRAPEZOID｜SCURVE

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModePlan_Query(ViSession vi, int name, int ch, int wavetable, int *mode);

   查询规划模式:三次插值,线性插值,梯形插值,或五次插值

   vi :visa设备句柄

   name: 机器人名称

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   mode:规划模式 0 - 2  CUBICPOLY|TRAPEZOID｜SCURVE

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeMotion(ViSession vi, int name, int ch, int wavetable, int pattern);

   设置运动模式:PVT或者LVT

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   pattern:模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModeMotion_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);

   查询运动模式:PVT或者LVT

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   pattern:模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModifyDuty(ViSession vi, int name, int ch, int wavetable, int duty);

   设置LVT模式下进行时间调整的占比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   duty:占空比

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTModifyDuty_Query(ViSession vi, int name, int ch, int wavetable, int *duty);

   查询LVT模式下进行时间调整的占比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   duty:占空比

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTEndState(ViSession vi, int name, int ch, int wavetable, int pattern);

   设置是否为速度保持

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   pattern:模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTEndState_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);

   查询是否为速度保持

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   pattern:模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopMode(ViSession vi, int name, int ch, int wavetable, int type);

   设置急停方式,立即停止或者减速停止

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   type:急停方式;  0:立即停止；1：减速停止

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopMode_Query(ViSession vi, int name, int ch, int wavetable, int *mode);

   查询急停方式,立即停止或者减速停止

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   mode:急停方式,0:立即停止； 1：减速停止

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopTime(ViSession vi, int name, int ch, int wavetable, float time);

   设置急停时间

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   time:急停的时间

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopTime_Query(ViSession vi, int name, int ch, int wavetable, float *time);

   查询急停时间

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   time:急停的时间

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopDistance(ViSession vi, int name, int ch, int wavetable, float distance);

   设置减速停止时的减速距离

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   distance:减速距离

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTStopDistance_Query(ViSession vi, int name, int ch, int  wavetable, float *distance);

   查询减速停止时的减速距离

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   distance:减速距离

   返回值：0表示执行成功，－1表示失败



** int mrgMRQPVTWavetableAddress(ViSession vi, int name, int ch, int wavetable, unsigned int address);

   设置波表的起始地址

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8

   address:波表起始地址

   返回值：0表示执行成功，－1表示失败



