doc/CAPI.html



<div id="outline-container-orgf0243ed" class="outline-3">
<h3 id="orgf0243ed"><span class="section-number-3">3.53</span> int mrgMRQPVTCycle(ViSession vi, int name, int ch, int wavetable, unsigned int cycle);</h3>
<div class="outline-text-3" id="text-3-53">
<p>
设置循环模式下，PVT的循环次数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
cycle:循环次数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgfb917ab" class="outline-3">
<h3 id="orgfb917ab"><span class="section-number-3">3.54</span> int mrgMRQPVTCycle_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *cycle);</h3>
<div class="outline-text-3" id="text-3-54">
<p>
查询循环模式下，PVT的循环次数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
cycle:循环次数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga72ac10" class="outline-3">
<h3 id="orga72ac10"><span class="section-number-3">3.55</span> int mrgMRQPVTFifoBufferTime(ViSession vi, int name, int ch, int wavetable, unsigned int time);</h3>
<div class="outline-text-3" id="text-3-55">
<p>
设置FIFO模式下，PVT的缓冲时间
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
time:缓冲时间，单位：ms
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2596358" class="outline-3">
<h3 id="org2596358"><span class="section-number-3">3.56</span> int mrgMRQPVTFifoBufferTime_Query(ViSession vi, int name, int ch, int wavetable, unsigned int *time);</h3>
<div class="outline-text-3" id="text-3-56">
<p>
查询FIFO模式下，PVT的缓冲时间
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
time:缓冲时间，单位：ms
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgdd48a50" class="outline-3">
<h3 id="orgdd48a50"><span class="section-number-3">3.57</span> int mrgMRQPVTModeConfig_Query(ViSession vi, int name, int ch, int wavetable, int *exe, int *plan, int *motion);</h3>
<div class="outline-text-3" id="text-3-57">
<p>
查询模式,包括执行模式,规划模式,运动模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
exe:执行模式：0: CYCLE; 1: FIFO
</p>

<p>
plan:轨迹规划方式：0: CUBICPOLY; 1:TRAPEZOID; 2:SCURVE
</p>

<p>
motion:运动模式： 0: PVT; 1: LVT_CORRECT ; 2: LVT_NOCORRECT
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org51f63b2" class="outline-3">
<h3 id="org51f63b2"><span class="section-number-3">3.58</span> int mrgMRQPVTModeConfig(ViSession vi, int name, int ch, int wavetable, int exe, int plan, int motion);</h3>
<div class="outline-text-3" id="text-3-58">
<p>
设置模式,包括执行模式,规划模式,运动模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
exe:执行模式：0: CYCLE; 1: FIFO
</p>

<p>
plan:轨迹规划方式：0: CUBICPOLY; 1:TRAPEZOID; 2:SCURVE
</p>

<p>
motion:运动模式： 0: PVT; 1: LVT_CORRECT ; 2: LVT_NOCORRECT
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9fbd6dd" class="outline-3">
<h3 id="org9fbd6dd"><span class="section-number-3">3.59</span> int mrgMRQPVTModeExe(ViSession vi, int name, int ch, int wavetable, int mode);</h3>
<div class="outline-text-3" id="text-3-59">
<p>
设置执行模式,循环或者FIFO
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
mode:执行模式  0－循环模式； 1：FIFO模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1c5b6c6" class="outline-3">
<h3 id="org1c5b6c6"><span class="section-number-3">3.60</span> int mrgMRQPVTModeExe_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</h3>
<div class="outline-text-3" id="text-3-60">
<p>
查询执行模式,循环或者FIFO
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
mode:执行模式; 0:循环模式；1：FIFO模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org7781b20" class="outline-3">
<h3 id="org7781b20"><span class="section-number-3">3.61</span> int mrgMRQPVTModePlan(ViSession vi, int name, int ch, int wavetable, int mode);</h3>
<div class="outline-text-3" id="text-3-61">
<p>
设置规划模式:三次插值,线性插值,梯形插值,或五次插值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
mode:规划模式  0 - 2  CUBICPOLY|TRAPEZOID｜SCURVE
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgecc5108" class="outline-3">
<h3 id="orgecc5108"><span class="section-number-3">3.62</span> int mrgMRQPVTModePlan_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</h3>
<div class="outline-text-3" id="text-3-62">
<p>
查询规划模式:三次插值,线性插值,梯形插值,或五次插值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name: 机器人名称
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
mode:规划模式 0 - 2  CUBICPOLY|TRAPEZOID｜SCURVE
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org728539a" class="outline-3">
<h3 id="org728539a"><span class="section-number-3">3.63</span> int mrgMRQPVTModeMotion(ViSession vi, int name, int ch, int wavetable, int pattern);</h3>
<div class="outline-text-3" id="text-3-63">
<p>
设置运动模式:PVT或者LVT
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
pattern:模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9fb907c" class="outline-3">
<h3 id="org9fb907c"><span class="section-number-3">3.64</span> int mrgMRQPVTModeMotion_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);</h3>
<div class="outline-text-3" id="text-3-64">
<p>
查询运动模式:PVT或者LVT
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
pattern:模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org932ab2d" class="outline-3">
<h3 id="org932ab2d"><span class="section-number-3">3.65</span> int mrgMRQPVTModifyDuty(ViSession vi, int name, int ch, int wavetable, int duty);</h3>
<div class="outline-text-3" id="text-3-65">
<p>
设置LVT模式下进行时间调整的占比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
duty:占空比
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2e4b6de" class="outline-3">
<h3 id="org2e4b6de"><span class="section-number-3">3.66</span> int mrgMRQPVTModifyDuty_Query(ViSession vi, int name, int ch, int wavetable, int *duty);</h3>
<div class="outline-text-3" id="text-3-66">
<p>
查询LVT模式下进行时间调整的占比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
duty:占空比
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9aef87c" class="outline-3">
<h3 id="org9aef87c"><span class="section-number-3">3.67</span> int mrgMRQPVTEndState(ViSession vi, int name, int ch, int wavetable, int pattern);</h3>
<div class="outline-text-3" id="text-3-67">
<p>
设置是否为速度保持
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
pattern:模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4b169b0" class="outline-3">
<h3 id="org4b169b0"><span class="section-number-3">3.68</span> int mrgMRQPVTEndState_Query(ViSession vi, int name, int ch, int wavetable, int *pattern);</h3>
<div class="outline-text-3" id="text-3-68">
<p>
查询是否为速度保持
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
pattern:模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org0186f0f" class="outline-3">
<h3 id="org0186f0f"><span class="section-number-3">3.69</span> int mrgMRQPVTStopMode(ViSession vi, int name, int ch, int wavetable, int type);</h3>
<div class="outline-text-3" id="text-3-69">
<p>
设置急停方式,立即停止或者减速停止
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
type:急停方式;  0:立即停止；1：减速停止
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org0e48917" class="outline-3">
<h3 id="org0e48917"><span class="section-number-3">3.70</span> int mrgMRQPVTStopMode_Query(ViSession vi, int name, int ch, int wavetable, int *mode);</h3>
<div class="outline-text-3" id="text-3-70">
<p>
查询急停方式,立即停止或者减速停止
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
wavetable:波表索引，取值范围： 0~9 MAIN|SMALL|P1|P2|P3|P4|P5|P6|P7|P8
</p>

<p>
mode:急停方式,0:立即停止； 1：减速停止
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
