doc/CAPI.org
** int mrgMRQReportData_Query(ViSession vi, int name, int ch, int index, unsigned int *data);

   查询自动上报数据

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   index:上报数据类型： TORQUE（能效曲线的百分比）、 CYCLE（循环模式下的循环次数）、 SGALL、SGSE 或 DIST（测距传感器的值）

   返回值：返回读取到的数据个数



** int mrgMRQReportQueue_Query(ViSession vi, int name, int ch, int func, unsigned int *data);

   查询自动上报数据队列中的数据

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   func: 0 ~ 5 TORQUE|CYCLE|SGALL|SGSE|DIST|ABSEN

   data : 返回数据的存储区

   返回值：实际返回的数据个数



** int mrgMRQTriggerMode(ViSession vi, int name, int ch, int mode);

   设置触发输入的模式,码型触发或电平触发

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   mode:触发输入的模式

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerMode_Query(ViSession vi, int name, int ch, int *mode);

   查询触发输入的模式,码型触发或电平触发

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   mode:触发输入的模式. 0:码型触发；1：电平触发

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelConfig_Query(ViSession vi, int name, int ch, int trig, int *state, int *type, float *period, int *response);

   查询电平触发配置

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   state:开关状态

   type:触发类型，0：无类型；1：上升沿；2；低电平；3：下降沿；4：高电平

   period:采样周期，单位：s

   response:触动触发后的反应 0：NONE，1：ALARM;2:STOP ;3:ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelConfig(ViSession vi, int name, int ch, int trig, int state, int type, float period, int response);

   设置电平触发配置

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   state:开关状态

   type:触发类型，0：无类型；1：上升沿；2；低电平；3：下降沿；4：高电平

   period:采样周期，单位：s

   response:触动触发后的反应 0：NONE，1：ALARM;2:STOP ;3:ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelState(ViSession vi, int name, int ch, int trig, int state);

   设置电平触发，打开或关闭

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   state:状态  0表示禁止；1表示使能

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelState_Query(ViSession vi, int name, int ch, int trig, int *state);

   查询电平触发，打开或关闭

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   state:状态. 0表示禁止；1表示使能

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelType(ViSession vi, int name, int ch, int trig, int type);

   设置触发电平类型

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   type:电平触发类型： RESERVE|LOW|RISE|FALL|HIGH

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelType_Query(ViSession vi, int name, int ch, int trig, int *type);

   查询触发电平类型

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   type:电平触发类型： 0:RESERVE; 1:LOW; 2: RISE; 3:FALL;4:HIGH

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelResponse(ViSession vi, int name, int ch, int trig, int resp);

   设置触发电平响应

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   resp:电平触发的响应方式： NONE|ALARM|STOP|ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelResponse_Query(ViSession vi, int name, int ch, int trig,int *resp);

   查询触发电平响应

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   resp:电平触发的响应方式：0: NONE; 1:ALARM;2:STOP; 3:ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelPeriod(ViSession vi, int name, int ch, int trig, float period);

   设置触发电平采样周期

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   period:采样周期,单位：s

   返回值：0表示执行成功，－1表示失败



** int mrgMRQTriggerLevelPeriod_Query(ViSession vi, int name, int ch, int trig, float *period);

   查询触发电平采样周期

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   trig:电平触发编号： TRIGL 或 TRIGR

   period:采样周期,单位：s

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverConfig_Query(ViSession vi, int name, int ch, int *state, int *microstep, float*current);

   查询驱动板配置

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:开关状态。 0：禁止；1：使能

   microstep:微步 256,128,64,32,16,8,4,2,1

   current:驱动器的驱动电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverConfig(ViSession vi, int name, int ch, int state, int microstep, float current);

   设置驱动板配置

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:开关状态。 0：禁止；1：使能

   microstep:微步

   current:驱动器的驱动电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverType_Query(ViSession vi, int name, int ch, int *type);

   查询驱动板类型

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   type:驱动板的类型 0:D17  1：D23

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverCurrent(ViSession vi, int name, int ch, float current);

   设置驱动板电流

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   current:驱动板电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverCurrent_Query(ViSession vi, int name, int ch, float *current);

   查询驱动板电流

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   current:驱动板电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverIdleCurrent(ViSession vi, int name, int ch, float current);

   设置驱动板空闲电流

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   current:驱动板空闲电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverIdleCurrent_Query(ViSession vi, int name, int ch, float *current);

   查询驱动板空闲电流

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   current:驱动板空闲电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverMicroStep(ViSession vi, int name, int ch, int microstep);

   设置电机微步数

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   microstep:电机的微步数 256,128,64,32,16,8,4,2,1

   返回值：0表示执行成功，－1表示失败



