doc/CAPI.html



<div id="outline-container-org8868c52" class="outline-3">
<h3 id="org8868c52"><span class="section-number-3">3.88</span> int mrgMRQReportConfig(ViSession vi, int name, int ch, int funs, int state, float period);</h3>
<div class="outline-text-3" id="text-3-88">
<p>
设置上报功能配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
funs:功能
</p>

<p>
state:状态onoff
</p>

<p>
period:指定类型数据的上报周期
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4a7eb11" class="outline-3">
<h3 id="org4a7eb11"><span class="section-number-3">3.89</span> int mrgMRQReportState(ViSession vi, int name, int ch, int funs, int state);</h3>
<div class="outline-text-3" id="text-3-89">
<p>
设置上报状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
funs:功能
</p>

<p>
state:状态onoff
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org0c3ccdb" class="outline-3">
<h3 id="org0c3ccdb"><span class="section-number-3">3.90</span> int mrgMRQReportState_Query(ViSession vi, int name, int ch, int funs, int *state);</h3>
<div class="outline-text-3" id="text-3-90">
<p>
查询上报状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
funs:功能
</p>

<p>
state1状态onoff
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgccc0ea3" class="outline-3">
<h3 id="orgccc0ea3"><span class="section-number-3">3.91</span> int mrgMRQReportPeriod(ViSession vi, int name, int ch, int funs, int period);</h3>
<div class="outline-text-3" id="text-3-91">
<p>
设置上报周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
funs:功能
</p>

<p>
period:指定类型数据的上报周期,单位：ms
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org690a7d5" class="outline-3">
<h3 id="org690a7d5"><span class="section-number-3">3.92</span> int mrgMRQReportPeriod_Query(ViSession vi, int name, int ch, int funs, int *period);</h3>
<div class="outline-text-3" id="text-3-92">
<p>
查询上报周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
funs:功能
</p>

<p>
period:指定类型数据的上报周期,单位：ms
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org298f5ee" class="outline-3">
<h3 id="org298f5ee"><span class="section-number-3">3.93</span> int mrgMRQReportData_Query(ViSession vi, int name, int ch, int index, unsigned int *data);</h3>
<div class="outline-text-3" id="text-3-93">
<p>
查询自动上报数据
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
index:上报数据类型： TORQUE（能效曲线的百分比）、 CYCLE（循环模式下的循环次数）、 SGALL、SGSE 或 DIST（测距传感器的值）
</p>

<p>
返回值：返回读取到的数据个数
</p>
</div>
</div>



<div id="outline-container-org48bf03f" class="outline-3">
<h3 id="org48bf03f"><span class="section-number-3">3.94</span> int mrgMRQReportQueue_Query(ViSession vi, int name, int ch, int func, unsigned int *data);</h3>
<div class="outline-text-3" id="text-3-94">
<p>
查询自动上报数据队列中的数据
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
func: 0 ~ 5 TORQUE|CYCLE|SGALL|SGSE|DIST|ABSEN
</p>

<p>
data : 返回数据的存储区
</p>

<p>
返回值：实际返回的数据个数
</p>
</div>
</div>



<div id="outline-container-orgf244434" class="outline-3">
<h3 id="orgf244434"><span class="section-number-3">3.95</span> int mrgMRQTriggerMode(ViSession vi, int name, int ch, int mode);</h3>
<div class="outline-text-3" id="text-3-95">
<p>
设置触发输入的模式,码型触发或电平触发
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
mode:触发输入的模式
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2e52517" class="outline-3">
<h3 id="org2e52517"><span class="section-number-3">3.96</span> int mrgMRQTriggerMode_Query(ViSession vi, int name, int ch, int *mode);</h3>
<div class="outline-text-3" id="text-3-96">
<p>
查询触发输入的模式,码型触发或电平触发
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
mode:触发输入的模式. 0:码型触发；1：电平触发
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga929829" class="outline-3">
<h3 id="orga929829"><span class="section-number-3">3.97</span> int mrgMRQTriggerLevelConfig_Query(ViSession vi, int name, int ch, int trig, int *state, int *type, float *period, int *response);</h3>
<div class="outline-text-3" id="text-3-97">
<p>
查询电平触发配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
state:开关状态
</p>

<p>
type:触发类型，0：无类型；1：上升沿；2；低电平；3：下降沿；4：高电平
</p>

<p>
period:采样周期，单位：s
</p>

<p>
response:触动触发后的反应 0：NONE，1：ALARM;2:STOP ;3:ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgc1c3a31" class="outline-3">
<h3 id="orgc1c3a31"><span class="section-number-3">3.98</span> int mrgMRQTriggerLevelConfig(ViSession vi, int name, int ch, int trig, int state, int type, float period, int response);</h3>
<div class="outline-text-3" id="text-3-98">
<p>
设置电平触发配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
state:开关状态
</p>

<p>
type:触发类型，0：无类型；1：上升沿；2；低电平；3：下降沿；4：高电平
</p>

<p>
period:采样周期，单位：s
</p>

<p>
response:触动触发后的反应 0：NONE，1：ALARM;2:STOP ;3:ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org319742f" class="outline-3">
<h3 id="org319742f"><span class="section-number-3">3.99</span> int mrgMRQTriggerLevelState(ViSession vi, int name, int ch, int trig, int state);</h3>
<div class="outline-text-3" id="text-3-99">
<p>
设置电平触发，打开或关闭
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
state:状态  0表示禁止；1表示使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge9ce70e" class="outline-3">
<h3 id="orge9ce70e"><span class="section-number-3">3.100</span> int mrgMRQTriggerLevelState_Query(ViSession vi, int name, int ch, int trig, int *state);</h3>
<div class="outline-text-3" id="text-3-100">
<p>
查询电平触发，打开或关闭
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
state:状态. 0表示禁止；1表示使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org02d9535" class="outline-3">
<h3 id="org02d9535"><span class="section-number-3">3.101</span> int mrgMRQTriggerLevelType(ViSession vi, int name, int ch, int trig, int type);</h3>
<div class="outline-text-3" id="text-3-101">
<p>
设置触发电平类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
type:电平触发类型： RESERVE|LOW|RISE|FALL|HIGH
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge67c6ab" class="outline-3">
<h3 id="orge67c6ab"><span class="section-number-3">3.102</span> int mrgMRQTriggerLevelType_Query(ViSession vi, int name, int ch, int trig, int *type);</h3>
<div class="outline-text-3" id="text-3-102">
<p>
查询触发电平类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
type:电平触发类型： 0:RESERVE; 1:LOW; 2: RISE; 3:FALL;4:HIGH
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgc830859" class="outline-3">
<h3 id="orgc830859"><span class="section-number-3">3.103</span> int mrgMRQTriggerLevelResponse(ViSession vi, int name, int ch, int trig, int resp);</h3>
<div class="outline-text-3" id="text-3-103">
<p>
设置触发电平响应
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
resp:电平触发的响应方式： NONE|ALARM|STOP|ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgeb685c8" class="outline-3">
<h3 id="orgeb685c8"><span class="section-number-3">3.104</span> int mrgMRQTriggerLevelResponse_Query(ViSession vi, int name, int ch, int trig,int *resp);</h3>
<div class="outline-text-3" id="text-3-104">
<p>
查询触发电平响应
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
resp:电平触发的响应方式：0: NONE; 1:ALARM;2:STOP; 3:ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org0a7a078" class="outline-3">
<h3 id="org0a7a078"><span class="section-number-3">3.105</span> int mrgMRQTriggerLevelPeriod(ViSession vi, int name, int ch, int trig, float period);</h3>
<div class="outline-text-3" id="text-3-105">
<p>
设置触发电平采样周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
period:采样周期,单位：s
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgb93bbcb" class="outline-3">
<h3 id="orgb93bbcb"><span class="section-number-3">3.106</span> int mrgMRQTriggerLevelPeriod_Query(ViSession vi, int name, int ch, int trig, float *period);</h3>
<div class="outline-text-3" id="text-3-106">
<p>
查询触发电平采样周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
trig:电平触发编号： TRIGL 或 TRIGR
</p>

<p>
period:采样周期,单位：s
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org97343eb" class="outline-3">
<h3 id="org97343eb"><span class="section-number-3">3.107</span> int mrgMRQDriverConfig_Query(ViSession vi, int name, int ch, int *state, int *microstep, float*current);</h3>
<div class="outline-text-3" id="text-3-107">
<p>
查询驱动板配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:开关状态。 0：禁止；1：使能
</p>

<p>
microstep:微步 256,128,64,32,16,8,4,2,1
</p>

<p>
current:驱动器的驱动电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge836d81" class="outline-3">
<h3 id="orge836d81"><span class="section-number-3">3.108</span> int mrgMRQDriverConfig(ViSession vi, int name, int ch, int state, int microstep, float current);</h3>
<div class="outline-text-3" id="text-3-108">
<p>
设置驱动板配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:开关状态。 0：禁止；1：使能
</p>

<p>
microstep:微步
</p>

<p>
current:驱动器的驱动电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgcbe5c8c" class="outline-3">
<h3 id="orgcbe5c8c"><span class="section-number-3">3.109</span> int mrgMRQDriverType_Query(ViSession vi, int name, int ch, int *type);</h3>
<div class="outline-text-3" id="text-3-109">
<p>
查询驱动板类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
type:驱动板的类型 0:D17  1：D23
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
