doc/CAPI.org
** int mrgMRQDriverMicroStep_Query(ViSession vi, int name, int ch, int *microstep);

   查询电机微步数

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   microstep:电机的微步数 256,128,64,32,16,8,4,2,1

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverState(ViSession vi, int name, int ch, int state);

   设置驱动开关状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态onoff  0:OFF; 1:ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverState_Query(ViSession vi, int name, int ch, int *state);

   查询驱动开关状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state1:状态onoff

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverRegisterValue(ViSession vi, int name, int ch, int regIndex, unsigned int value);

   设置驱动的寄存器值

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   regIndex： 寄存器地址

   value:寄存器值

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverRegisterValue_Query(ViSession vi, int name, int ch, int regIndex, unsigned int *value);

   查询驱动的寄存器值

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   regIndex： 寄存器地址

   value:寄存器值

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningState(ViSession vi, int name, int ch, int state);

   设置驱动器TUNING功能的开关状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:开关状态 0：OFF；1：ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningState_Query(ViSession vi, int name, int ch, int *state);

   查询驱动器TUNING功能的开关状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:开关状态 0：OFF；1：ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningMinCurrent(ViSession vi, int name, int ch, int ratio);

   设置驱动器TUNING功能的最小电流比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   ratio:最小电流比 0：12；1：14

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningMinCurrent_Query(ViSession vi, int name, int ch, int *ratio);

   查询驱动器TUNING功能的最小电流比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   ratio:最小电流比 0：12；1：14

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningCurrentRegulate(ViSession vi, int name, int ch, int speedUp, int speedDown);

   设置驱动器TUNING功能的电流上升和下降速度

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   speedUp:电流上升速度 0：表示每整步增加一个单位的电流；

   ：表示每整步增加两个单位的电流

   ：表示每整步增加4个单位的电流

   ：表示每整步增加8个单位的电流

   speedDown：电流下降速度  0：表示每32整步减小一个单位的电流；

   ：表示每8整步减小一个单位的电流；

   ：表示每2整步减小一个单位的电流；

   ：表示每1整步减小一个单位的电流；

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDriverTuningCurrentRegulate_Query(ViSession vi, int name, int ch, int *speedUp, int *speedDown);

   查询驱动器TUNING功能的电流上升和下降速度

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   speedUp:电流上升速度 0：表示每整步增加一个单位的电流；

   ：表示每整步增加两个单位的电流

   ：表示每整步增加4个单位的电流

   ：表示每整步增加8个单位的电流

   speedDown：电流下降速度  0：表示每32整步减小一个单位的电流；

   ：表示每8整步减小一个单位的电流；

   ：表示每2整步减小一个单位的电流；

   ：表示每1整步减小一个单位的电流；

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderConfig_Query(ViSession vi, int name, int ch,int *state, int *type, int *lineNum, int *chanNum);

   查询编码器的状态,类型,线数及通道个数.状态为OFF时,后面的参数可以省略

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态  0:OFF;  1：ON

   type:编码器的类型： 0:INCREMENTAL 或 1: ABSOLUTE

   linenum:增量型编码器光电码盘一周的线数： 500、 1000、 1024、 2000、 2048、 4000、 4096 或 5000

   channelnum:增量型编码器的通道数： 1 或 3

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderConfig(ViSession vi, int name, int ch,int state, int type, int linenum, int channelnum);

   设置编码器的状态,类型,线数及通道个数.状态为OFF时,后面的参数可以省略

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态  0:OFF;  1：ON

   type:编码器的类型： 0:INCREMENTAL 或 1: ABSOLUTE

   linenum:增量型编码器光电码盘一周的线数： 500、 1000、 1024、 2000、 2048、 4000、 4096 或 5000

   channelnum:增量型编码器的通道数： 1 或 3

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderLineNum(ViSession vi, int name, int ch, int num);

   设置编码器线数

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   num:编码器线数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderLineNum_Query(ViSession vi, int name, int ch, int *num);

   查询编码器线数

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   num:编码器线数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderChannelNum(ViSession vi, int name, int ch, int channelnum);

   设置编码器通道

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   channelnum:增量型编码器的通道数： 1 或 3

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderChannelNum_Query(ViSession vi, int name, int ch, int *channelnum);

   查询编码器通道

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   channelnum:增量型编码器的通道数： 1 或 3

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderType(ViSession vi, int name, int ch, int type);

   设置编码器类型

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   type:编码器的类型： INCREMENTAL 或 ABSOLUTE

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderType_Query(ViSession vi, int name, int ch, int *type);

   查询编码器类型

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   type:编码器的类型： 0:INCREMENTAL 或 1:ABSOLUTE

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderMultiple(ViSession vi, int name, int ch, int multiple);

   设置编码器信号的倍乘

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   multiple:倍乘

   返回值：0表示执行成功，－1表示失败



