doc/CAPI.html



<div id="outline-container-org563c198" class="outline-3">
<h3 id="org563c198"><span class="section-number-3">3.110</span> int mrgMRQDriverCurrent(ViSession vi, int name, int ch, float current);</h3>
<div class="outline-text-3" id="text-3-110">
<p>
设置驱动板电流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
current:驱动板电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org28057e1" class="outline-3">
<h3 id="org28057e1"><span class="section-number-3">3.111</span> int mrgMRQDriverCurrent_Query(ViSession vi, int name, int ch, float *current);</h3>
<div class="outline-text-3" id="text-3-111">
<p>
查询驱动板电流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
current:驱动板电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orga70d121" class="outline-3">
<h3 id="orga70d121"><span class="section-number-3">3.112</span> int mrgMRQDriverIdleCurrent(ViSession vi, int name, int ch, float current);</h3>
<div class="outline-text-3" id="text-3-112">
<p>
设置驱动板空闲电流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
current:驱动板空闲电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orged3c14b" class="outline-3">
<h3 id="orged3c14b"><span class="section-number-3">3.113</span> int mrgMRQDriverIdleCurrent_Query(ViSession vi, int name, int ch, float *current);</h3>
<div class="outline-text-3" id="text-3-113">
<p>
查询驱动板空闲电流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
current:驱动板空闲电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgdd03742" class="outline-3">
<h3 id="orgdd03742"><span class="section-number-3">3.114</span> int mrgMRQDriverMicroStep(ViSession vi, int name, int ch, int microstep);</h3>
<div class="outline-text-3" id="text-3-114">
<p>
设置电机微步数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
microstep:电机的微步数 256,128,64,32,16,8,4,2,1
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4728456" class="outline-3">
<h3 id="org4728456"><span class="section-number-3">3.115</span> int mrgMRQDriverMicroStep_Query(ViSession vi, int name, int ch, int *microstep);</h3>
<div class="outline-text-3" id="text-3-115">
<p>
查询电机微步数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
microstep:电机的微步数 256,128,64,32,16,8,4,2,1
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org59d907b" class="outline-3">
<h3 id="org59d907b"><span class="section-number-3">3.116</span> int mrgMRQDriverState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-116">
<p>
设置驱动开关状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态onoff  0:OFF; 1:ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org21c00ce" class="outline-3">
<h3 id="org21c00ce"><span class="section-number-3">3.117</span> int mrgMRQDriverState_Query(ViSession vi, int name, int ch, int *state);</h3>
<div class="outline-text-3" id="text-3-117">
<p>
查询驱动开关状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state1:状态onoff
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org850048c" class="outline-3">
<h3 id="org850048c"><span class="section-number-3">3.118</span> int mrgMRQDriverRegisterValue(ViSession vi, int name, int ch, int regIndex, unsigned int value);</h3>
<div class="outline-text-3" id="text-3-118">
<p>
设置驱动的寄存器值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
regIndex： 寄存器地址
</p>

<p>
value:寄存器值
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1ca917d" class="outline-3">
<h3 id="org1ca917d"><span class="section-number-3">3.119</span> int mrgMRQDriverRegisterValue_Query(ViSession vi, int name, int ch, int regIndex, unsigned int *value);</h3>
<div class="outline-text-3" id="text-3-119">
<p>
查询驱动的寄存器值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
regIndex： 寄存器地址
</p>

<p>
value:寄存器值
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9ab7adc" class="outline-3">
<h3 id="org9ab7adc"><span class="section-number-3">3.120</span> int mrgMRQDriverTuningState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-120">
<p>
设置驱动器TUNING功能的开关状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:开关状态 0：OFF；1：ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org465d65d" class="outline-3">
<h3 id="org465d65d"><span class="section-number-3">3.121</span> int mrgMRQDriverTuningState_Query(ViSession vi, int name, int ch, int *state);</h3>
<div class="outline-text-3" id="text-3-121">
<p>
查询驱动器TUNING功能的开关状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:开关状态 0：OFF；1：ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org655f72c" class="outline-3">
<h3 id="org655f72c"><span class="section-number-3">3.122</span> int mrgMRQDriverTuningMinCurrent(ViSession vi, int name, int ch, int ratio);</h3>
<div class="outline-text-3" id="text-3-122">
<p>
设置驱动器TUNING功能的最小电流比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
ratio:最小电流比 0：12；1：14
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2c4a3ad" class="outline-3">
<h3 id="org2c4a3ad"><span class="section-number-3">3.123</span> int mrgMRQDriverTuningMinCurrent_Query(ViSession vi, int name, int ch, int *ratio);</h3>
<div class="outline-text-3" id="text-3-123">
<p>
查询驱动器TUNING功能的最小电流比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
ratio:最小电流比 0：12；1：14
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgc4ba7a0" class="outline-3">
<h3 id="orgc4ba7a0"><span class="section-number-3">3.124</span> int mrgMRQDriverTuningCurrentRegulate(ViSession vi, int name, int ch, int speedUp, int speedDown);</h3>
<div class="outline-text-3" id="text-3-124">
<p>
设置驱动器TUNING功能的电流上升和下降速度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
speedUp:电流上升速度 0：表示每整步增加一个单位的电流；
</p>

<p>
：表示每整步增加两个单位的电流
</p>

<p>
：表示每整步增加4个单位的电流
</p>

<p>
：表示每整步增加8个单位的电流
</p>

<p>
speedDown：电流下降速度  0：表示每32整步减小一个单位的电流；
</p>

<p>
：表示每8整步减小一个单位的电流；
</p>

<p>
：表示每2整步减小一个单位的电流；
</p>

<p>
：表示每1整步减小一个单位的电流；
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge762e32" class="outline-3">
<h3 id="orge762e32"><span class="section-number-3">3.125</span> int mrgMRQDriverTuningCurrentRegulate_Query(ViSession vi, int name, int ch, int *speedUp, int *speedDown);</h3>
<div class="outline-text-3" id="text-3-125">
<p>
查询驱动器TUNING功能的电流上升和下降速度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
speedUp:电流上升速度 0：表示每整步增加一个单位的电流；
</p>

<p>
：表示每整步增加两个单位的电流
</p>

<p>
：表示每整步增加4个单位的电流
</p>

<p>
：表示每整步增加8个单位的电流
</p>

<p>
speedDown：电流下降速度  0：表示每32整步减小一个单位的电流；
</p>

<p>
：表示每8整步减小一个单位的电流；
</p>

<p>
：表示每2整步减小一个单位的电流；
</p>

<p>
：表示每1整步减小一个单位的电流；
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org887ae72" class="outline-3">
<h3 id="org887ae72"><span class="section-number-3">3.126</span> int mrgMRQEncoderConfig_Query(ViSession vi, int name, int ch,int *state, int *type, int *lineNum, int *chanNum);</h3>
<div class="outline-text-3" id="text-3-126">
<p>
查询编码器的状态,类型,线数及通道个数.状态为OFF时,后面的参数可以省略
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态  0:OFF;  1：ON
</p>

<p>
type:编码器的类型： 0:INCREMENTAL 或 1: ABSOLUTE
</p>

<p>
linenum:增量型编码器光电码盘一周的线数： 500、 1000、 1024、 2000、 2048、 4000、 4096 或 5000
</p>

<p>
channelnum:增量型编码器的通道数： 1 或 3
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4a440ed" class="outline-3">
<h3 id="org4a440ed"><span class="section-number-3">3.127</span> int mrgMRQEncoderConfig(ViSession vi, int name, int ch,int state, int type, int linenum, int channelnum);</h3>
<div class="outline-text-3" id="text-3-127">
<p>
设置编码器的状态,类型,线数及通道个数.状态为OFF时,后面的参数可以省略
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态  0:OFF;  1：ON
</p>

<p>
type:编码器的类型： 0:INCREMENTAL 或 1: ABSOLUTE
</p>

<p>
linenum:增量型编码器光电码盘一周的线数： 500、 1000、 1024、 2000、 2048、 4000、 4096 或 5000
</p>

<p>
channelnum:增量型编码器的通道数： 1 或 3
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org12418a8" class="outline-3">
<h3 id="org12418a8"><span class="section-number-3">3.128</span> int mrgMRQEncoderLineNum(ViSession vi, int name, int ch, int num);</h3>
<div class="outline-text-3" id="text-3-128">
<p>
设置编码器线数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
num:编码器线数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9e23660" class="outline-3">
<h3 id="org9e23660"><span class="section-number-3">3.129</span> int mrgMRQEncoderLineNum_Query(ViSession vi, int name, int ch, int *num);</h3>
<div class="outline-text-3" id="text-3-129">
<p>
查询编码器线数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
num:编码器线数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1eadaf0" class="outline-3">
<h3 id="org1eadaf0"><span class="section-number-3">3.130</span> int mrgMRQEncoderChannelNum(ViSession vi, int name, int ch, int channelnum);</h3>
<div class="outline-text-3" id="text-3-130">
<p>
设置编码器通道
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
channelnum:增量型编码器的通道数： 1 或 3
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge683821" class="outline-3">
<h3 id="orge683821"><span class="section-number-3">3.131</span> int mrgMRQEncoderChannelNum_Query(ViSession vi, int name, int ch, int *channelnum);</h3>
<div class="outline-text-3" id="text-3-131">
<p>
查询编码器通道
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
channelnum:增量型编码器的通道数： 1 或 3
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1316721" class="outline-3">
<h3 id="org1316721"><span class="section-number-3">3.132</span> int mrgMRQEncoderType(ViSession vi, int name, int ch, int type);</h3>
<div class="outline-text-3" id="text-3-132">
<p>
设置编码器类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
type:编码器的类型： INCREMENTAL 或 ABSOLUTE
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
