doc/CAPI.org
** int mrgMRQEncoderMultiple_Query(ViSession vi, int name, int ch, int *multiple);

   查询编码器信号的倍乘

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   multiple:倍乘 0 - 2 "SINGLE","DOUBLE","QUADRUPLE"

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderState(ViSession vi, int name, int ch, int state);

   设置编码器状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:编码器的状态：0: NONE;1: OFF ; 2:ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderState_Query(ViSession vi, int name, int ch, int*state);

   查询编码器状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state1:编码器的状态： 0:NONE; 1:OFF ;2: ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderFeedback(ViSession vi, int name, int ch, int value);

   设置LVT模式下编码器反馈比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   feed:编码器反馈比

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderFeedback_Query(ViSession vi, int name, int ch, int *value);

   查询LVT模式下编码器反馈比

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   feed:编码器反馈比

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderDirection(ViSession vi, int name, int ch, int value);

   设置编码器方向

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器方向。0表示编码器逆时针转动，数值增加；1表示编码器逆时针转，数据减小

   返回值：0表示执行成功，－1表示失败



** int mrgMRQEncoderDirection_Query(ViSession vi, int name, int ch, int *value);

   查询编码器方向

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器方向。0表示编码器逆时针转动，数值增加；1表示编码器逆时针转，数据减小

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmState(ViSession vi, int name, int ch, int state);

   设置绝对值编码器的报警状态

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   state:编码器报警状态 0:OFF; 1:ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmState_Query(ViSession vi, int name, int ch, int *state);

   查询绝对值编码器的报警状态

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   state:编码器报警状态 0:OFF; 1:ON

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmUpLimit(ViSession vi, int name, int ch, int value);

   设置绝对值编码器的报警上限

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器报警上限值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmUpLimit_Query(ViSession vi, int name, int ch, int *value);

   查绝对值编码器的报警上限

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器报警上限值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmDownLimit(ViSession vi, int name, int ch, int value);

   设置绝对值编码器的报警下限

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器报警下限值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmDownLimit_Query(ViSession vi, int name, int ch, int *value);

   查绝对值编码器的报警下限

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器报警下限值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmResponse(ViSession vi, int name, int ch, int value);

   设置绝对值编码器的报警响应类型

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:响应类型 0:NONE;1:ALARM;2:STOP;3:ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderAlarmResponse_Query(ViSession vi, int name, int ch, int *value);

   查绝对值编码器的报警响应类型

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:响应类型 0:NONE;1:ALARM;2:STOP;3:ALARM&STOP

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderZeroValue(ViSession vi, int name, int ch, int value);

   设置绝对值编码器的零位值

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器零位值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQAbsEncoderZeroValue_Query(ViSession vi, int name, int ch, int *value);

   查绝对值编码器的零位值

   vi :visa设备句柄

   name:设备名称(SEND_ID)

   ch：通道号

   value:编码器零位值(编码器线数)

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartConfig(ViSession vi, int num, int name, int baud,char parity, int wordlen, int stopbit);

   设置串口应用配置，配置校验位、数据位、停止位

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   parity:RS232 的校验方式： NONE、 EVEN 或 ODD

   wordlen:RS232 的数据长度： 8 或 9

   stopbit:RS232 数据帧中停止位的位数： 1、 0.5、 2 或 1.5

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartConfig_Query(ViSession vi, int num, int name, int *baud,char *parity,int *wordlen,int *stopbit);

   查询串口应用配置，配置校验位、数据位、停止位

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   buf:信息

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartFlowctrl(ViSession vi, int num, int name, int mode);

   设置串口硬件控制流

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   mode:RS232 的流控制方式： NONE、 RTS、 CTS 或 RTS&CTS

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartFlowctrl_Query(ViSession vi, int num, int name, int *mode);

   查询串口硬件控制流

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   mode:RS232 的流控制方式： NONE、 RTS、 CTS 或 RTS&CTS

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorState(ViSession vi, int num, int num1, int name, int state);

   设置串口传感器状态，打开或关闭

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   state:打开或关闭

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorState_Query(ViSession vi, int num, int num1, int name, int *state);

   查询串口传感器状态，打开或关闭

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   state:打开或关闭  0:关闭； 1：打开

   返回值：0表示执行成功，－1表示失败



