doc/CAPI.html



<div id="outline-container-orge1fdcaa" class="outline-3">
<h3 id="orge1fdcaa"><span class="section-number-3">3.133</span> int mrgMRQEncoderType_Query(ViSession vi, int name, int ch, int *type);</h3>
<div class="outline-text-3" id="text-3-133">
<p>
查询编码器类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
type:编码器的类型： 0:INCREMENTAL 或 1:ABSOLUTE
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3e3f2de" class="outline-3">
<h3 id="org3e3f2de"><span class="section-number-3">3.134</span> int mrgMRQEncoderMultiple(ViSession vi, int name, int ch, int multiple);</h3>
<div class="outline-text-3" id="text-3-134">
<p>
设置编码器信号的倍乘
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
multiple:倍乘
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgfed22c0" class="outline-3">
<h3 id="orgfed22c0"><span class="section-number-3">3.135</span> int mrgMRQEncoderMultiple_Query(ViSession vi, int name, int ch, int *multiple);</h3>
<div class="outline-text-3" id="text-3-135">
<p>
查询编码器信号的倍乘
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
multiple:倍乘 0 - 2 "SINGLE","DOUBLE","QUADRUPLE"
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org0c28a28" class="outline-3">
<h3 id="org0c28a28"><span class="section-number-3">3.136</span> int mrgMRQEncoderState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-136">
<p>
设置编码器状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:编码器的状态：0: NONE;1: OFF ; 2:ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgca0b242" class="outline-3">
<h3 id="orgca0b242"><span class="section-number-3">3.137</span> int mrgMRQEncoderState_Query(ViSession vi, int name, int ch, int*state);</h3>
<div class="outline-text-3" id="text-3-137">
<p>
查询编码器状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state1:编码器的状态： 0:NONE; 1:OFF ;2: ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org9124d62" class="outline-3">
<h3 id="org9124d62"><span class="section-number-3">3.138</span> int mrgMRQEncoderFeedback(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-138">
<p>
设置LVT模式下编码器反馈比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
feed:编码器反馈比
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgdbdc1a0" class="outline-3">
<h3 id="orgdbdc1a0"><span class="section-number-3">3.139</span> int mrgMRQEncoderFeedback_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-139">
<p>
查询LVT模式下编码器反馈比
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
feed:编码器反馈比
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org5969133" class="outline-3">
<h3 id="org5969133"><span class="section-number-3">3.140</span> int mrgMRQEncoderDirection(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-140">
<p>
设置编码器方向
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器方向。0表示编码器逆时针转动，数值增加；1表示编码器逆时针转，数据减小
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org5df7419" class="outline-3">
<h3 id="org5df7419"><span class="section-number-3">3.141</span> int mrgMRQEncoderDirection_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-141">
<p>
查询编码器方向
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器方向。0表示编码器逆时针转动，数值增加；1表示编码器逆时针转，数据减小
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgd83e024" class="outline-3">
<h3 id="orgd83e024"><span class="section-number-3">3.142</span> int mrgMRQAbsEncoderAlarmState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-142">
<p>
设置绝对值编码器的报警状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
state:编码器报警状态 0:OFF; 1:ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org56487fd" class="outline-3">
<h3 id="org56487fd"><span class="section-number-3">3.143</span> int mrgMRQAbsEncoderAlarmState_Query(ViSession vi, int name, int ch, int *state);</h3>
<div class="outline-text-3" id="text-3-143">
<p>
查询绝对值编码器的报警状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
state:编码器报警状态 0:OFF; 1:ON
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2501a75" class="outline-3">
<h3 id="org2501a75"><span class="section-number-3">3.144</span> int mrgMRQAbsEncoderAlarmUpLimit(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-144">
<p>
设置绝对值编码器的报警上限
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器报警上限值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4095e2e" class="outline-3">
<h3 id="org4095e2e"><span class="section-number-3">3.145</span> int mrgMRQAbsEncoderAlarmUpLimit_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-145">
<p>
查绝对值编码器的报警上限
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器报警上限值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1ffeedd" class="outline-3">
<h3 id="org1ffeedd"><span class="section-number-3">3.146</span> int mrgMRQAbsEncoderAlarmDownLimit(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-146">
<p>
设置绝对值编码器的报警下限
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器报警下限值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org86376fb" class="outline-3">
<h3 id="org86376fb"><span class="section-number-3">3.147</span> int mrgMRQAbsEncoderAlarmDownLimit_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-147">
<p>
查绝对值编码器的报警下限
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器报警下限值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgfdd973a" class="outline-3">
<h3 id="orgfdd973a"><span class="section-number-3">3.148</span> int mrgMRQAbsEncoderAlarmResponse(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-148">
<p>
设置绝对值编码器的报警响应类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:响应类型 0:NONE;1:ALARM;2:STOP;3:ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgeb8a5a6" class="outline-3">
<h3 id="orgeb8a5a6"><span class="section-number-3">3.149</span> int mrgMRQAbsEncoderAlarmResponse_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-149">
<p>
查绝对值编码器的报警响应类型
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:响应类型 0:NONE;1:ALARM;2:STOP;3:ALARM&amp;STOP
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgd91e8d4" class="outline-3">
<h3 id="orgd91e8d4"><span class="section-number-3">3.150</span> int mrgMRQAbsEncoderZeroValue(ViSession vi, int name, int ch, int value);</h3>
<div class="outline-text-3" id="text-3-150">
<p>
设置绝对值编码器的零位值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器零位值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org6315904" class="outline-3">
<h3 id="org6315904"><span class="section-number-3">3.151</span> int mrgMRQAbsEncoderZeroValue_Query(ViSession vi, int name, int ch, int *value);</h3>
<div class="outline-text-3" id="text-3-151">
<p>
查绝对值编码器的零位值
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称(SEND_ID)
</p>

<p>
ch：通道号
</p>

<p>
value:编码器零位值(编码器线数)
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org710f62a" class="outline-3">
<h3 id="org710f62a"><span class="section-number-3">3.152</span> int mrgMRQUartConfig(ViSession vi, int num, int name, int baud,char parity, int wordlen, int stopbit);</h3>
<div class="outline-text-3" id="text-3-152">
<p>
设置串口应用配置，配置校验位、数据位、停止位
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
parity:RS232 的校验方式： NONE、 EVEN 或 ODD
</p>

<p>
wordlen:RS232 的数据长度： 8 或 9
</p>

<p>
stopbit:RS232 数据帧中停止位的位数： 1、 0.5、 2 或 1.5
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org76023e1" class="outline-3">
<h3 id="org76023e1"><span class="section-number-3">3.153</span> int mrgMRQUartConfig_Query(ViSession vi, int num, int name, int *baud,char *parity,int *wordlen,int *stopbit);</h3>
<div class="outline-text-3" id="text-3-153">
<p>
查询串口应用配置，配置校验位、数据位、停止位
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
buf:信息
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3546e64" class="outline-3">
<h3 id="org3546e64"><span class="section-number-3">3.154</span> int mrgMRQUartFlowctrl(ViSession vi, int num, int name, int mode);</h3>
<div class="outline-text-3" id="text-3-154">
<p>
设置串口硬件控制流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
mode:RS232 的流控制方式： NONE、 RTS、 CTS 或 RTS&amp;CTS
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orged2b15a" class="outline-3">
<h3 id="orged2b15a"><span class="section-number-3">3.155</span> int mrgMRQUartFlowctrl_Query(ViSession vi, int num, int name, int *mode);</h3>
<div class="outline-text-3" id="text-3-155">
<p>
查询串口硬件控制流
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
mode:RS232 的流控制方式： NONE、 RTS、 CTS 或 RTS&amp;CTS
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org879b974" class="outline-3">
<h3 id="org879b974"><span class="section-number-3">3.156</span> int mrgMRQUartSensorState(ViSession vi, int num, int num1, int name, int state);</h3>
<div class="outline-text-3" id="text-3-156">
<p>
设置串口传感器状态，打开或关闭
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
state:打开或关闭
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3aa1270" class="outline-3">
<h3 id="org3aa1270"><span class="section-number-3">3.157</span> int mrgMRQUartSensorState_Query(ViSession vi, int num, int num1, int name, int *state);</h3>
<div class="outline-text-3" id="text-3-157">
<p>
查询串口传感器状态，打开或关闭
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
state:打开或关闭  0:关闭； 1：打开
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
