doc/CAPI.org
** int mrgMRQUartSensorConfAll(ViSession vi, int num, int num1, int name, int sof, int framelen, int num2, int period);

   设置传感器配置，数据帧头、帧长度、周期内接收的帧数、切换周期

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   num:要设置的 UART 的串口号：数字 1 或 2

   num1:传感器所在端口号： 1， 2， 3 或 4

   sof:数据帧头

   framelen:帧长度

   num2:帧数

   period:周期

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfAll_Query(ViSession vi, int num,int num1, int name, int *sof, int* framelen, int* framenum, int* period);

   查询传感器配置，数据帧头、帧长度、周期内接收的帧数、切换周期

   *vi :visa设备句柄

   name: 设备名称（SEND_ID）

   sof:数据帧头

   framelen:帧长度

   num2:帧数

   period:周期

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfSof(ViSession vi, int num, int num1, int name, int sof);



   设置数据帧头

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   num:要设置的 UART 的串口号：数字 1 或 2

   num1:传感器所在端口号： 1， 2， 3 或 4

   sof:数据帧头

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfSof_Query(ViSession vi, int num, int num1, int name, int *sof);



   查询数据帧头

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   sof : 数据帧头

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfFrameLen(ViSession vi, int num, int num1, int name, int len);

   设置帧长度

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   len:帧长度

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfFrameLen_Query(ViSession vi, int num, int num1, int name, int *len);

   查询帧长度

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   len:帧长度

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfRecvNum(ViSession vi, int num, int num1, int name, int num2);

   设置帧个数

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   num2:帧个数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfRecvNum_Query(ViSession vi, int num, int num1, int name, int *num2);

   查询帧个数

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   num2:帧个数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfPeriod(ViSession vi, int num, int num1, int name, int period);

   设置周期

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   period:周期

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorConfPeriod_Query(ViSession vi, int num, int num1, int name, int *period);

   查询周期

   vi :visa设备句柄

   name :设备名称（SEND_ID）

   num : 要设置的 UART 的串口号：数字 1 或 2

   num1 : 传感器所在端口号： 1， 2， 3 或 4

   period:周期

   返回值：0表示执行成功，－1表示失败



** int mrgMRQUartSensorData_Query(ViSession vi, int num, int num1, int name, char *buf);

   查询传感器数据

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   buf:数据

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDistanceAlarmState_Query(ViSession vi, int name, int ch, int *state);

   查询测距报警的状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态  0:禁止； 1：使能

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDistanceAlarmState(ViSession vi, int name, int ch, int state);

   设置测距报警的状态

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state1:状态  0:禁止； 1：使能

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDistanceAlarm(ViSession vi, int name, int num, int ch, float distance);

   设置测距报警的响应距离

   alarm:ALARm1,ALARm2,ALARm3

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   distance:测距报警的响应距离

   返回值：0表示执行成功，－1表示失败



** int mrgMRQDistanceAlarm_Query(ViSession vi, int num, int name, int ch, float *distance);

   查询测距报警的响应距离

   vi :visa设备句柄

   alarm:ALARm1,ALARm2,ALARm3

   name:设备名称（SEND_ID）

   ch：通道号

   distance:测距报警的响应距离

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverType_Query(ViSession vi, int name, int ch, int *type);

   查询驱动板类型（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   type:驱动板类型

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverCurrent(ViSession vi, int name, float current);

   设置驱动板电流（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   current:驱动板电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverCurrent_Query(ViSession vi, int name, float *current);

   查询驱动板电流（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   current:驱动板电流

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverMicrosteps(ViSession vi, int name, int microstep);

   设置电机微步数（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   microstep:电机的微步数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverMicrosteps_Query(ViSession vi, int name, int *microstep);

   查询电机微步数（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   microstep:电机的微步数

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverState_Query(ViSession vi, int name, int ch, int*state);

   查询驱动开关状态（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态  0:禁止；1：使能

   返回值：0表示执行成功，－1表示失败



** int mrgMRQNewDriverState(ViSession vi, int name, int ch, int state);

   设置驱动开关状态（只支持10轴）

   vi :visa设备句柄

   name:设备名称（SEND_ID）

   ch：通道号

   state:状态 0:禁止； 1：使能

   返回值：0表示执行成功，－1表示失败





* system.h

** int mrgSysGetProjectSoftVersion(ViSession vi, char *version);

   查询 MRH-T 软件工程版本号

   vi :visa设备句柄

   返回值：0回读正确;否则回读失败



** int mrgSysGetSoftVersion(ViSession vi, char * version);

   查询 MRH-T 软件版本号

   vi :visa设备句柄

   返回值：0回读正确;否则回读失败



