doc/CAPI.html



<div id="outline-container-org1381f40" class="outline-3">
<h3 id="org1381f40"><span class="section-number-3">3.158</span> int mrgMRQUartSensorConfAll(ViSession vi, int num, int num1, int name, int sof, int framelen, int num2, int period);</h3>
<div class="outline-text-3" id="text-3-158">
<p>
设置传感器配置，数据帧头、帧长度、周期内接收的帧数、切换周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
num:要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1:传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
sof:数据帧头
</p>

<p>
framelen:帧长度
</p>

<p>
num2:帧数
</p>

<p>
period:周期
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org24fd314" class="outline-3">
<h3 id="org24fd314"><span class="section-number-3">3.159</span> int mrgMRQUartSensorConfAll_Query(ViSession vi, int num,int num1, int name, int <b>sof, int</b> framelen, int* framenum, int* period);</h3>
<div class="outline-text-3" id="text-3-159">
<p>
查询传感器配置，数据帧头、帧长度、周期内接收的帧数、切换周期
</p>

<p>
*vi :visa设备句柄
</p>

<p>
name: 设备名称（SEND_ID）
</p>

<p>
sof:数据帧头
</p>

<p>
framelen:帧长度
</p>

<p>
num2:帧数
</p>

<p>
period:周期
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org27126de" class="outline-3">
<h3 id="org27126de"><span class="section-number-3">3.160</span> int mrgMRQUartSensorConfSof(ViSession vi, int num, int num1, int name, int sof);</h3>
<div class="outline-text-3" id="text-3-160">
<p>
设置数据帧头
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
num:要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1:传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
sof:数据帧头
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgbe78d78" class="outline-3">
<h3 id="orgbe78d78"><span class="section-number-3">3.161</span> int mrgMRQUartSensorConfSof_Query(ViSession vi, int num, int num1, int name, int *sof);</h3>
<div class="outline-text-3" id="text-3-161">
<p>
查询数据帧头
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
sof : 数据帧头
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org090d7c3" class="outline-3">
<h3 id="org090d7c3"><span class="section-number-3">3.162</span> int mrgMRQUartSensorConfFrameLen(ViSession vi, int num, int num1, int name, int len);</h3>
<div class="outline-text-3" id="text-3-162">
<p>
设置帧长度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
len:帧长度
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4bf82f0" class="outline-3">
<h3 id="org4bf82f0"><span class="section-number-3">3.163</span> int mrgMRQUartSensorConfFrameLen_Query(ViSession vi, int num, int num1, int name, int *len);</h3>
<div class="outline-text-3" id="text-3-163">
<p>
查询帧长度
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
len:帧长度
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgf093cd4" class="outline-3">
<h3 id="orgf093cd4"><span class="section-number-3">3.164</span> int mrgMRQUartSensorConfRecvNum(ViSession vi, int num, int num1, int name, int num2);</h3>
<div class="outline-text-3" id="text-3-164">
<p>
设置帧个数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
num2:帧个数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org6caf36a" class="outline-3">
<h3 id="org6caf36a"><span class="section-number-3">3.165</span> int mrgMRQUartSensorConfRecvNum_Query(ViSession vi, int num, int num1, int name, int *num2);</h3>
<div class="outline-text-3" id="text-3-165">
<p>
查询帧个数
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
num2:帧个数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org1992635" class="outline-3">
<h3 id="org1992635"><span class="section-number-3">3.166</span> int mrgMRQUartSensorConfPeriod(ViSession vi, int num, int num1, int name, int period);</h3>
<div class="outline-text-3" id="text-3-166">
<p>
设置周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
period:周期
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgcd80afd" class="outline-3">
<h3 id="orgcd80afd"><span class="section-number-3">3.167</span> int mrgMRQUartSensorConfPeriod_Query(ViSession vi, int num, int num1, int name, int *period);</h3>
<div class="outline-text-3" id="text-3-167">
<p>
查询周期
</p>

<p>
vi :visa设备句柄
</p>

<p>
name :设备名称（SEND_ID）
</p>

<p>
num : 要设置的 UART 的串口号：数字 1 或 2
</p>

<p>
num1 : 传感器所在端口号： 1， 2， 3 或 4
</p>

<p>
period:周期
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgf88f370" class="outline-3">
<h3 id="orgf88f370"><span class="section-number-3">3.168</span> int mrgMRQUartSensorData_Query(ViSession vi, int num, int num1, int name, char *buf);</h3>
<div class="outline-text-3" id="text-3-168">
<p>
查询传感器数据
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
buf:数据
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgc8a6fc2" class="outline-3">
<h3 id="orgc8a6fc2"><span class="section-number-3">3.169</span> int mrgMRQDistanceAlarmState_Query(ViSession vi, int name, int ch, int *state);</h3>
<div class="outline-text-3" id="text-3-169">
<p>
查询测距报警的状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态  0:禁止； 1：使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgf938688" class="outline-3">
<h3 id="orgf938688"><span class="section-number-3">3.170</span> int mrgMRQDistanceAlarmState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-170">
<p>
设置测距报警的状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state1:状态  0:禁止； 1：使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3dd0e2b" class="outline-3">
<h3 id="org3dd0e2b"><span class="section-number-3">3.171</span> int mrgMRQDistanceAlarm(ViSession vi, int name, int num, int ch, float distance);</h3>
<div class="outline-text-3" id="text-3-171">
<p>
设置测距报警的响应距离
</p>

<p>
alarm:ALARm1,ALARm2,ALARm3
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
distance:测距报警的响应距离
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org92e76cf" class="outline-3">
<h3 id="org92e76cf"><span class="section-number-3">3.172</span> int mrgMRQDistanceAlarm_Query(ViSession vi, int num, int name, int ch, float *distance);</h3>
<div class="outline-text-3" id="text-3-172">
<p>
查询测距报警的响应距离
</p>

<p>
vi :visa设备句柄
</p>

<p>
alarm:ALARm1,ALARm2,ALARm3
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
distance:测距报警的响应距离
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2c38c34" class="outline-3">
<h3 id="org2c38c34"><span class="section-number-3">3.173</span> int mrgMRQNewDriverType_Query(ViSession vi, int name, int ch, int *type);</h3>
<div class="outline-text-3" id="text-3-173">
<p>
查询驱动板类型（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
type:驱动板类型
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgd24bbb2" class="outline-3">
<h3 id="orgd24bbb2"><span class="section-number-3">3.174</span> int mrgMRQNewDriverCurrent(ViSession vi, int name, float current);</h3>
<div class="outline-text-3" id="text-3-174">
<p>
设置驱动板电流（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
current:驱动板电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgba3eb69" class="outline-3">
<h3 id="orgba3eb69"><span class="section-number-3">3.175</span> int mrgMRQNewDriverCurrent_Query(ViSession vi, int name, float *current);</h3>
<div class="outline-text-3" id="text-3-175">
<p>
查询驱动板电流（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
current:驱动板电流
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org77d2433" class="outline-3">
<h3 id="org77d2433"><span class="section-number-3">3.176</span> int mrgMRQNewDriverMicrosteps(ViSession vi, int name, int microstep);</h3>
<div class="outline-text-3" id="text-3-176">
<p>
设置电机微步数（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
microstep:电机的微步数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org2d91f52" class="outline-3">
<h3 id="org2d91f52"><span class="section-number-3">3.177</span> int mrgMRQNewDriverMicrosteps_Query(ViSession vi, int name, int *microstep);</h3>
<div class="outline-text-3" id="text-3-177">
<p>
查询电机微步数（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
microstep:电机的微步数
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org38eef92" class="outline-3">
<h3 id="org38eef92"><span class="section-number-3">3.178</span> int mrgMRQNewDriverState_Query(ViSession vi, int name, int ch, int*state);</h3>
<div class="outline-text-3" id="text-3-178">
<p>
查询驱动开关状态（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态  0:禁止；1：使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge294b64" class="outline-3">
<h3 id="orge294b64"><span class="section-number-3">3.179</span> int mrgMRQNewDriverState(ViSession vi, int name, int ch, int state);</h3>
<div class="outline-text-3" id="text-3-179">
<p>
设置驱动开关状态（只支持10轴）
</p>

<p>
vi :visa设备句柄
</p>

<p>
name:设备名称（SEND_ID）
</p>

<p>
ch：通道号
</p>

<p>
state:状态 0:禁止； 1：使能
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>
</div>





<div id="outline-container-orgcaea91e" class="outline-2">
<h2 id="orgcaea91e"><span class="section-number-2">4</span> system.h</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge0d7ec6" class="outline-3">
<h3 id="orge0d7ec6"><span class="section-number-3">4.1</span> int mrgSysGetProjectSoftVersion(ViSession vi, char *version);</h3>
<div class="outline-text-3" id="text-4-1">
<p>
查询 MRH-T 软件工程版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0回读正确;否则回读失败
</p>
</div>
</div>



<div id="outline-container-orgb96c2b3" class="outline-3">
<h3 id="orgb96c2b3"><span class="section-number-3">4.2</span> int mrgSysGetSoftVersion(ViSession vi, char * version);</h3>
<div class="outline-text-3" id="text-4-2">
<p>
查询 MRH-T 软件版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0回读正确;否则回读失败
</p>
</div>
</div>
