doc/CAPI.html



<div id="outline-container-org8480300" class="outline-3">
<h3 id="org8480300"><span class="section-number-3">4.3</span> int mrgSysGetBackBoardSoftVersion(ViSession vi,char * version);</h3>
<div class="outline-text-3" id="text-4-3">
<p>
查询 MRH-T 背板的软件版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0回读正确;否则回读失败
</p>
</div>
</div>



<div id="outline-container-org88d6eb3" class="outline-3">
<h3 id="org88d6eb3"><span class="section-number-3">4.4</span> int mrgSysGetBackBoardHardVersion(ViSession vi, char * version);</h3>
<div class="outline-text-3" id="text-4-4">
<p>
查询 MRH-T 背板的硬件版本号
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0回读正确;否则回读失败
</p>
</div>
</div>



<div id="outline-container-orge775669" class="outline-3">
<h3 id="orge775669"><span class="section-number-3">4.5</span> int mrgSysStartCan(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-5">
<p>
启动MARH的CAN口
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org4f6cccc" class="outline-3">
<h3 id="org4f6cccc"><span class="section-number-3">4.6</span> int mrgSysResetCan(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-6">
<p>
复位MRH的CAN口
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgcb89dad" class="outline-3">
<h3 id="orgcb89dad"><span class="section-number-3">4.7</span> int mrgSysConfCan(ViSession vi, int baud);</h3>
<div class="outline-text-3" id="text-4-7">
<p>
配置MRH的CAN口波特率
</p>

<p>
vi :visa设备句柄
</p>

<p>
baud:波特率 1000000,800000,500000,250000,125000,100000
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orgd13648c" class="outline-3">
<h3 id="orgd13648c"><span class="section-number-3">4.8</span> int mrgSysConfCan_Query(ViSession vi, int* baud);</h3>
<div class="outline-text-3" id="text-4-8">
<p>
获取MRH的CAN口波特率
</p>

<p>
vi :visa设备句柄
</p>

<p>
baud:波特率 1000000,800000,500000,250000,125000,100000
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-org3867b1d" class="outline-3">
<h3 id="org3867b1d"><span class="section-number-3">4.9</span> int mrgSysModeSwitch(ViSession vi, int mode);</h3>
<div class="outline-text-3" id="text-4-9">
<p>
切换 MRH-T 的模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode:MRH-T 的模式，取值范围： [0, 1]
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orge63ed53" class="outline-3">
<h3 id="orge63ed53"><span class="section-number-3">4.10</span> int mrgGetSysMode(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-10">
<p>
查询 MRH-T 的模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
返回值：MRH-T 的模式
</p>
</div>
</div>



<div id="outline-container-orgc9b96e2" class="outline-3">
<h3 id="orgc9b96e2"><span class="section-number-3">4.11</span> int mrgSysInstructionMode(ViSession vi, int mode);</h3>
<div class="outline-text-3" id="text-4-11">
<p>
设置指令表的模式 按行执行或者按段执行
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode:指令表执行模式，取值范围： [0, 1]. 0表示按行执行,1表示按段执行
</p>

<p>
返回值：0表示执行成功，－1表示失败
</p>
</div>
</div>



<div id="outline-container-orged82aa3" class="outline-3">
<h3 id="orged82aa3"><span class="section-number-3">4.12</span> int mrgSysInstructionMode_Query(ViSession vi, int* mode);</h3>
<div class="outline-text-3" id="text-4-12">
<p>
查询指令表的模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode:指令表执行模式，取值范围： [0, 1]. 0表示按行执行,1表示按段执行
</p>

<p>
返回值：0表示执行成功,否则表示执行失败
</p>
</div>
</div>



<div id="outline-container-org0f97228" class="outline-3">
<h3 id="org0f97228"><span class="section-number-3">4.13</span> int mrgSysSetNetworkIPMode(ViSession vi,int mode);</h3>
<div class="outline-text-3" id="text-4-13">
<p>
设置网络的IP模式 
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode : IP 模式 0-&gt;静态IP; 1-&gt;DHCP
</p>

<p>
返回值：0设置成功,-1设置失败
</p>
</div>
</div>



<div id="outline-container-orgec91a92" class="outline-3">
<h3 id="orgec91a92"><span class="section-number-3">4.14</span> int mrgSysGetNetworkIPMode(ViSession vi, int* mode);</h3>
<div class="outline-text-3" id="text-4-14">
<p>
获取网络的IP模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
mode : IP 模式 0-&gt;静态IP; 1-&gt;DHCP
</p>

<p>
返回值：0执行成功,否则执行失败
</p>
</div>
</div>



<div id="outline-container-org17acc48" class="outline-3">
<h3 id="org17acc48"><span class="section-number-3">4.15</span> int mrgSysWifiScan(ViSession vi, char *result, int len);</h3>
<div class="outline-text-3" id="text-4-15">
<p>
扫描可用的WIFI
</p>

<p>
vi :visa设备句柄
</p>

<p>
result：可用的WIFI命令，以逗号分隔
</p>

<p>
返回值：返回实际接收到的数据长度
</p>
</div>
</div>



<div id="outline-container-orgf461789" class="outline-3">
<h3 id="orgf461789"><span class="section-number-3">4.16</span> int mrgSysWifiConfig(ViSession vi, char *name, char *passwd);</h3>
<div class="outline-text-3" id="text-4-16">
<p>
配置WIFI
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：WIFi名称
</p>

<p>
passwd：密码
</p>

<p>
返回值：返回实际接收到的数据长度
</p>
</div>
</div>



<div id="outline-container-org41f327b" class="outline-3">
<h3 id="org41f327b"><span class="section-number-3">4.17</span> int mrgSysWifiUpDown(ViSession vi, int state);</h3>
<div class="outline-text-3" id="text-4-17">
<p>
停止或启动无线网卡
</p>

<p>
vi :visa设备句柄
</p>

<p>
state：0表示停止， 1表示启用
</p>

<p>
返回值：0:执行成功； 否则执行失败
</p>
</div>
</div>



<div id="outline-container-orgaf9e83a" class="outline-3">
<h3 id="orgaf9e83a"><span class="section-number-3">4.18</span> int mrgSysWifiCheckState(ViSession vi, int timeout_ms);</h3>
<div class="outline-text-3" id="text-4-18">
<p>
检查WIFI的连接状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
timeout_ms：等待超时时间，单位：ms
</p>

<p>
返回值：0:连接超时或未连接； 1：连接成功
</p>
</div>
</div>



<div id="outline-container-org6d1ee47" class="outline-3">
<h3 id="org6d1ee47"><span class="section-number-3">4.19</span> int mrgSysGetWifiConnected(ViSession vi, char *name);</h3>
<div class="outline-text-3" id="text-4-19">
<p>
查询当前已连接上的WIFI名称
</p>

<p>
vi :visa设备句柄
</p>

<p>
name：WIFI名
</p>

<p>
返回值：0:执行成功； 否则执行失败
</p>
</div>
</div>



<div id="outline-container-org839730c" class="outline-3">
<h3 id="org839730c"><span class="section-number-3">4.20</span> int mrgSysSetHeartPeriod(ViSession vi, int value);</h3>
<div class="outline-text-3" id="text-4-20">
<p>
设置系统的心跳时间,单位:秒
</p>

<p>
vi :visa设备句柄
</p>

<p>
value: 心跳时间,单位:秒
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-org4272bb4" class="outline-3">
<h3 id="org4272bb4"><span class="section-number-3">4.21</span> int mrgSysGetHeartPeriod(ViSession vi, int *value);</h3>
<div class="outline-text-3" id="text-4-21">
<p>
查询系统的心跳时间,单位:秒
</p>

<p>
vi :visa设备句柄
</p>

<p>
value: 心跳时间,单位:秒
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-orgf0e3535" class="outline-3">
<h3 id="orgf0e3535"><span class="section-number-3">4.22</span> int mrgSysSetPowerOn(ViSession vi, int value);</h3>
<div class="outline-text-3" id="text-4-22">
<p>
设置系统上电值
</p>

<p>
vi :visa设备句柄
</p>

<p>
value: 上电值 DEFAULT|LAST
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-orga763620" class="outline-3">
<h3 id="orga763620"><span class="section-number-3">4.23</span> int mrgSysGetPowerOn(ViSession vi, int *value);</h3>
<div class="outline-text-3" id="text-4-23">
<p>
查询系统上电值
</p>

<p>
vi :visa设备句柄
</p>

<p>
value: 上电值 0:DEFAULT; 1:LAST
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-org993f09f" class="outline-3">
<h3 id="org993f09f"><span class="section-number-3">4.24</span> int mrgSysSetInterface(ViSession vi, int face);</h3>
<div class="outline-text-3" id="text-4-24">
<p>
设置系统控制接口
</p>

<p>
vi :visa设备句柄
</p>

<p>
interface: 上电值 LAN|USB|IO
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-org8fc553e" class="outline-3">
<h3 id="org8fc553e"><span class="section-number-3">4.25</span> int mrgSysGetInterface(ViSession vi, int *face);</h3>
<div class="outline-text-3" id="text-4-25">
<p>
查询系统控制接口
</p>

<p>
vi :visa设备句柄
</p>

<p>
interface: 控制接口 LAN|USB|IO
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-org68c0ef3" class="outline-3">
<h3 id="org68c0ef3"><span class="section-number-3">4.26</span> int mrgSysSetEmergencyStop(ViSession vi, int state);</h3>
<div class="outline-text-3" id="text-4-26">
<p>
设置紧急停止
</p>

<p>
vi :visa设备句柄
</p>

<p>
state: 0-&gt;OFF| 1-&gt;ON
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>

<p>
紧急停止时,会停止当前系统CAN网络中的所有设备,并设置紧急停止标志位.在紧急标志位被清除前,不接受任何CAN帧.
</p>

<p>
当state为OFF时,只是清除标志位
</p>
</div>
</div>



<div id="outline-container-orgfe0dafd" class="outline-3">
<h3 id="orgfe0dafd"><span class="section-number-3">4.27</span> int mrgSysGetEmergencyStopState(ViSession vi, int *state);</h3>
<div class="outline-text-3" id="text-4-27">
<p>
查询紧急停止标志位,主要用来清除标志位
</p>

<p>
vi :visa设备句柄
</p>

<p>
state:  0-&gt;OFF| 1-&gt;ON
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>

<p>
紧急停止时,会自动设置此标志位
</p>
</div>
</div>



<div id="outline-container-org0cfd104" class="outline-3">
<h3 id="org0cfd104"><span class="section-number-3">4.28</span> int mrgSysUpdateFileSearch(ViSession vi, char *fileList);</h3>
<div class="outline-text-3" id="text-4-28">
<p>
vi :visa设备句柄
</p>

<p>
查询可用的升级文件名字
</p>

<p>
成功返回0,失败返回-1,返回1表示没有U盘
</p>
</div>
</div>



<div id="outline-container-org6d1eb41" class="outline-3">
<h3 id="org6d1eb41"><span class="section-number-3">4.29</span> int mrgSysUpdateFileStart(ViSession vi, char *filename);</h3>
<div class="outline-text-3" id="text-4-29">
<p>
mrgSysUpdateFileStart 更新固件
</p>

<p>
vi 句柄
</p>

<p>
filename 升级的文件名
</p>

<p>
返回值: 失败返回负数,成功返回0,超时返回1
</p>
</div>
</div>



<div id="outline-container-org55a57b8" class="outline-3">
<h3 id="org55a57b8"><span class="section-number-3">4.30</span> int mrgSysUpdateFirmwareStatusQuery(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-30">
<p>
mrgSysUpdateFirmwareStatusQuery 查询当前升级状态
</p>

<p>
vi
</p>

<p>
成功返回0，失败返回负数，正在升级返回1
</p>
</div>
</div>



<div id="outline-container-orga3b24b7" class="outline-3">
<h3 id="orga3b24b7"><span class="section-number-3">4.31</span> int mrgScriptSearch(ViSession vi, int isUdisk, char *fileList);</h3>
<div class="outline-text-3" id="text-4-31">
<p>
获取MRHT上的py脚本列表
</p>

<p>
vi: visa句柄
</p>

<p>
isUdisk: 1为U盘,0为MRH-T内部
</p>

<p>
fileList 输出查询到文件列表
</p>

<p>
失败返回-1,成功返回0，返回1表示没有文件，返回2表示没有U盘
</p>
</div>
</div>



<div id="outline-container-org6c00c88" class="outline-3">
<h3 id="org6c00c88"><span class="section-number-3">4.32</span> int mrgScriptConfig(ViSession vi, char *filename, int isBoot);</h3>
<div class="outline-text-3" id="text-4-32">
<p>
配置脚本及是否开机自启动
</p>

<p>
vi: visa句柄
</p>

<p>
filename: 要配置的文件名
</p>

<p>
isBoot: 设置为开机启动,0为不启动,1为启动
</p>

<p>
成功返回0, 失败返回-1
</p>

<p>
如果配置的文件名为U盘中的文件名，则会将U盘中的文件导入到MRHT内部并配置为当前脚本
</p>
</div>
</div>



<div id="outline-container-orga4d240c" class="outline-3">
<h3 id="orga4d240c"><span class="section-number-3">4.33</span> int mrgScriptConfigQuery(ViSession vi, char *filename);</h3>
<div class="outline-text-3" id="text-4-33">
<p>
查询当前配置的脚本名字
</p>

<p>
vi: visa句柄
</p>

<p>
filename: 输出查询到的配置脚本名字
</p>

<p>
成功返回0, 失败返回-1
</p>
</div>
</div>



<div id="outline-container-orgeb5436a" class="outline-3">
<h3 id="orgeb5436a"><span class="section-number-3">4.34</span> int mrgScriptRun(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-34">
<p>
运行当前配置的脚本
</p>

<p>
vi: visa句柄
</p>

<p>
成功返回0, 失败返回-1
</p>
</div>
</div>
