doc/CAPI.org
** int mrgScriptStop(ViSession vi);

   停止运行当前配置的脚本

   vi: visa句柄

   成功返回0, 失败返回-1



** int mrgScriptGetCurrentStates(ViSession vi);

   停止运行当前配置的脚本

   vi: visa句柄

   失败返回-1，运行返回1，停止返回0



** int mrgSystemRunCmd(ViSession vi, char *cmd, int isBackground);

   执行命令行命令

   vi: visa句柄

   cmd: 命令内容

   isBackground: 是否后台执行

   0表示阻塞执行时间短命令,如创建文件修改权限等

   1表示将命令放到后台执行,如重启网卡,启动MCT等

   失败返回-1,成功返回0





* errorcode.h

** int mrgErrorCodeConfigUpload(ViSession vi, int code, int *type, int *response, int *diagnose, int *enable);

   上传错误代码配置

   vi :visa设备句柄

   code:错误代码值

   type:输出类型，F/W/I ->错误/警告/信息 -> 1,2,3

   diagnose: 输出诊断器是否配置 必配/选配 -> 0,1

   response: 输出错误响应，A/B/C/D/E/F/G -> 1,2,3,4,5,6,7

   enable: 输出是否使能 Y/N ->0,1



** int mrgErrorCodeConfigDownload(ViSession vi, int code, int type, int response, int diagnose, int enable);

   下载错误代码配置

   vi :visa设备句柄

   code:错误代码值

   type:类型，F/W/I ->错误/警告/信息 -> 1,2,3

   diagnose: 诊断器是否配置 必配/选配 -> 0,1

   response: 错误响应，A/B/C/D/E/F/G -> 1,2,3,4,5,6,7

   enable: 是否使能 Y/N ->0,1



** int mrgErrorLogUpload(ViSession vi, int format, char* errorLog, int len);

   返回错误文件

   vi visa设备句柄

   format NORMAL|ZIP|TARGZ|TAR -> 0,1,2,3

   errorLog 返回错误日志

   len 长度

   获取数据长度



** int mrgErrorLogClear(ViSession vi);

   清除错误日志

   vi :visa设备句柄





* storage.h

** int mrgStorageMotionFileQuery(ViSession vi, int type, char *fileList, int len);

   查询存储器中，可用的运动文件

   vi :visa设备句柄

   type:0表示本地存储（本地文件系统）；1表示外部存储（U盘之类）

   fileList: 点坐标文件名列表，以逗号分隔

   len : fileList的缓存长度

   返回值：大于零表示返回实际的字节数，小于零表示出错



** int mrgStorageMotionFileDelete(ViSession vi, char *fileName);

   删除本地存储器中的运动文件

   vi :visa设备句柄

   location:0表示本地存储（本地文件系统）；1表示外部存储（U盘之类）

   fileList: 点坐标文件名列表，以逗号分隔

   len : fileList的缓存长度

   返回值：大于零表示返回实际的字节数，小于零表示出错



** int mrgStorageMotionFileContextRead(ViSession vi, char *filename, char *context, int wantlen);

   读取运动文件内容到上位机

   vi :visa设备句柄

   filename: 文件名

   context：读取到的内容

   wantlen： context（存储区）的长度

   返回值：返回实际的文件长度



** int mrgStorageMotionFileSaveContext(ViSession vi, char *context, int len, char *saveFileName);

   保存运动文件内容到本地存储器

   vi :visa设备句柄

   context: 文件内容

   len:文件内容长度

   saveFileName：目的文件名

   返回值：  0：写入成功；1：写入失败



** int mrgStorageWriteFile(ViSession vi, int isUdisk, char *path, char *saveFileName, unsigned char *data, int dataLen);

   保存文件内容

   vi :visa设备句柄

   isUdisk: 是否写在U盘上

   path: 文件路径

   saveFileName：目的文件名

   data: 文件内容

   dataLen:文件内容长度

   返回值：  0：写入成功；1：写入失败



** int mrgStorageReadFile(ViSession vi, int isUdisk, char *path, char* filename, unsigned char* context);

   读取文件到上位机

   vi :visa设备句柄

   isUdisk: 是否写在U盘上

   path: 文件路径

   filename: 文件名

   context：读取到的内容

   返回值：返回实际的文件长度

      



* project.h

** int mrgSetProjectMode(ViSession vi, int state);

   设置系统为工程模式

   vi :visa设备句柄

   state: 0->OFF| 1->ON

   返回值：0表示执行成功；－1表示执行失败

   说明: 只有在工程模式下,才允许读取IO状态



** int mrgProjectGetXinState(ViSession vi, int index, unsigned int *state)

   查询外部IO的状态

   vi :visa设备句柄

   index: 0->所有,1->X1,2->X2...

   state: 每一位表示一个IO的状态

   返回值：0表示执行成功；－1表示执行失败



** int mrgProjectSetYout(ViSession vi, int index, int state);

   设置系统的外部输出IO的状态

   vi :visa设备句柄

   index: 0->ALL, 1->YOUT1, 2->YOUT2,3->YOUT3, 4->YOUT4

   state: 0->low, 1->high

   返回值：0表示执行成功；－1表示执行失败

   说明: 不支持 同时写出YOUT



** int mrgProjectSetSerialNum(ViSession vi, char *serial);

   设置系统的序列号

   vi :visa设备句柄

   serial: 序列号

   返回值：0表示执行成功；－1表示执行失败



** int mrgProjectGetSerialNum(ViSession vi, char *serial);

   查询系统的序列号

   vi :visa设备句柄

   serial: 序列号

   返回值：返回序列号的长度

