doc/CAPI.html



<div id="outline-container-orgb1c5145" class="outline-3">
<h3 id="orgb1c5145"><span class="section-number-3">4.35</span> int mrgScriptStop(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-35">
<p>
停止运行当前配置的脚本
</p>

<p>
vi: visa句柄
</p>

<p>
成功返回0, 失败返回-1
</p>
</div>
</div>



<div id="outline-container-org19f7763" class="outline-3">
<h3 id="org19f7763"><span class="section-number-3">4.36</span> int mrgScriptGetCurrentStates(ViSession vi);</h3>
<div class="outline-text-3" id="text-4-36">
<p>
停止运行当前配置的脚本
</p>

<p>
vi: visa句柄
</p>

<p>
失败返回-1，运行返回1，停止返回0
</p>
</div>
</div>



<div id="outline-container-orgb1ea98f" class="outline-3">
<h3 id="orgb1ea98f"><span class="section-number-3">4.37</span> int mrgSystemRunCmd(ViSession vi, char *cmd, int isBackground);</h3>
<div class="outline-text-3" id="text-4-37">
<p>
执行命令行命令
</p>

<p>
vi: visa句柄
</p>

<p>
cmd: 命令内容
</p>

<p>
isBackground: 是否后台执行
</p>

<p>
0表示阻塞执行时间短命令,如创建文件修改权限等
</p>

<p>
1表示将命令放到后台执行,如重启网卡,启动MCT等
</p>

<p>
失败返回-1,成功返回0
</p>
</div>
</div>
</div>





<div id="outline-container-org0d82612" class="outline-2">
<h2 id="org0d82612"><span class="section-number-2">5</span> errorcode.h</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orga8e7b0a" class="outline-3">
<h3 id="orga8e7b0a"><span class="section-number-3">5.1</span> int mrgErrorCodeConfigUpload(ViSession vi, int code, int *type, int *response, int *diagnose, int *enable);</h3>
<div class="outline-text-3" id="text-5-1">
<p>
上传错误代码配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
code:错误代码值
</p>

<p>
type:输出类型，F/W/I -&gt;错误/警告/信息 -&gt; 1,2,3
</p>

<p>
diagnose: 输出诊断器是否配置 必配/选配 -&gt; 0,1
</p>

<p>
response: 输出错误响应，A/B/C/D/E/F/G -&gt; 1,2,3,4,5,6,7
</p>

<p>
enable: 输出是否使能 Y/N -&gt;0,1
</p>
</div>
</div>



<div id="outline-container-org9680d7e" class="outline-3">
<h3 id="org9680d7e"><span class="section-number-3">5.2</span> int mrgErrorCodeConfigDownload(ViSession vi, int code, int type, int response, int diagnose, int enable);</h3>
<div class="outline-text-3" id="text-5-2">
<p>
下载错误代码配置
</p>

<p>
vi :visa设备句柄
</p>

<p>
code:错误代码值
</p>

<p>
type:类型，F/W/I -&gt;错误/警告/信息 -&gt; 1,2,3
</p>

<p>
diagnose: 诊断器是否配置 必配/选配 -&gt; 0,1
</p>

<p>
response: 错误响应，A/B/C/D/E/F/G -&gt; 1,2,3,4,5,6,7
</p>

<p>
enable: 是否使能 Y/N -&gt;0,1
</p>
</div>
</div>



<div id="outline-container-orgfea9fb4" class="outline-3">
<h3 id="orgfea9fb4"><span class="section-number-3">5.3</span> int mrgErrorLogUpload(ViSession vi, int format, char* errorLog, int len);</h3>
<div class="outline-text-3" id="text-5-3">
<p>
返回错误文件
</p>

<p>
vi visa设备句柄
</p>

<p>
format NORMAL|ZIP|TARGZ|TAR -&gt; 0,1,2,3
</p>

<p>
errorLog 返回错误日志
</p>

<p>
len 长度
</p>

<p>
获取数据长度
</p>
</div>
</div>



<div id="outline-container-orgb9408bf" class="outline-3">
<h3 id="orgb9408bf"><span class="section-number-3">5.4</span> int mrgErrorLogClear(ViSession vi);</h3>
<div class="outline-text-3" id="text-5-4">
<p>
清除错误日志
</p>

<p>
vi :visa设备句柄
</p>
</div>
</div>
</div>





<div id="outline-container-org364655a" class="outline-2">
<h2 id="org364655a"><span class="section-number-2">6</span> storage.h</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org4a45b05" class="outline-3">
<h3 id="org4a45b05"><span class="section-number-3">6.1</span> int mrgStorageMotionFileQuery(ViSession vi, int type, char *fileList, int len);</h3>
<div class="outline-text-3" id="text-6-1">
<p>
查询存储器中，可用的运动文件
</p>

<p>
vi :visa设备句柄
</p>

<p>
type:0表示本地存储（本地文件系统）；1表示外部存储（U盘之类）
</p>

<p>
fileList: 点坐标文件名列表，以逗号分隔
</p>

<p>
len : fileList的缓存长度
</p>

<p>
返回值：大于零表示返回实际的字节数，小于零表示出错
</p>
</div>
</div>



<div id="outline-container-org1984c0d" class="outline-3">
<h3 id="org1984c0d"><span class="section-number-3">6.2</span> int mrgStorageMotionFileDelete(ViSession vi, char *fileName);</h3>
<div class="outline-text-3" id="text-6-2">
<p>
删除本地存储器中的运动文件
</p>

<p>
vi :visa设备句柄
</p>

<p>
location:0表示本地存储（本地文件系统）；1表示外部存储（U盘之类）
</p>

<p>
fileList: 点坐标文件名列表，以逗号分隔
</p>

<p>
len : fileList的缓存长度
</p>

<p>
返回值：大于零表示返回实际的字节数，小于零表示出错
</p>
</div>
</div>



<div id="outline-container-orgbe409da" class="outline-3">
<h3 id="orgbe409da"><span class="section-number-3">6.3</span> int mrgStorageMotionFileContextRead(ViSession vi, char *filename, char *context, int wantlen);</h3>
<div class="outline-text-3" id="text-6-3">
<p>
读取运动文件内容到上位机
</p>

<p>
vi :visa设备句柄
</p>

<p>
filename: 文件名
</p>

<p>
context：读取到的内容
</p>

<p>
wantlen： context（存储区）的长度
</p>

<p>
返回值：返回实际的文件长度
</p>
</div>
</div>



<div id="outline-container-org1569bec" class="outline-3">
<h3 id="org1569bec"><span class="section-number-3">6.4</span> int mrgStorageMotionFileSaveContext(ViSession vi, char *context, int len, char *saveFileName);</h3>
<div class="outline-text-3" id="text-6-4">
<p>
保存运动文件内容到本地存储器
</p>

<p>
vi :visa设备句柄
</p>

<p>
context: 文件内容
</p>

<p>
len:文件内容长度
</p>

<p>
saveFileName：目的文件名
</p>

<p>
返回值：  0：写入成功；1：写入失败
</p>
</div>
</div>



<div id="outline-container-org2fea9a8" class="outline-3">
<h3 id="org2fea9a8"><span class="section-number-3">6.5</span> int mrgStorageWriteFile(ViSession vi, int isUdisk, char *path, char *saveFileName, unsigned char *data, int dataLen);</h3>
<div class="outline-text-3" id="text-6-5">
<p>
保存文件内容
</p>

<p>
vi :visa设备句柄
</p>

<p>
isUdisk: 是否写在U盘上
</p>

<p>
path: 文件路径
</p>

<p>
saveFileName：目的文件名
</p>

<p>
data: 文件内容
</p>

<p>
dataLen:文件内容长度
</p>

<p>
返回值：  0：写入成功；1：写入失败
</p>
</div>
</div>



<div id="outline-container-org6847944" class="outline-3">
<h3 id="org6847944"><span class="section-number-3">6.6</span> int mrgStorageReadFile(ViSession vi, int isUdisk, char <b>path, char</b> filename, unsigned char* context);</h3>
<div class="outline-text-3" id="text-6-6">
<p>
读取文件到上位机
</p>

<p>
vi :visa设备句柄
</p>

<p>
isUdisk: 是否写在U盘上
</p>

<p>
path: 文件路径
</p>

<p>
filename: 文件名
</p>

<p>
context：读取到的内容
</p>

<p>
返回值：返回实际的文件长度
</p>
</div>
</div>
</div>





<div id="outline-container-orge6c8d4c" class="outline-2">
<h2 id="orge6c8d4c"><span class="section-number-2">7</span> project.h</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org21b0940" class="outline-3">
<h3 id="org21b0940"><span class="section-number-3">7.1</span> int mrgSetProjectMode(ViSession vi, int state);</h3>
<div class="outline-text-3" id="text-7-1">
<p>
设置系统为工程模式
</p>

<p>
vi :visa设备句柄
</p>

<p>
state: 0-&gt;OFF| 1-&gt;ON
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>

<p>
说明: 只有在工程模式下,才允许读取IO状态
</p>
</div>
</div>



<div id="outline-container-org09b02f6" class="outline-3">
<h3 id="org09b02f6"><span class="section-number-3">7.2</span> int mrgProjectGetXinState(ViSession vi, int index, unsigned int *state)</h3>
<div class="outline-text-3" id="text-7-2">
<p>
查询外部IO的状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
index: 0-&gt;所有,1-&gt;X1,2-&gt;X2&#x2026;
</p>

<p>
state: 每一位表示一个IO的状态
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-orgf4c2bc7" class="outline-3">
<h3 id="orgf4c2bc7"><span class="section-number-3">7.3</span> int mrgProjectSetYout(ViSession vi, int index, int state);</h3>
<div class="outline-text-3" id="text-7-3">
<p>
设置系统的外部输出IO的状态
</p>

<p>
vi :visa设备句柄
</p>

<p>
index: 0-&gt;ALL, 1-&gt;YOUT1, 2-&gt;YOUT2,3-&gt;YOUT3, 4-&gt;YOUT4
</p>

<p>
state: 0-&gt;low, 1-&gt;high
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>

<p>
说明: 不支持 同时写出YOUT
</p>
</div>
</div>



<div id="outline-container-orga206c72" class="outline-3">
<h3 id="orga206c72"><span class="section-number-3">7.4</span> int mrgProjectSetSerialNum(ViSession vi, char *serial);</h3>
<div class="outline-text-3" id="text-7-4">
<p>
设置系统的序列号
</p>

<p>
vi :visa设备句柄
</p>

<p>
serial: 序列号
</p>

<p>
返回值：0表示执行成功；－1表示执行失败
</p>
</div>
</div>



<div id="outline-container-orged304eb" class="outline-3">
<h3 id="orged304eb"><span class="section-number-3">7.5</span> int mrgProjectGetSerialNum(ViSession vi, char *serial);</h3>
<div class="outline-text-3" id="text-7-5">
<p>
查询系统的序列号
</p>

<p>
vi :visa设备句柄
</p>

<p>
serial: 序列号
</p>

<p>
返回值：返回序列号的长度
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nieshizhong</p>
<p class="date">Created: 2019-08-09 五 12:00</p>
<p class="validation"></p>
</div>
</body>
</html>
